[
    {
        "title": "Alabama Vs Virginia Tech Game Survival Guide",
        "url": "https://www.reddit.com/r/rolltide/comments/84aa40/alabama_vs_virginia_tech_game_survival_guide/",
        "score": 19,
        "num_comments": 4,
        "text": "**Key players to the game**\n\nAlabama: Collin Sexton: 19 PPG 44% FG 34 percent from 3\n\nTech: Justin Robinson: 13.8 PPG 45 % FG 40 Percent from 3 this guy is a freaking shooter he can pull it from anywhere on the floor and hit the bottom of the net every time. He is probably the second best shooter at guard spot this team has faced only behind Trey Young.\n\n###\n\nKeys to the game\n\nTech loves to push the pace they play fast and they play hard. Every missed shot look for them to fly down and look for an easy basket. For Bama to win this game we must hustle back on defense and set up early\n\nBama can not afford to turn this game into a 3 point shoot out. Tech will live at the 3 point line all day if they could. We have to make them put the ball on the floor\n\n### \n\nVideo Breakdown: \n\n[Here](https://youtu.be/7QdFpqLCQYM?t=1489) we see Vtech (in pink) setup in there half court defense L'ville tries to set up a similar play alabama runs often which is a high screen and roll at the top of the key. Vtech knows the play is coming so they completely disregard the screen and trap the ball carrier up top in no mans land to force a turnover\n\n[Here](https://youtu.be/7QdFpqLCQYM?t=1574) we see a good indication of the pace Vtech plays with.  They force L'ville to take a long 3 right when the rebound is secured all 5 of the Tech players on the floor are sprinting down the floor to setup for an easy bucket and they get their best post player one one one in the post for an easy foul call (they make both free throws)\n\n[Here](https://youtu.be/7QdFpqLCQYM?t=2505) is where i was talking about this point guard can stroke it. Great defense on him he still drills a step back off one foot for the buzzer beater. Insane momentum killing play\n\n[Here](https://youtu.be/7QdFpqLCQYM?t=3593) you see VT have a very lazy possession in the half court. L'ville forces a bad shot then VT ball watches on defense and it leaves an open lob at the basket. Collin and Donte all day\n\n[This](https://youtu.be/7QdFpqLCQYM?t=3762) sequence right here is what cant happen. L'ville gets caught worried about the point guard pulling up behind the screen instead the big just slips down low and is fed for an easy basket. L'ville then gets flustered and takes a bad 3 at the start of the shot clock they air ball  \nand tech pushes the ball forward and drills a corner 3. 5 point swing in 30 seconds\n\n[Here](https://youtu.be/XiEUHze4f9s?t=1464)  Vtech is in a half court offense they run their offense through post and the post player makes a nice pass to the cutting guard for an easy layup\n\n[Here](https://youtu.be/XiEUHze4f9s?t=1522) is an UGLY possession by ND but they get it to go. They attack the middle of Vtechs defense and force them all to collapse then ND pulls it back out for an open 3\n\n[Here](https://youtu.be/XiEUHze4f9s?t=1925) you see VT isolate the post in a half court set. They love to post this guy up and let him work down low. He is strong and can get the fouls.\n\n[Here](https://youtu.be/XiEUHze4f9s?t=2973) Vtech is running a halfcourt set ND forces Tech into a tough shot but they fail to box out and tech gets an easy rebound and finish\n\n[Here](https://youtu.be/XiEUHze4f9s?t=3016) Tech is trying to run a half court set but ND stuffs it and forces a reset. Tech runs a screen at the wing. The ND defender shows bad effort on hedging the screen and the vtech guard splits the 2 defenders and has an easy layup.\n\n[**Here**](https://youtu.be/XiEUHze4f9s?t=3096) is **perfect** coaching and adjustment by VT. Tech has been running high screens and rolls the whole time this time they run a high screen and have blacksheer roll to the cup. The roll was there but it was a hard pass to force through so the PG picks up his dribble and resets the play. They run the same exact play but this time instead of rolling to the cup the big pops out to the 3 point line and drills a 3.  Completely catches ND off guard.\n\n[Here](https://youtu.be/XiEUHze4f9s?t=3276) ND is obviously tired of those screens so they come out in a 2-3 zone Vtech moves the ball into the sweet spot at the free throw line and drill a nice jumper.\n\n[Here](https://youtu.be/XiEUHze4f9s?t=3599) ND is still sitting in this soft 2-3 zone tech runs a nice play to attack the free throw line and collapse the zone in the middle they sneak out a shooter to the corner and he drills a 3 wide open.\n",
        "comments": [
            {
                "author": "tonynumber4",
                "score": 10,
                "text": "Did this on my phone so formatting maybe messed up sorry"
            },
            {
                "author": "I2ecover",
                "score": 3,
                "text": "Honestly didn't know Sexton was 34% from 3. That's not that bad."
            },
            {
                "author": "jdm001",
                "score": 3,
                "text": "VT is just like Auburn and Florida. They can shoot the lights out of the gym, but they're really small.\n\nHopefully we can get going on the glass, because we can absolutely dominate them there with Hall, Giddens, Reese, and Smith. Key Jones, Ingram, and Petty could all have big days on the boards as well. If we can push the margin to +10, we should be able to win even if they have a good shooting night. "
            },
            {
                "author": "ModsEmbezzleMoney",
                "score": 3,
                "text": "Nah this is some good shit."
            }
        ]
    },
    {
        "title": "Best of the Best: Simulating a Season with the Greatest Modern Era Teams: Bowl Selection",
        "url": "https://www.reddit.com/r/CFB/comments/1epr815/best_of_the_best_simulating_a_season_with_the/",
        "score": 32,
        "num_comments": 25,
        "text": "# Best of the Best: Simulating a Season with the Greatest Modern Era Teams\n\nIn an effort to figure out how each program's best modern team stacks up against each other, I'll be simming the 2024 season schedule. But, instead of using next year's rosters, I'm using each program's best team since 1996. By the end of this, we'll have determined the best team, QB, RB, WR, offensive line, you name it--of the modern era. And we'll have a full 134-team ranking of where every program's best team stacks up with each other. I sim one time for every matchup, so some shocking one-off results may occur. That's part of the fun, anybody's got a shot to win it all. If you view these posts using the old Reddit layout, you'll be able to see team and conference flairs.\n\nIf you missed the previous weeks/results, the [M](https://1000logos.net/wp-content/uploads/2022/03/Rose-Bowl-Logo-1982-500x321.png)[ain hub thread link is here.](https://www.reddit.com/r/CFB/comments/1dxmkp4/best_of_the_best_simulating_a_season_with_the/)\n\n# Stats\n\n**National Leaders and Team Stats:** https://docs.google.com/spreadsheets/d/1DPqD6krzXaCYa_Hfsj5b71QK1Kihd40P/\n\n# Bowl Selections\n\nBOWL SEASON IS UPON US. Since these are the greatest teams in modern history, these are grudge matches. Sure these teams played a lot of the best teams of their conference, but how do they fare in these inter-conference matchups? Do Steve Sarkisian and 1996 BYU have the chops to take on Jameis Winston and 2013 Florida State? What about 2022 Georgia versus Pat White and 2007 West Virginia? Can the 1998 national champion Tennessee team move the ball against 2013 Michigan State's \"No Fly Zone\"? It's time to see where some teams truly stand against each other, no holds barred. This is your last chance.\n\n# Camellia Bowl: [](#f/connecticut) 2007 UConn (7-5) vs [](#f/texasstate) 2023 Texas State (8-4)\n\nUConn's punched above their weight all season long, and they've got a winnable opponent in Texas State. The UConn pass defense is one of the best in the country, led by Thorpe Award winner and 1st Team All-American S Robert Vaughn, who has 11 interceptions and 4 sacks on the season. QB Tyler Lorenzen's been efficient throwing the ball, with a 31-5 touchdown-interception ratio. Texas State's going to come out firing though. This team is loaded at every position, with QB TJ Finley throwing 27 TD 6 INT, RB Ismail Mahdi rushing for 1538 yards, WR Joey Hobert with 1108 yards, DB Brian Holloway snagging 7 interceptions, and K Mason Shipley hitting 24 of 25 field goals.\n\n# Frisco Bowl: [](#f/rice) 2008 Rice (7-5) vs [](#f/liberty) 2023 Liberty (7-5)\n\nFor Rice, they had the season they expected. Some players were standouts, like 2nd Team All-American TE James Casey, who had 751 yards and 8 TD. For Liberty, they really expected more, hoping for a Playoff appearance, instead ending up with a 5th placed finish in Conference USA. Kaidon Salter struggled, throwing just 9 touchdowns with 6 interceptions, and kicker Nick Brown was just 13/31 on field goals.\n\n# Boca Raton Bowl: [](#f/colorado) 1996 Colorado (6-6) vs [](#f/southalabama) 2022 South Alabama (9-4)\n\nThis'll be a fun one. Colorado is loaded with talent, including QB Koy Detmer and WR Rae Carruth. Safety Steve Rosga was a 1st Team All-American with 8 interceptions and 8 sacks, and LB Matt Russell and S Ryan Sutter were both 3rd Team All-Americans. South Alabama started the year 8-1 and ranked in the Top 25, so we know they've got juice. Powering them is RB La'Damian Webb, who had nearly 2000 yards from scrimmage to go with 17 touchdowns. It'll be fun to see the WR trio of Jalen Wayne (931 yards), Caullin Lacy (735), and Devin Voisin (618) go against Colorado's All-American secondary.\n\n# Los Angeles Bowl: **\\#23** [](#f/sanjosestate) 2020 San Jose State (10-3) vs [](#f/oregon) 2014 Oregon (6-6)\n\nWhat happens when an overachieving Group of 5 team meets an underperforming Power 4 team? San Jose State's had a fantastic year, their high-flying offense averaging over 35 PPG. QB Nick Starkel is 5th in the country in both passing yards (4775) and pasing TDs (40). WR Bailey Gaither was a 2nd Team All-American this season, and WR Tre Walker added another 1100+ yards and 8 TD. On the defensive end, 1st Team All-American DE Cade Hall comes screaming off the edge (12 sacks on the year), and kicker Matt Mercurio is 25/28 on the year. Oregon's national title-appearance team has underachieved, but we know how good they are. Mariota's thrown for over 3000 yards with 19 TD 3 INT, and added another 8 TD on the ground. Royce Freeman ran for nearly 1500 yards. Their speed is literally olympic caliber with WR Devon Allen catching passes. This should be a shootout.\n\n# New Orleans Bowl: [](#f/troy) 2022 Troy (8-4) vs [](#f/utep) 2004 UTEP (8-5)\n\nWe've really not heard much from Troy this season. They're a possession-based team who like to get the ball in the hands of their playmakers RaJae' Johnson (862 yards) and Tez Johnson (697 yards, transferred to Oregon for 2023). UTEP comes in with a stacked resume, having beaten 1997 national champion Nebraska in week 1. QB Jordan Palmer's a gunslinger, but he spreads the ball around well, with 5 players having 500+ receiving yards. RB Howard Jackson is one of the best in the country, with 1565 rushing yards and 553 receiving yards.\n\n# Cure Bowl: **\\#17** [](#f/wku) 2015 Western Kentucky (11-2) vs **\\#20** [](#f/miamioh) 2003 Miami (OH) (10-3)\n\n2 of the best Group of 5 teams face off in a Top 25 matchup you won't want to miss. #17 Western Kentucky's won 8 straight, and #20 Miami (OH)'s won 10 straight. Something's gotta give. WKU comes in with one of the most electric offenses in the country, averaging 37 PPG. QB Brandon Doughty was 1st Team All-CUSA, throwing for 4639 yards with 37 TD 7 INT. His receiving corps is LOADED. Taywan Taylor was 1st Team All-CUSA, Jared Dangerfield and Nicholas Norris are 2nd Team All-CUSA, and TE Tyler Higbee was a 3rd Team All-American and Mackey Award finalist. Miami (OH)'s right there with them, the difference is their defense is also pretty good. QB Ben Roethlisberger was 1st Team All-MAC, and WR Martin Nance was a 3rd Team All-American with 1279 receiving yards.\n\n# Gasparilla Bowl: [](#f/oklahoma) 2000 Oklahoma (7-5) vs [](#f/virginia) 1998 Virginia (6-6)\n\nGood luck Virginia. Former national champion 2000 Oklahoma finds themselves in the Gasparilla Bowl after a gauntlet schedule. Even in a down year, they had a few standouts. DB JT Thatcher and LB Brandon Babb were 2nd Team All-Americans, while LB Brandon Babb was a 3rd Team AA. They'll try to slow a Virginia backfield that features NFLers Aaron Brooks and Thomas Jones. Jones has 1623 rushing yards and 13 TD on the year. Should be a good one, even if Oklahoma is a heavy favorite.\n\n# Myrtle Beach Bowl: [](#f/jamesmadison) 2023 James Madison (8-4) vs [](#f/uab) 2018 UAB (6-6)\n\nLast year's James Madison team put together a solid season. QB Jordan McCloud has 2 great targets to throw to, in Reggie Brown (42 catches, 926 yards, deep threat) and Elijah Sarratt (64 catches, 9 TD, go-to guy). DE Jalen Green was an All-American just like real life with 11 sacks. UAB barely snuck into a bowl over some other teams like Indiana and NC State. This is a team that in real life started 9-1 in just their 2nd season back from discontinuing football.\n\n# Famous Idaho Potato Bowl: [](#f/wyoming) 1996 Wyoming (7-5) vs [](#f/toledo) 2000 Toledo (7-5)\n\nFun clash of styles. Wyoming is heavy pass, led by 1st Team All-American WR Marcus Harris (114 catches, 1682 yards, 10 TD), while Toledo is heavy run, led by RB Chester Taylor (1931 yards, 14 TD, 6.0 YPC). The difference-maker could be Toledo's struggle throwing the ball. QB Tavares Bolden has completed less than 50% of his passes this season, and Wyoming S Brian Lee has 8 interceptions.\n\n# Hawaii Bowl: [](#f/hawaii) 2007 Hawaii (9-3) vs [](#f/louisianatech) 2012 Louisiana Tech (9-3)\n\nYou like offense? Bet the over. Both are 2 of the greatest Group of 5 offenses of all time, and they've played like it in this sim. Colt Brennan's thrown 39 TD 13 INT and WRs Ryan Grice-Mullins and Davone Bess have both gone for over 1000 yards. Louisiana Tech features one of the best rushing attacks in the country, with the 1-2 punch of Kenneth Dixon (1158 yards, 8 TD, 6.4 YPC) and the 5'7 160 lb Tevin King (1021 yards, 15 TD, 8.5 YPC).\n\n# Detroit Bowl: [](#f/buffalo) 2020 Buffalo (10-2) vs [](#f/purdue) 1998 Purdue (6-6)\n\nImagine where Buffalo would be if they had a kicker. Seriously, Alex McNulty is just 6/24 on the year. He's 5/12 from under 30 yards. The offense knows the gameplan. RB Jaret Patterson did the carry job of all carry jobs, rushing for 2407 yards and 23 TD on 6.7 YPC. Buffalo's offensive line won the Joe Moore Award for the best offensive line in the country, ranking 1st in yards per carry and sack rate. Can Purdue stop Patterson behind that line? Probably not. It'll fall on the shoulders of Drew Brees to keep up, who's having a down year (14 TD 17 INT) in the sim.\n\n# Guaranteed Rate Bowl: [](#f/maryland) 2002 Maryland (6-6) vs [](#f/kansas) 2007 Kansas (7-5)\n\nShould be a good one. Maryland can beat anyone on any given Saturday, they have a win over #2 USC. Kansas went 12-1 in 2007, and QB Todd Reesing picked up where he left off (27 TD 8 INT).\n\n# 68 Ventures Bowl: [](#f/centralmichigan) 2009 Central Michigan (10-3) vs [](#f/coastalcarolina) 2020 Coastal Carolina (8-4)\n\nCan't wait to see the different offensive plays in this one. WR Antonio Brown was 1st Team All-American at the all-purpose position, and the Hornung Award winner. He's got 700 rush yards and 800 receiving yards on the year. As long as he's able to run the ball, CMU should win. But this is a Coastal Carolina team that went 11-1 in real life.\n\n# Birmingham Bowl: [](#f/kentucky) 2018 Kentucky (6-6) vs [](#f/duke) 2013 Duke (6-6)\n\nBenny Snell's ran for over 1500 yards for Kentucky. Duke has a win over 2013 Florida State.\n\n# Armed Forces Bowl: [](#f/memphis) 2019 Memphis (9-4) vs [](#f/tcu) 2010 TCU (6-6)\n\nHow does the Conference USA champion compare against one of the greatest Group of 5 teams of all time? Both teams are loaded. Memphis QB Brady White has 30 TD 12 INT. NFL RB Kenneth Gainwell has  run for 1500 yards and 13 TD, and NFL RB Antonio Gibson is also in the backfield. Damonte Coxie is just shy of 1000 receiving yards, and NFL WR Calvin Austin III's been a deep threat with 19.1 yards per reception on 31 catches. QB Andy Dalton will be good for TCU, and the defense is top 10 in the nation in sacks.\n\n# Liberty Bowl: [](#f/olemiss) 2023 Ole Miss (6-6) vs [](#f/baylor) 2013 Baylor (7-5)\n\nThis feels like a weird matchup. Last year's Ole Miss team against that high-flying 2013 Baylor offense? Quinshon Judkins' had a very productive year with 1574 rushing yards, and Jaxson Dart has played overall very solid--68% completions, 3015 yards, 9.7 YPA, 17 TD 7 INT. The defense will have their hands full with the Baylor offense. Bryce Petty has 4000 yards 29 TD 4 INT. Lache Seastrunk and Shock Linwood have combined for nearly 2000 rushing yards and 25 TD.\n\n# Las Vegas Bowl: [](#f/oregonstate) 2000 Oregon State (8-4) vs [](#f/arkansas) 2011 Arkansas (6-6)\n\nThis one's fascinating. 2000 Oregon State beat Notre Dame 41-9 in the Fiesta Bowl that year, but this is a better team in 2011 Arkansas. Can Oregon State handle the SEC speed and strength of Arkansas? QB Jonathan Smith has Chad Johnson and TJ houshmandzadeh to throw to, and Ken Simonton has 1768 rushing yards on the year. Arkansas has been fine on the year, going 4-4 in the SEC, but could explode in any given game.\n\n# Fenway Bowl: [](#f/syracuse) 1996 Syracuse (7-5) vs [](#f/utsa) 2021 UTSA (7-5)\n\nDonovan McNabb against 2021 UTSA. Who wins? McNabb hasn't had a special season by any means, just 10 TD 9 INT with 350 rushing yards. UTSA's led by the always-dangerous backfield of QB Frank Harris (18 TD 3 INT) and RB Sincere McCormick (1624 yards, 11 TD). LB Clarence Hicks was a 1st Team All-American with 16 sacks.\n\n# Pinstripe Bowl: **\\#22** [](#f/pittsburgh) 2021 Pittsburgh (8-4) vs [](#f/michigan) 2023 Michigan (6-6)\n\nHere we go. Kenny Pickett and Jordan Addison against the 2023 national champion Michigan team. Could Michigan *actually* lose this?? We know how good that Wolverine defense was, but in this sim they've given up 25.1 PPG. Does that change against the dynamic duo of these two? Blake Corum and Donovan Edwards have struggled to run the ball, averaging a combined 3.6 yards per carry. They need to establish the run game against Calijah Kancey and remember that they are MICHIGAN. NATIONAL CHAMPIONS. Or they'll finish the year with a losing record.\n\n# New Mexico Bowl: **\\#24** [](#f/fresnostate) 2018 Fresno State (9-3) vs [](#f/louisiana) 2020 Louisiana (9-3)\n\nIf there was a Group of 5 Heisman, Marcus McMaryion would be in contention for it. Fresno's QB has thrown for 3610 yards with 32 TD 4 INT, and gives the Bulldogs a chance to finish a season with the best teams in modern history in the Top 25. Louisiana's scored a lot of points. QB Levi Lewis has 26 TD, RB Elijah Mitchell has 13, and RB Trey Ragas has another 11. This could be a shootout.\n\n# Pop-Tarts Bowl: **\\#18** [](#f/floridastate) 2013 Florida State (9-4) vs **\\#19** [](#f/byu) 1996 BYU (9-3)\n\nDoes 1996 BYU have the JUICE to beat a national title-winning 2013 Florida State team? FSU has underperformed this year, but at times they've looked like one of the best teams in the country, beating 2 Playoff teams in Clemson and Florida. They've scored a ton of points, but Jameis needs to watch his turnovers (16 interceptions). BYU shocked everyone this season by almost making the Playoff. QB Steve Sarkisian has 3138 pass yards with 23 TD 8 INT, and the defense is top 15 in the country. Winner gets Pop-Tarts.\n\n# Arizona Bowl: [](#f/coloradostate) 1997 Colorado State (6-6) vs [](#f/northernillinois) 2012 Northern Illinois (6-6)\n\nColorado State maybe has the best RB tandem in the country. Damon Washington has 1414 yards and 10 TD on 5.9 YPC, and Kevin McDougal has 1251 yards and 13 TD on 7.0 YPC. If you remember way back when, McDougal had 17 carries for 277 yards and 5 TD against #5 Texas in week 1, just an unreal performance. If he can bring that same heat, NIU doesn't have a chance. The Huskies have been rolling behind the legs of QB Jordan Lynch. The former Heisman finalist has just 612 passing yards, but 1130 rushing. \n\n# Military Bowl: [](#f/wakeforest) 2006 Wake Forest (6-6) vs [](#f/tulane) 2022 Tulane (7-5)\n\nWake once beat Clemson. They bring a balanced attack of run-pass-run. Tulane nearly won the American, and it'll be interesting to see how a team that beat USC in real life fares against the real-life ACC Champion Wake Forest.\n\n# Alamo Bowl: **\\#16** [](#f/california) 2004 California (9-3) vs [](#f/ucf) 2017 UCF (8-4)\n\nHow does the Doak Walker Award winner, RB JJ Arrington, fare against the 2017 national champion UCF defense? Arrington's had an unreal season, rushing for 2292 yards and 18 TD on 6.3 YPC. He's 336 yards short of Barry Sanders' single-season record of 2628 yards, which seems unattainable, but Arrington's had similar performances this year. Oh, and Aaron Rodgers is also on this team. UCF was a Playoff contender for most of the year but trailed off at the end. McKenzie Milton hasn't had his best season but still helped UCF finish top 4 in the Big 12. The RB trio of Adrian Killins, Otis Anderson (RIP), and Greg McCrae all average 5.7 yards or more per carry, so this could be a battle of who runs the ball better.\n\n# Independence Bowl: [](#f/stanford) 2010 Stanford (7-5) vs [](#f/tulsa) 2008 Tulsa (8-4)\n\nTwo of the smallest schools in terms of enrollment battle it out for Independence. Andrew Luck's had a fine year, throwing for 20 TD 8 INT. Tulsa is one of the best offenses in the country on their day, but that'll be a tough ask against the Stanford defense.\n\n# Music City Bowl: [](#f/texasam) 2012 Texas A&M (7-5) vs [](#f/illinois) 2001 Illinois (7-5)\n\nIs Texas A&M the favorite? This is a pretty good Illinois team. Johnny Manziel's thrown for 12 TD 5 INT, and he, Ben Malena, and Christine Michael have combined for 2557 rushing yards and 26 TD. Mike Evans and Ryan Swope have been two of the better receivers in the SEC this season. Illinois will look to feed 4th Team All-American WR Brandon Lloyd, and defensively they've got the pieces to slow Manziel. DBs Eugene Wilson, Eric McGoey, and Bobby Jackson were All-Americans, combining for 13 interceptions and 18 sacks.\n\n# Reliaquest Bowl: [](#f/auburn) 2010 Auburn (7-5) vs [](#f/wisconsin) 2017 Wisconsin (8-4)\n\nCam Newton versus that 2017 Wisconsin team that started the year 12-0, who wins? Cam's been good in this sim, if not steady, just they need to give him the ball more. He's got just 1615 passing yards but is averaging 10.9 YPA, and has 908 rushing yards with 5 TD. RBs Michael Dyer nad Onterio McCalebb have combined for over 2000 yards and 24 TD. It'll be a game of rushing, as Wisconsin QB Alex Hornibrook has just 10 TD 20 INT on the season. Jonathan Taylor has 1908 rush yards and 18 TD to make up for it.\n\n# Sun Bowl: [](#f/northcarolina) 1997 North Carolina (7-5) vs [](#f/ucla) 1998 UCLA (6-6)\n\nDespite a so-so offense, North Carolina has a top 10 defense, giving up just 20.4 PPG. CB Dre Bly was an All-American with 6 interceptions. UCLA beat #4 LSU this season, without that they wouldn't even be in a bowl. They've gone cold as of late, but QB Cade McNown is still one of the most electric in the country on his day, averaging 10.5 YPA.\n\n# Citrus Bowl: **\\#14** [](#f/tennessee) 1998 Tennessee (9-3) vs [](#f/michiganstate) 2013 Michigan State (8-4)\n\nTennessee will look to make the committee pay for leaving them out of the Playoff. QB Tee Martin's taken care of the ball, and RBs Travis Henry and Jamal Lewis form one of the best 1-2 punches in the SEC. They've got a tough team across the aisle in 2013 Michigan State though. Sparty contended for the Big Ten title, and the \"No Fly Zone\" has held up in this sim. Both defenses are top 5 in the country, Tennessee giving up 17.3 PPG and Michigan State 18.5.\n\n# Texas Bowl: **\\#25** [](#f/westvirginia) 2007 West Virginia (8-4) vs [](#f/georgia) 2022 Georgia (7-5)\n\nPat White Steve Slaton, and Noel Devine against the 2022 Georgia defense, who wins? WVU's ran for 32 touchdowns in 12 games this year, while Georgia's defense is loaded with NFL talent.\n\n# Gator Bowl: **\\#13** [](#f/louisville) 2006 Louisville (9-3) vs [](#f/texas) 2005 Texas (7-5)\n\nDoes anyone realistically think 2006 Louisville would beat 2005 Texas in real life? This was a very good Louisville team. Brian Brohm has thrown for over 4000 yards with 25 TD 4 INT. Harry Douglas and Mario Urrutia have both gone for over 950+ yards. Texas falls victim to simply not giving the ball to Vince Young enough. He has a 184.3 passer rating this season, good for top 20 in NCAA history! He's completed 71% of passes for 2403 yards 19 TD 8 INT, but his rushing hasn't held up, running for just 501 yards on 196 carries. We'll see if he's got a 2006 Rose Bowl-esque performance left in him.\n\n# First Responder Bowl: [](#f/iowastate) 2020 Iowa State (6-6) vs [](#f/fau) 2017 FAU (8-5)\n\nThis game sneakily has some of the best players in the country. Iowa State 4th Team All-American RB Breece Hall has run for 1987 yards and 24 TD. Nagurski Award winner and 1st Team All-American DE Will McDonald IV has 18 sacks. 2nd Team All-American LB Mike Rose has 7 interceptions. For FAU, 3rd Team All-American RB Devin Singletary has 2399 yards and 22 TD on the year, he is a legit threat to break Barry Sanders' single-season record of 2629 yards.\n\n# Duke's Mayo Bowl: **\\#15** [](#f/miami) 2001 Miami (FL) (9-3) vs [](#f/rutgers) 2006 Rutgers (7-5)\n\nOh this is good. This is real good right here. Clinton Portis vs Ray Rice. 2 of the best RBs in the country. Portis is a 1st Team All-American, rushing for 1993 yards and 23 TD on 6.6 YPC, while Ray Rice is a 2nd Team All-American, rushing for 2387 yards and 18 TD on 5.8 YPC. Rutgers' offensive line was 2nd Team All-American as well, ranking 7th nationally in yards per carry and 4th in sack rate. There's no way 2001 Miami loses to Rutgers, right? Ray Rice is the great red hope.\n\n# Bahamas Bowl: [](#f/bowlinggreen) 2003 Bowling Green (6-6) vs [](#f/middletennessee) 2001 Middle Tennessee (7-5)\n\nBowling Green is RB by committee (950, 618, and 603 yard rushers), while MTSU packs a 1-2 combo, with Dwone Hicks going for 1731 yards and ReShard Lee for 874. The two combined for 25 touchdowns.\n\n# Holiday Bowl: **\\#21** [](#f/arizona) 1998 Arizona (9-3) vs [](#f/notredame) 2018 Notre Dame (7-5)\n\nIan Book, watch out! Arizona CB Chris McAlister was 1st Team All-American, leading the country with 11 interceptions, while Book has thrown just 9 touchdowns with 12 interceptions on the season. It'll likely be a RB duel between Trung Canidate and Dexter Williams, both rushing for 1500+ yards on the year.",
        "comments": [
            {
                "author": "Citruspilled",
                "score": 22,
                "text": "Can't wait for a simulated Cal vs UCF game to completely dictate my mood tomorrow"
            },
            {
                "author": "Wheels_Foonman",
                "score": 15,
                "text": "Can’t spell simulation without UT\n\n-Steve Spurrier, probably"
            },
            {
                "author": "Crotean",
                "score": 8,
                "text": "Am I the only who immediately control F'd for the pop tart bowl? Best bowl ever already."
            },
            {
                "author": "wjackson42",
                "score": 10,
                "text": "REVENGE AGAINST WEST VIRGINIA TIME"
            },
            {
                "author": "DommyMommyKarlach",
                "score": 4,
                "text": "The Sim will once again decide that VY can’t run lol"
            }
        ]
    },
    {
        "title": "ChargerFan2121's \"POINTS\" Poll Week 9 and Full Rankings",
        "url": "https://www.reddit.com/r/CFBAnalysis/comments/yhi36s/chargerfan2121s_points_poll_week_9_and_full/",
        "score": 0,
        "num_comments": 0,
        "text": "Really pleased with how my computer poll it starting to shape as the year is nearing the end! Excited to dive into spreads next year, but a quick guess would be for every 10-15 points a team is ahead in the Weekly Average column, that's a point in their favor in regards to the spread. Also, hoping for my \"unusualness score\" to continue dropping in the r/CFB poll after posting a season best last week at 15.87.\n\nInformation about my poll logic:\n\n* Every team started the season at 0 points\n* Each week, I rank teams by the number of points they scored compared to the rest of the FBS playing field that week\n* Teams then get awarded various penalties and bonuses based off the level of competition they played, their MOV, and then how their \"total\" score for the week compared to how they have played on the season\n* Teams are then ranked based off their weekly average\n\n|Ranking|Team|Current Season Total|Weekly Average|Change In Weekly Average|Change In Rank|\n--:|:--|--:|--:|--:|--:|\n|1|[Ohio State](#f/ohiostate) Ohio State Buckeyes|2756.03|344.50|-10.22|+0|\n|2|[Tennessee](#f/tennessee) Tennessee Volunteers|2516.22|314.53|+4.21|+1|\n|3|[Georgia](#f/georgia) Georgia Bulldogs|2483.77|310.47|-2.05|-1|\n|4|[Michigan](#f/michigan) Michigan Wolverines|2396.23|299.53|-7.29|+0|\n|5|[TCU](#f/tcu) TCU Horned Frogs|2283.88|285.49|-3.89|+0|\n|6|[Alabama](#f/alabama) Alabama Crimson Tide|2264.66|283.08|+0.00|+0|\n|7|[Oregon](#f/oregon) Oregon Ducks|2239.75|279.97|+1.22|+0|\n|8|[Clemson](#f/clemson) Clemson Tigers|2103.98|263.00|+0.00|+0|\n|9|[USC](#f/usc) USC Trojans|2001.30|250.16|4.22|+2|\n|10|[UCLA](#f/ucla) UCLA Bruins|1981.21|247.65|6.56|+2|\n|11|[Ole Miss](#f/olemiss) Ole Miss Rebels|2130.52|236.72|-2.04|+2|\n|12|[Utah](#f/utah) Utah Utes|1829.17|228.65|-7.61|+3|\n|13|[North Carolina](#f/northcarolina) North Carolina Tar Heels|1785.04|223.13|+10.31|+7|\n|14|[Washington](#f/washington) Washington Huskies|1755.21|219.40|+0.00|+4|\n|15|[LSU](#f/lsu) LSU Tigers|1724.28|215.53|+0.00|+4|\n|16|[Wake Forest](#f/wakeforest) Wake Forest Demon Deacons|1684.59|210.57|-45.07|-7|\n|17|[Liberty](#f/liberty) Liberty Flames|1629.18|203.65|+0.00|+4|\n|18|[Tulane](#f/tulane) Tulane Green Wave|1627.93|203.49|+0.00|+4|\n|19|[Texas](#f/texas) Texas Longhorns|1597.58|199.70|+0.00|+4|\n|20|[Cincinnati](#f/cincinnati) Cincinnati Bearcats|1589.36|198.67|-39.09|-6|\n|21|[Kansas State](#f/kansasstate) Kansas State Wildcats|1579.56|197.45|+31.38|+14|\n|22|[Illinois](#f/illinois) Illinois Fighting Illini|1574.58|196.82|+5.45|+4|\n|23|[Oklahoma State](#f/oklahomastate) Oklahoma State Cowboys|1574.01|196.75|-57.01|-13|\n|24|[Penn State](#f/pennstate) Penn State Nittany Lions|1573.81|196.73|-27.10|-8|\n|25|[Maryland](#f/maryland) Maryland Terrapins|1551.95|193.99|+0.00|+0|\n|26|[UCF](#f/ucf) UCF Knights|1550.72|193.84|-4.35|-2|\n|27|[Baylor](#f/baylor) Baylor Bears|1521.42|190.18|+21.62|+5|\n|28|[Syracuse](#f/syracuse) Syracuse Orange|1490.95|186.37|-35.90|-11|\n|29|[UTSA](#f/utsa) UT San Antonio Roadrunners|1479.27|184.91|+0.00|-1|\n|30|[Louisville](#f/louisville) Louisville Cardinals|1449.49|181.19|+26.03|+11|\n|31|[Oregon State](#f/oregonstate) Oregon State Beavers|1448.47|181.06|0.00|-2|\n|32|[Appalachian State](#f/appalachianstate) Appalachian State Mountaineers|1389.81|173.73|12.82|6|\n|33|[James Madison](#f/jamesmadison) James Madison Dukes|1215.08|173.58|0.00|-3|\n|34|[Duke](#f/duke) Duke Blue Devils|1369.62|171.20|0.00|-3|\n|35|[ECU](#f/ecu) East Carolina Pirates|1522.57|169.17|14.95|7|\n|36|[Kansas](#f/kansas) Kansas Jayhawks|1333.09|166.64|0.00|-2|\n|37|[Coastal Carolina](#f/coastalcarolina) Coastal Carolina Chanticleers|1329.46|166.18|0.84|-1|\n|38|[Boise State](#f/boisestate) Boise State Broncos|1328.48|166.06|24.66|14|\n|39|[Minnesota](#f/minnesota) Minnesota Golden Gophers|1322.36|165.29|19.04|10|\n|40|[Purdue](#f/purdue) Purdue Boilermakers|1313.29|164.16|0.00|-3|\n|41|[Notre Dame](#f/notredame) Notre Dame Fighting Irish|1312.71|164.09|21.42|10|\n|42|[Oklahoma](#f/oklahoma) Oklahoma Sooners|1291.74|161.47|11.42|4|\n|43|[South Alabama](#f/southalabama) South Alabama Jaguars|1274.99|159.37|12.14|4|\n|44|[Mississippi State](#f/mississippistate) Mississippi State Bulldogs|1272.06|159.01|0.00|-4|\n|45|[NC State](#f/ncstate) NC State Wolfpack|1255.21|156.90|4.13|-1|\n|46|[Florida State](#f/floridastate) Florida State Seminoles|1247.71|155.96|23.07|15|\n|47|[Toledo](#f/toledo) Toledo Rockets|1400.31|155.59|2.39|-4|\n|48|[Arkansas](#f/arkansas) Arkansas Razorbacks|1227.52|153.44|19.78|12|\n|49|[Georgia Southern](#f/georgiasouthern) Georgia Southern Eagles|1219.72|152.47|0.00|-4|\n|50|[Houston](#f/houston) Houston Cougars|1216.04|152.01|14.73|7|\n|51|[South Carolina](#f/southcarolina) South Carolina Gamecocks|1184.40|148.05|-37.22|-24|\n|52|[Buffalo](#f/buffalo) Buffalo Bulls|1172.80|146.60|0.00|-4|\n|53|[Wisconsin](#f/wisconsin) Wisconsin Badgers|1118.43|139.80|0.00|1|\n|54|[Air Force](#f/airforce) Air Force Falcons|1106.28|138.29|0.00|2|\n|55|[Texas Tech](#f/texastech) Texas Tech Red Raiders|1103.17|137.90|-29.94|-22|\n|56|[Troy](#f/troy) Troy Trojans|1092.47|136.56|0.00|2|\n|57|[Ohio](#f/ohio) Ohio Bobcats|1033.12|129.14|0.00|5|\n|58|[North Texas](#f/northtexas) North Texas Mean Green|1142.79|126.98|20.77|10|\n|59|[Memphis](#f/memphis) Memphis Tigers|1002.84|125.36|0.00|5|\n|60|[WKU](#f/wku) Western Kentucky Hilltoppers|1116.93|124.10|-35.63|-21|\n|61|[SMU](#f/smu) SMU Mustangs|989.33|123.67|20.57|10|\n|62|[Southern Miss](#f/southernmiss) Southern Mississippi Golden Eagles|983.01|122.88|17.98|7|\n|63|[West Virginia](#f/westvirginia) West Virginia Mountaineers|960.10|120.01|-13.72|-4|\n|64|[Wyoming](#f/wyoming) Wyoming Cowboys|1077.17|119.69|8.73|3|\n|65|[Pittsburgh](#f/pittsburgh) Pittsburgh Panthers|948.68|118.59|-19.88|-10|\n|66|[Florida](#f/florida) Florida Gators|929.61|116.20|-23.65|-13|\n|67|[Kentucky](#f/kentucky) Kentucky Wildcats|895.01|111.88|-33.33|-17|\n|68|[San José State](#f/sanjosestate) San José State Spartans|862.03|107.75|16.77|12|\n|69|[Washington State](#f/washingtonstate) Washington State Cougars|794.60|99.33|-18.53|-4|\n|70|[Army](#f/army) Army Black Knights|690.00|98.57|0.00|5|\n|71|[UAB](#f/uab) UAB Blazers|784.53|98.07|-30.45|-8|\n|72|[Miami](#f/miami) Miami Hurricanes|777.12|97.14|10.83|11|\n|73|[Arizona](#f/arizona) Arizona Wildcats|773.84|96.73|-7.33|-3|\n|74|[Missouri](#f/missouri) Missouri Tigers|760.05|95.01|20.84|19|\n|75|[Middle Tennessee](#f/middletennessee) Middle Tennessee Blue Raiders|754.79|94.35|12.43|11|\n|76|[Fresno State](#f/fresnostate) Fresno State Bulldogs|713.19|89.15|17.60|18|\n|77|[Eastern Michigan](#f/easternmichigan) Eastern Michigan Eagles|782.94|86.99|-15.99|-5|\n|78|[Georgia State](#f/georgiastate) Georgia State Panthers|684.43|85.55|20.53|19|\n|79|[Kent State](#f/kentstate) Kent State Golden Flashes|660.99|82.62|0.00|6|\n|80|[Rice](#f/rice) Rice Owls|656.05|82.01|-30.21|-14|\n|81|[Ball State](#f/ballstate) Ball State Cardinals|641.78|80.22|0.00|8|\n|82|[Louisiana](#f/louisiana) Louisiana Ragin' Cajuns|640.04|80.00|-19.28|-8|\n|83|[Arizona State](#f/arizonastate) Arizona State Sun Devils|639.84|79.98|30.78|21|\n|84|[Bowling Green](#f/bowlinggreen) Bowling Green Falcons|635.28|79.41|0.00|6|\n|85|[Nebraska](#f/nebraska) Nebraska Cornhuskers|630.27|78.78|-21.97|-12|\n|86|[Tulsa](#f/tulsa) Tulsa Golden Hurricane|628.07|78.51|-11.66|-5|\n|87|[Iowa](#f/iowa) Iowa Hawkeyes|615.36|76.92|31.19|19|\n|88|[UNLV](#f/unlv) UNLV Rebels|610.02|76.25|0.00|4|\n|89|[BYU](#f/byu) BYU Cougars|661.67|73.52|-17.86|-10|\n|90|[FAU](#f/fau) Florida Atlantic Owls|651.34|72.37|15.12|10|\n|91|[Michigan State](#f/michiganstate) Michigan State Spartans|571.05|71.38|-22.53|-13|\n|92|[Marshall](#f/marshall) Marshall Thundering Herd|567.84|70.98|-23.94|-15|\n|93|[Stanford](#f/stanford) Stanford Cardinal|562.63|70.33|-19.55|-11|\n|94|[Rutgers](#f/rutgers) Rutgers Scarlet Knights|556.23|69.53|-26.31|-18|\n|95|[San Diego State](#f/sandiegostate) San Diego State Aztecs|547.68|68.46|-12.22|-7|\n|96|[Iowa State](#f/iowastate) Iowa State Cyclones|520.25|65.03|-16.60|-9|\n|97|[UTEP](#f/utep) UTEP Miners|583.03|64.78|-19.69|-13|\n|98|[Texas A&amp;M](#f/texasam) Texas A&amp;M Aggies|513.40|64.17|-5.11|-3|\n|99|[Miami (OH)](#f/miamioh) Miami (OH) RedHawks|521.43|57.94|20.21|11|\n|100|[Old Dominion](#f/olddominion) Old Dominion Monarchs|460.79|57.60|-19.75|-9|\n|101|[Connecticut](#f/connecticut) Connecticut Huskies|509.24|56.58|25.28|13|\n|102|[California](#f/california) California Golden Bears|448.13|56.02|-9.13|-6|\n|103|[Northern Illinois](#f/northernillinois) Northern Illinois Huskies|441.62|55.20|0.00|-2|\n|104|[Auburn](#f/auburn) Auburn Tigers|420.77|52.60|-5.58|-5|\n|105|[Navy](#f/navy) Navy Midshipmen|415.72|51.97|20.75|10|\n|106|[Texas State](#f/texasstate) Texas State Bobcats|408.06|51.01|0.00|-4|\n|107|[Louisiana Tech](#f/louisianatech) Louisiana Tech Bulldogs|404.65|50.58|-11.79|-9|\n|108|[Indiana](#f/indiana) Indiana Hoosiers|370.02|46.25|0.00|-3|\n|109|[Vanderbilt](#f/vanderbilt) Vanderbilt Commodores|352.79|44.10|0.00|-1|\n|110|[FIU](#f/fiu) Florida International Golden Panthers|350.59|43.82|33.32|11|\n|111|[Western Michigan](#f/westernmichigan) Western Michigan Broncos|329.54|41.19|0.00|-2|\n|112|[New Mexico State](#f/newmexicostate) New Mexico State Aggies|345.68|38.41|18.26|5|\n|113|[Georgia Tech](#f/georgiatech) Georgia Tech Yellow Jackets|292.48|36.56|-13.02|-10|\n|114|[Virginia](#f/virginia) Virginia Cavaliers|272.93|34.12|-10.53|-7|\n|115|[Central Michigan](#f/centralmichigan) Central Michigan Chippewas|268.05|33.51|0.00|-3|\n|116|[Charlotte](#f/charlotte) Charlotte 49ers|254.12|28.24|42.80|8|\n|117|[Virginia Tech](#f/virginiatech) Virginia Tech Hokies|205.39|25.67|-4.10|-1|\n|118|[ULM](#f/ulm) Louisiana Monroe Warhawks|135.06|16.88|0.00|0|\n|119|[Arkansas State](#f/arkansasstate) Arkansas State Red Wolves|142.51|15.83|-19.55|-8|\n|120|[Utah State](#f/utahstate) Utah State Aggies|94.27|11.78|0.00|-1|\n|121|[Boston College](#f/bostoncollege) Boston College Eagles|91.67|11.46|-21.43|-8|\n|122|[USF](#f/usf) South Florida Bulls|56.52|7.06|-4.70|-2|\n|123|[Temple](#f/temple) Temple Owls|-74.60|-9.33|-6.14|-1|\n|124|[Colorado](#f/colorado) Colorado Buffaloes|-111.34|-13.92|9.86|3|\n|125|[Hawai'i](#f/hawaii) Hawai'i Rainbow Warriors|-156.18|-17.35|-4.34|-2|\n|126|[New Mexico](#f/newmexico) New Mexico Lobos|-171.81|-21.48|0.00|0|\n|127|[Nevada](#f/nevada) Nevada Wolf Pack|-205.66|-22.85|2.27|1|\n|128|[Northwestern](#f/northwestern) Northwestern Wildcats|-229.37|-28.67|-3.31|1|\n|129|[Colorado State](#f/coloradostate) Colorado State Rams|-269.98|-33.75|-14.56|-4|\n|130|[Akron](#f/akron) Akron Zips|-308.28|-34.25|-8.56|0|\n|131|[UMass](#f/umass) UMass Minutemen|-499.59|-62.45|-1.03|0|",
        "comments": []
    },
    {
        "title": "2k Subs from r/writing and r/teenagers users",
        "url": "https://www.reddit.com/r/copypastapublishin/comments/cy6xnc/2k_subs_from_rwriting_and_rteenagers_users/",
        "score": 25,
        "num_comments": 1,
        "text": "1. r/CaesarNaples2\n2. r/copypastapublishin\n3. r/u_ButterflyLaunch\n4. r/Chatbots\n5. r/SoftwareEngineering\n6. r/Bauhaus\n7. r/craziness\n8. r/MaterialDesign\n9. r/astrapocalypse\n10. r/tumblr\n11. r/spoilersoftheuniverse\n12. r/dontridetwice\n13. r/Noearthsociety\n14. r/OldSchoolCool\n15. r/discordian\n16. r/publishcopypasta\n17. r/sorcerytheofspectacle\n18. r/copypasta\n19. r/ZHCSubmissions\n20. r/The_Dennis\n21. r/weirdwritingweekend\n22. r/radioheadfanfic\n23. r/oklahoma\n24. r/writers\n25. r/00AG9603\n26. r/SocialMediaMarketing\n27. r/Art\n28. r/writingcirclejerk\n29. r/writing\n30. r/HFY\n31. r/discordia\n32. r/SubChats\n33. r/gameideas\n34. r/offmychest\n35. r/raisedbynarcissists\n36. r/WritingPrompts\n37. r/DestructiveReaders\n38. r/literature\n39. r/Jokes\n40. r/circlejerk\n41. r/circlejerkcopypasta\n42. r/u_GallowBoob\n43. r/wholesomebpt\n44. r/MadeMeSmile\n45. r/fakeprehistoricporn\n46. r/NatureIsFuckingLit\n47. r/aww\n48. r/nextfuckinglevel\n49. r/interestingasfuck\n50. r/Wellthatsucks\n51. r/pics\n52. r/oddlysatisfying\n53. r/holdmycosmo\n54. r/BetterEveryLoop\n55. r/whitepeoplegifs\n56. r/BlackPeopleTwitter\n57. r/WhitePeopleTwitter\n58. r/madlads\n59. r/Damnthatsinteresting\n60. r/memes\n61. r/Eyebleach\n62. r/cosplaygirls\n63. r/StoppedWorking\n64. r/thisismylifenow\n65. r/photoshopbattles\n66. r/wholesomememes\n67. r/birding\n68. r/XboxOneGamers\n69. r/zoology\n70. r/coins\n71. r/gardening\n72. r/AskReddit\n73. r/news\n74. r/mildlyinteresting\n75. r/woodworking\n76. r/TrueChristian\n77. r/Christianity\n78. r/Showerthoughts\n79. r/botany\n80. r/whatsthisplant\n81. r/Agronomy\n82. r/science\n83. r/Bass\n84. r/DCcomics\n85. r/NZXT\n86. r/H3VR\n87. r/miband\n88. r/patientgamers\n89. r/Doom\n90. r/ThisAmericanLife\n91. r/Massdrop\n92. r/tf2\n93. r/ElgatoGaming\n94. r/emacs\n95. r/u_awkisopen\n96. r/Spyro\n97. r/AHatInTime\n98. r/Portal\n99. r/Huawei\n100. r/soylent\n101. r/JonTron\n102. r/TopGear\n103. r/Windows10\n104. r/naut\n105. r/gaming\n106. r/RESissues\n107. r/FirstPersonSoda\n108. r/titlegore\n109. r/dogecoin\n110. r/tf2circlejerk\n111. r/NotTimAndEric\n112. r/Enhancement\n113. r/texas\n114. r/iamverysmart\n115. r/trees\n116. r/sailormoon\n117. r/bleachshirts\n118. r/facepalm\n119. r/thatHappened\n120. r/cringepics\n121. r/pitbulls\n122. r/dbz\n123. r/rareinsults\n124. r/Brawlhalla\n125. r/dankmemes\n126. r/PornhubComments\n127. r/marvelstudios\n128. r/GamePhysics\n129. r/gifsthatendtoosoon\n130. r/PrequelMemes\n131. r/comedyheaven\n132. r/me_irl\n133. r/MurderedByWords\n134. r/FortNiteBR\n135. r/ClashOfClans\n136. r/oddlyterrifying\n137. r/therewasanattempt\n138. r/creepyPMs\n139. r/AskOuija\n140. r/woahdude\n141. r/animalsdoingstuff\n142. r/trashpandas\n143. r/MealPrepSunday\n144. r/OldManDog\n145. r/vaxxhappened\n146. r/lewronggeneration\n147. r/iphone\n148. r/ExpectationVsReality\n149. r/mlem\n150. r/BeAmazed\n151. r/instant_regret\n152. r/nononono\n153. r/blackmagicfuckery\n154. r/yesyesyesyesno\n155. r/Whatcouldgowrong\n156. r/TumblrInAction\n157. r/legaladvice\n158. r/dogpictures\n159. r/toofers\n160. r/gatekeeping\n161. r/dontdeadopeninside\n162. r/mildlyinfuriating\n163. r/assholedesign\n164. r/Instagram\n165. r/uselessredcircle\n166. r/WTF\n167. r/Badfaketexts\n168. r/GarlicBreadMemes\n169. r/whatisthisthing\n170. r/Advice\n171. r/13or30\n172. r/SwordOrSheath\n173. r/WtWFotMJaJtRAtCaB\n174. r/shittyfoodporn\n175. r/bigboye\n176. r/FellowKids\n177. r/DiWHY\n178. r/NotHowDrugsWork\n179. r/Incorgnito\n180. r/im14andthisisdeep\n181. r/WhatsWrongWithYourDog\n182. r/IDontWorkHereLady\n183. r/DesignPorn\n184. r/ShitCosmoSays\n185. r/delusionalcraigslist\n186. r/Delightfullychubby\n187. r/fatlogic\n188. r/engrish\n189. r/CozyPlaces\n190. r/mildlypenis\n191. r/rarepuppers\n192. r/blunderyears\n193. r/LetsNotMeet\n194. r/h3h3productions\n195. r/cringe\n196. r/pugs\n197. r/Pareidolia\n198. r/natureismetal\n199. r/StarWars\n200. r/marvelmemes\n201. r/splatoon\n202. r/just2good\n203. r/smashbros\n204. r/cursedimages\n205. r/AnimalCrossing\n206. r/TIHI\n207. r/Twitter\n208. r/GoCommitDie\n209. r/amiibo\n210. r/lego\n211. r/technicallythetruth\n212. r/disney\n213. r/inthesoulstone\n214. r/NintendoSwitch\n215. r/Marvel\n216. r/discordapp\n217. r/SpidermanPS4\n218. r/ShovelKnight\n219. r/NotMyJob\n220. r/CrappyDesign\n221. r/PhotoshopRequest\n222. r/Bossfight\n223. r/thanosdidnothingwrong\n224. r/northernireland\n225. r/unexpectedpawnee\n226. r/shittymobilegameads\n227. r/Valefisk\n228. r/UnexpectedPsych\n229. r/paydaytheheist\n230. r/CommunismMemes\n231. r/unexpectedyogscast\n232. r/softwaregore\n233. r/the_revolupun\n234. r/HiTMAN\n235. r/SuddenlyCommunist\n236. r/cardsagainsthumanity\n237. r/BitLifeApp\n238. r/Punny\n239. r/onejob\n240. r/HistoryMemes\n241. r/Unexpected\n242. r/TwoSentenceHorror\n243. r/cavetown\n244. r/LucidDreaming\n245. r/Journaling\n246. r/Leathercraft\n247. r/InfinityTrain\n248. r/anime\n249. r/LifeProTips\n250. r/apexlegends\n251. r/Guitar\n252. r/skateboarding\n253. r/gifsthatkeepongiving\n254. r/Magic\n255. r/SootHouse\n256. r/Roku\n257. r/PewdiepieSubmissions\n258. r/hypnosis\n259. r/FORTnITE\n260. r/psych\n261. r/nonononoyes\n262. r/Cinemagraphs\n263. r/toptalent\n264. r/INEEEEDIT\n265. r/AnimalsBeingDerps\n266. r/AnimalsBeingJerks\n267. r/lifehacks\n268. r/FastWorkers\n269. r/UNBGBBIIVCHIDCTIICBG\n270. r/Aquariums\n271. r/politics\n272. r/TheOnion\n273. r/worldnews\n274. r/nottheonion\n275. r/fakehistoryporn\n276. r/gay_irl\n277. r/sweden\n278. r/Music\n279. r/boottoobig\n280. r/fakealbumcovers\n281. r/PoliticalHumor\n282. r/videos\n283. r/lgbt\n284. r/SuddenlyGay\n285. r/emojipasta\n286. r/gifs\n287. r/trashy\n288. r/ihadastroke\n289. r/sequence\n290. r/AteTheOnion\n291. r/EarthPorn\n292. r/Fireteams\n293. r/BOLC\n294. r/SkincareAddiction\n295. r/SkincareAddicts\n296. r/ApparentlyArt\n297. r/youdontsurf\n298. r/trippinthroughtime\n299. r/funny\n300. r/AdviceAnimals\n301. r/dankchristianmemes\n302. r/DeepFriedMemes\n303. r/FunnyandSad\n304. r/Instagramreality\n305. r/CatsStandingUp\n306. r/Calgary\n307. r/japanpics\n308. r/thebachelor\n309. r/weddingplanning\n310. r/AirBnB\n311. r/BigBrother\n312. r/femalefashionadvice\n313. r/meirl\n314. r/cats\n315. r/MakeupAddiction\n316. r/AsianBeauty\n317. r/japan\n318. r/UpliftingNews\n319. r/SweatyPalms\n320. r/absolutelynotmeirl\n321. r/2meirl42meirl4meirl\n322. r/suspiciouslyspecific\n323. r/Catloaf\n324. r/confusing_perspective\n325. r/todayilearned\n326. r/meormyson\n327. r/teenagers\n328. r/jailbreak\n329. r/suicidebywords\n330. r/terriblefacebookmemes\n331. r/insanepeoplefacebook\n332. r/hitmanimals\n333. r/totallynotrobots\n334. r/AbruptChaos\n335. r/unixporn\n336. r/MemeHunter\n337. r/MonsterHunter\n338. r/ngpluscreations\n339. r/opus_magnum\n340. r/horizon\n341. r/KerbalSpaceProgram\n342. r/Horror_Game_Videos\n343. r/NoMansSkyTheGame\n344. r/ConsoleKSP\n345. r/metalgearsolid\n346. r/destiny2\n347. r/applehelp\n348. r/Naruto\n349. r/pkmntcgcollections\n350. r/pokemoncardcollectors\n351. r/KidsAreFuckingStupid\n352. r/AnimalsBeingBros\n353. r/fasting\n354. r/funnyvideos\n355. r/sports\n356. r/CFB\n357. r/techsupport\n358. r/iastate\n359. r/3amjokes\n360. r/Stargate\n361. r/Gloryhammer\n362. r/buildmeapc\n363. r/cfbcirclejerk\n364. r/dadjokes\n365. r/AmITheAngel\n366. r/ShitPoliticsSays\n367. r/findareddit\n368. r/1star\n369. r/TheMonkeysPaw\n370. r/CFL\n371. r/PRTwitter\n372. r/FloridaMan\n373. r/HaveWeMet\n374. r/civ\n375. r/buildapc\n376. r/CollegeBasketball\n377. r/antiMLM\n378. r/backpacks\n379. r/computers\n380. r/unpopularopinion\n381. r/boomershumor\n382. r/ComedySuicide\n383. r/CitiesSkylines\n384. r/sabaton\n385. r/Blackops4\n386. r/Ligue1\n387. r/WomensSoccer\n388. r/soccer\n389. r/anonymousgoals\n390. r/MindHunter\n391. r/okbuddyretard\n392. r/IncelTears\n393. r/freefolk\n394. r/HydroHomies\n395. r/Fuckthealtright\n396. r/beholdthemasterrace\n397. r/iamatotalpieceofshit\n398. r/holdmyvodka\n399. r/maybemaybemaybe\n400. r/facebookwins\n401. r/fuckwasps\n402. r/PeopleFuckingDying\n403. r/HoldMyKibble\n404. r/PublicFreakout\n405. r/holdmyjuicebox\n406. r/awfuleverything\n407. r/agedlikemilk\n408. r/LateStageCapitalism\n409. r/HongKong\n410. r/television\n411. r/youseeingthisshit\n412. r/hmmm\n413. r/Moviesinthemaking\n414. r/askscience\n415. r/FFXIVhousingmarket\n416. r/HumansBeingBros\n417. r/combinedgifs\n418. r/blackpeoplegifs\n419. r/nostalgia\n420. r/u_MyNameGifOreilly\n421. r/wholesomegifs\n422. r/UnexpectedlyWholesome\n423. r/barkour\n424. r/RedditPotluck\n425. r/Awwducational\n426. r/holdmybeer\n427. r/IdiotsInCars\n428. r/MadeMeCry\n429. r/reactiongifs\n430. r/holdmyredbull\n431. r/HighQualityGifs\n432. r/greece\n433. r/ereader\n434. r/KGBTR\n435. r/lost\n436. r/instantkarma\n437. r/JusticeServed\n438. r/Anarcho_Capitalism\n439. r/IntellectualDarkWeb\n440. r/selfpublish\n441. r/FFVIIRemake\n442. r/neoliberal\n443. r/samharris\n444. r/HouseOfCards\n445. r/PowerTV\n446. r/justneckbeardthings\n447. r/scifiwriting\n448. r/YangForPresidentHQ\n449. r/Gamingcirclejerk\n450. r/Libertarian\n451. r/aznidentity\n452. r/daverubin\n453. r/Cyberpunk\n454. r/litrpg\n455. r/postapocalyptic\n456. r/books\n457. r/movies\n458. r/moviescirclejerk\n459. r/badscience\n460. r/EnoughCommieSpam\n461. r/Destiny\n462. r/starterpacks\n463. r/JRPG\n464. r/worldjerking\n465. r/PokemonCirclejerk\n466. r/tulsi\n467. r/pokemon\n468. r/PokemonSwordAndShield\n469. r/legendofkorra\n470. r/COMPLETEANARCHY\n471. r/poetasters\n472. r/listentothis\n473. r/bookscirclejerk\n474. r/Poetry\n475. r/PoliticalCompass\n476. r/doggohate\n477. r/poetry_critics\n478. r/OCPoetry\n479. r/TrueFilm\n480. r/tipofmytongue\n481. r/ShittyPoetry\n482. r/pathologic\n483. r/Jalopy\n484. r/TheGreatWarChannel\n485. r/britishproblems\n486. r/ShitAmericansSay\n487. r/OCPoetryCirclejerk\n488. r/Nonprofit_Jobs\n489. r/FunkoPopsCircleJerk\n490. r/tipofmyjoystick\n491. r/ilikthebred\n492. r/totalwar\n493. r/shittywritingprompts\n494. r/AskScienceFiction\n495. r/AskSocialScience\n496. r/IASIP\n497. r/toledo\n498. r/TopMindsOfReddit\n499. r/ShittyFanTheories\n500. r/40kLore\n501. r/circlebroke2\n502. r/ScenesFromAHat\n503. r/Lovecraft\n504. r/TrumpCriticizesTrump\n505. r/changemyview\n506. r/The_Mueller\n507. r/PetMice\n508. r/Dreams\n509. r/esist\n510. r/EnoughTrumpSpam\n511. r/RationalizeMyView\n512. r/RussiaDenies\n513. r/Impeach_Trump\n514. r/forwardsfromgrandma\n515. r/AskVet\n516. r/AsABlackMan\n517. r/u_BlueLadybug92\n518. r/pointlesslygendered\n519. r/learntodraw\n520. r/learnart\n521. r/ICanDrawThat\n522. r/Animemes\n523. r/redditgetsdrawn\n524. r/KeepWriting\n525. r/CongratsLikeImFive\n526. r/writingprompt\n527. r/learnHentaiDrawing\n528. r/AskRedditAfterDark\n529. r/reddithelp\n530. r/askatherapist\n531. r/roadtrip\n532. r/whatsthisbug\n533. r/DragonPrince\n534. r/miraculousladybug\n535. r/relationship_advice\n536. r/Writer\n537. r/u_Peterwynmosey\n538. r/selfpromotion\n539. r/LitWorkshop\n540. r/shortstories\n541. r/Veganism\n542. r/flashfiction\n543. r/vegan\n544. r/environment\n545. r/WritersGroup\n546. r/classicwow\n547. r/fantasywriters\n548. r/Philza\n549. r/Unextexted\n550. r/PowerMetal\n551. r/scrivener\n552. r/thesims\n553. r/malehairadvice\n554. r/celestegame\n555. r/bald\n556. r/FlowScape\n557. r/Minecraft\n558. r/MetalPlaylists\n559. r/characterdrawing\n560. r/spotify\n561. r/DivinityOriginalSin\n562. r/dndmemes\n563. r/criticalrole\n564. r/TurkeyJerky\n565. r/wonderdraft\n566. r/worldbuilding\n567. r/skyrimmods\n568. r/explainlikeimfive\n569. r/Dell\n570. r/grammar\n571. r/AskLEO\n572. r/Cooking\n573. r/workout\n574. r/videogames\n575. r/bookshelf\n576. r/jazzcirclejerk\n577. r/Swimming\n578. r/ApplyingToCollege\n579. r/ImaginaryDragons\n580. r/blurrypicturesofcats\n581. r/BetaReaders\n582. r/self\n583. r/CasualConversation\n584. r/Sat\n585. r/learnmath\n586. r/teefies\n587. r/Cursed_Images\n588. r/guitars\n589. r/usa\n590. r/SupermodelCats\n591. r/SampleSize\n592. r/Neverbrokeabone\n593. r/IBO\n594. r/Stoicism\n595. r/wallstreetbets\n596. r/restofthefuckingowl\n597. r/indianpeoplefacebook\n598. r/starcitizen\n599. r/loseit\n600. r/Fitness\n601. r/AbsoluteUnits\n602. r/CircleofTrust\n603. r/disneyvacation\n604. r/fpv\n605. r/niceguys\n606. r/LitecoinMarkets\n607. r/bonehurtingjuice\n608. r/AskDocs\n609. r/litecoin\n610. r/ComedyCemetery\n611. r/NamFlashbacks\n612. r/FashionReps\n613. r/THE_PACK\n614. r/aviation\n615. r/surrealmemes\n616. r/piano\n617. r/theisle\n618. r/Blep\n619. r/braces\n620. r/quityourbullshit\n621. r/youngartists\n622. r/ToolBand\n623. r/youtubehaiku\n624. r/Catholicism\n625. r/LouderWithCrowder\n626. r/ketorecipes\n627. r/Conservative\n628. r/Screenwriting\n629. r/beerporn\n630. r/GameOfThronesMemes\n631. r/Filmmakers\n632. r/WoT\n633. r/Muppets\n634. r/steampunk\n635. r/mutemath\n636. r/n64\n637. r/overthegardenwall\n638. r/gamemusic\n639. r/Denver\n640. r/miniSNESmods\n641. r/SteinsGateMemes\n642. r/animegifs\n643. r/SUBREDDITNAME\n644. r/flowers\n645. r/chillhop\n646. r/rush\n647. r/Watches\n648. r/RussianTrollSpotting\n649. r/GreenBayPackers\n650. r/StardewValley\n651. r/pokemontrades\n652. r/LosAngelesRams\n653. r/Eve\n654. r/EvilLeagueOfEvil\n655. r/Anglicanism\n656. r/UniversityofKansas\n657. r/Arkansas\n658. r/Archery\n659. r/Iteration110Cradle\n660. r/Crunchyroll\n661. r/evangelion\n662. r/Fantasy\n663. r/malefashionadvice\n664. r/Audi\n665. r/Piracy\n666. r/52book\n667. r/suggestmeabook\n668. r/booksuggestions\n669. r/whiteknighting\n670. r/sololeveling\n671. r/audible\n672. r/emulation\n673. r/kindle\n674. r/Aliexpress\n675. r/brakebills\n676. r/cremposting\n677. r/Kuwait\n678. r/brandonsanderson\n679. r/ACMilan\n680. r/TenseiSlime\n681. r/Isekai\n682. r/TheDarkTower\n683. r/BlackClover\n684. r/Ask_Politics\n685. r/redrising\n686. r/Mistborn\n687. r/magicbuilding\n688. r/deathnote\n689. r/KingkillerChronicle\n690. r/BrentWeeks\n691. r/3dshacks\n692. r/3DS\n693. r/HunterXHunter\n694. r/Stormlight_Archive\n695. r/fuckmoash\n696. r/manga\n697. r/VinlandSaga\n698. r/DrStone\n699. r/AskHistorians\n700. r/de\n701. r/EuropeMeta\n702. r/europe\n703. r/Twitch\n704. r/history\n705. r/SpiceandWolf\n706. r/hoi4\n707. r/ParadoxExtra\n708. r/Steel_Division\n709. r/Warthunder\n710. r/RPClipsGTA\n711. r/hoi4modding\n712. r/OldWorldBlues\n713. r/GrandTheftAutoV\n714. r/dayz\n715. r/metro\n716. r/logic\n717. r/squirrels\n718. r/NoStupidQuestions\n719. r/printSF\n720. r/whatstheword\n721. r/earrumblersassemble\n722. r/Coffee\n723. r/rickandmorty\n724. r/BrandNewSentence\n725. r/PoliticalVideo\n726. r/poker\n727. r/DAE\n728. r/AskMen\n729. r/AskWomen\n730. r/notliketheothergirls\n731. r/depression\n732. r/sixwordstories\n733. r/DougysDramatics\n734. r/TownofSalemgame\n735. r/omegle\n736. r/slaythespire\n737. r/infp\n738. r/haiku\n739. r/leagueoflegends\n740. r/bridgeporn\n741. r/KaynMains\n742. r/MandelaEffect\n743. r/ArcherFX\n744. r/gtaonline\n745. r/everyfuckingthread\n746. r/SummerReddit\n747. r/BuyItForLife\n748. r/dearwhitepeople\n749. r/HipHopImages\n750. r/FragileWhiteRedditor\n751. r/answers\n752. r/Scrubs\n753. r/spoiledboomermemes\n754. r/Negareddit\n755. r/CasualUK\n756. r/ExplainMyDownvotes\n757. r/Ijustwatched\n758. r/AskUK\n759. r/90sHipHop\n760. r/HelpMeFind\n761. r/samsung\n762. r/STARonFox\n763. r/androidapps\n764. r/That70sshow\n765. r/ENLIGHTENEDCENTRISM\n766. r/EmpireTV\n767. r/iMPC\n768. r/twosentencepitch\n769. r/seinfeld\n770. r/KingOfTheHill\n771. r/malcolminthemiddle\n772. r/TheSimpsons\n773. r/juxtaposition\n774. r/AussieHipHop\n775. r/settlethisforme\n776. r/dropship\n777. r/OnMyBlock\n778. r/JustUnsubbed\n779. r/TheWalkingDeadGame\n780. r/PS4\n781. r/TTVreborn\n782. r/fujix\n783. r/tennis\n784. r/TrueOffMyChest\n785. r/AMA\n786. r/germany\n787. r/criterion\n788. r/exjw\n789. r/survivor\n790. r/LadyGaga\n791. r/acappella\n792. r/hiphopheads\n793. r/horror\n794. r/videography\n795. r/moviecritic\n796. r/arcadefire\n797. r/indiemovies\n798. r/horrorlit\n799. r/stephenking\n800. r/badroommates\n801. r/CatTraining\n802. r/relationships\n803. r/Dogtraining\n804. r/WhatsWrongWithYourCat\n805. r/Frugal_Jerk\n806. r/tifu\n807. r/glee\n808. r/DoesAnybodyElse\n809. r/PubTips\n810. r/Gifted\n811. r/Reincarnation\n812. r/therapy\n813. r/spirituality\n814. r/23andme\n815. r/FondantHate\n816. r/mildly_ace\n817. r/PaintedWolves\n818. r/aaaaaaacccccccce\n819. r/thelongdark\n820. r/1200isjerky\n821. r/DetroitBecomeHuman\n822. r/asexuality\n823. r/RBNMusic\n824. r/gachagaming\n825. r/EpicSeven\n826. r/inspirobot\n827. r/NotKenM\n828. r/GameSale\n829. r/Feic\n830. r/dragonblaze\n831. r/FinalBlade\n832. r/MemeTemplatesOfficial\n833. r/gamedev\n834. r/shittydarksouls\n835. r/rpg_gamers\n836. r/AccidentalComedy\n837. r/grandorder\n838. r/GOtrades\n839. r/FGOmemes\n840. r/reddeadredemption2\n841. r/MemeEconomy\n842. r/questions\n843. r/IntegralFactor\n844. r/HIMYM\n845. r/DragaliaLost\n846. r/community\n847. r/PickAnAndroidForMe\n848. r/comedynecromancy\n849. r/AndroidGaming\n850. r/EmulationOnAndroid\n851. r/darksouls3\n852. r/Granblue_en\n853. r/Kanye\n854. r/Magisk\n855. r/ageofmagic\n856. r/soanamnesis\n857. r/JusticeReturned\n858. r/askpsychology\n859. r/Bad_Cop_No_Donut\n860. r/JimSterling\n861. r/openttd\n862. r/RocketLeagueFriends\n863. r/AntiJokes\n864. r/fifthworldproblems\n865. r/RocketLeague\n866. r/buildapcforme\n867. r/Animesuggest\n868. r/asoiaf\n869. r/DnDBehindTheScreen\n870. r/whitepeoplewritingPOC\n871. r/menwritingwomen\n872. r/holdmyfeedingtube\n873. r/heroscape\n874. r/plothelp\n875. r/HireAnEditor\n876. r/EverythingAvian\n877. r/NLSSCircleJerk\n878. r/northernlion\n879. r/darksouls\n880. r/classicalmusic\n881. r/TooAfraidToAsk\n882. r/HollowKnight\n883. r/Psychonaut\n884. r/medicine\n885. r/metacanada\n886. r/furry\n887. r/Stellaris\n888. r/atheism\n889. r/mildlyhalo\n890. r/islam\n891. r/AmItheAsshole\n892. r/halo\n893. r/guns\n894. r/darkestdungeon\n895. r/dwarffortress\n896. r/ContagiousLaughter\n897. r/Markiplier\n898. r/SS13\n899. r/Judaism\n900. r/RimWorld\n901. r/college\n902. r/bindingofisaac\n903. r/Sikh\n904. r/ExplainLikeImCalvin\n905. r/hearthstone\n906. r/Rainbow6\n907. r/videogamedunkey\n908. r/etymology\n909. r/DrewDurnil\n910. r/StarWarsBattlefront\n911. r/HollowKnightMemes\n912. r/SmashBrosUltimate\n913. r/shittysuperpowers\n914. r/ExplainAFilmPlotBadly\n915. r/Borderlands\n916. r/customhearthstone\n917. r/FalloutMiami\n918. r/ShittySpaceXIdeas\n919. r/asktransgender\n920. r/Touhou_NSFW\n921. r/SRSBusiness\n922. r/roguelikes\n923. r/SciFiAndFantasy\n924. r/WouldYouRather\n925. r/godtiersuperpowers\n926. r/cookingforbeginners\n927. r/danganronpa\n928. r/BoostForReddit\n929. r/oneplus\n930. r/ShingekiNoKyojin\n931. r/attackontitan\n932. r/learnprogramming\n933. r/aggies\n934. r/SiegeAcademy\n935. r/assassinscreed\n936. r/clep\n937. r/HomeworkHelp\n938. r/BoneAppleTea\n939. r/mythology\n940. r/woooosh\n941. r/Cringetopia\n942. r/Panera\n943. r/Dreadfort\n944. r/fatpeoplestories\n945. r/BrazillianSigma\n946. r/dankmeme\n947. r/Romania\n948. r/leanpeoplecirclejerk\n949. r/NoFap\n950. r/vegancirclejerk\n951. r/newsubreddits\n952. r/leangains\n953. r/footballmanagergames\n954. r/toastme\n955. r/RoastMe\n956. r/IAmA\n957. r/Needafriend\n958. r/EducativeVideos\n959. r/Rateme\n960. r/truerateme\n961. r/WatchPeopleDieInside\n962. r/rant\n963. r/RedditInReddit\n964. r/intrusivethoughts\n965. r/raimimemes\n966. r/comedyhomicide\n967. r/springfieldMO\n968. r/wildlifephotography\n969. r/GamersRiseUp\n970. r/lotrmemes\n971. r/spiderversedailymemes\n972. r/RedditWritesSeinfeld\n973. r/ChoosingBeggars\n974. r/quotes\n975. r/PokemonLetsGo\n976. r/BreakUps\n977. r/DrakeAndJoshTwitter\n978. r/chadsriseup\n979. r/Lithuaniakittens\n980. r/greentext\n981. r/Pathfinder_RPG\n982. r/Grimdawn\n983. r/rational\n984. r/pathbrewer\n985. r/Superbowl\n986. r/dndnext\n987. r/starbrewer\n988. r/octopathtraveler\n989. r/WizardofLegend\n990. r/EternalCardGame\n991. r/duelyst\n992. r/pokemongo\n993. r/gamegrumps\n994. r/stevenuniverse\n995. r/VentGrumps\n996. r/bipolar\n997. r/HotPeppers\n998. r/wicked_edge\n999. r/imbringingchili\n1000. r/badMovies\n1001. r/mallninjashit\n1002. r/Buttcoin\n1003. r/thesuperbowl\n1004. r/Atlanta\n1005. r/savageworlds\n1006. r/fermentation\n1007. r/seriouseats\n1008. r/Truckers\n1009. r/cafe\n1010. r/iamveryculinary\n1011. r/beer\n1012. r/tea\n1013. r/reptiles\n1014. r/The_Wilders\n1015. r/WeWantPlates\n1016. r/badwomensanatomy\n1017. r/tacos\n1018. r/whatsthisbird\n1019. r/EnoughLibertarianSpam\n1020. r/Pizza\n1021. r/Skookum\n1022. r/badparking\n1023. r/GWAR\n1024. r/whiteeurope\n1025. r/castiron\n1026. r/drunkencookery\n1027. r/DixieFood\n1028. r/heavyvinyl\n1029. r/knifeclub\n1030. r/ShitWehraboosSay\n1031. r/subnautica\n1032. r/legaladviceofftopic\n1033. r/Metal\n1034. r/sewing\n1035. r/cade\n1036. r/marijuanaenthusiasts\n1037. r/snakes\n1038. r/SubredditDrama\n1039. r/TreesSuckingOnThings\n1040. r/messwithtexas\n1041. r/conspiratard\n1042. r/PanicHistory\n1043. r/SteamController\n1044. r/GunsAreCool\n1045. r/witcher\n1046. r/Sovereigncitizen\n1047. r/stopdrinking\n1048. r/zen\n1049. r/PixelArt\n1050. r/shittyaskreddit\n1051. r/ProgrammerHumor\n1052. r/IGN\n1053. r/earwax\n1054. r/Anxiety\n1055. r/BSG\n1056. r/IWantToLearn\n1057. r/pcgaming\n1058. r/SmarterEveryDay\n1059. r/youtube\n1060. r/Spanish\n1061. r/Bloodstained\n1062. r/Cosmere\n1063. r/DolphinEmulator\n1064. r/Bandnames\n1065. r/death\n1066. r/dragonquest\n1067. r/UrbanFantasyWriters\n1068. r/urbanfantasy\n1069. r/blurb_help\n1070. r/weirdwest\n1071. r/blogs\n1072. r/redditisfun\n1073. r/Virginia\n1074. r/DnDGreentext\n1075. r/lfg\n1076. r/switcharoo\n1077. r/securityguards\n1078. r/AskLE\n1079. r/Games\n1080. r/cosplay\n1081. r/newtothenavy\n1082. r/lmhc\n1083. r/CCW\n1084. r/FreeKarma4You\n1085. r/askphilosophy\n1086. r/writingCollaborations\n1087. r/writingColaborations\n1088. r/lonely\n1089. r/pinkfloyd\n1090. r/StanleyKubrick\n1091. r/coaxedintoasnafu\n1092. r/EDAnonymous\n1093. r/EDanonymemes\n1094. r/japanesemusic\n1095. r/rupaulsdragrace\n1096. r/TwoXChromosomes\n1097. r/penpals\n1098. r/selfimprovement\n1099. r/amiugly\n1100. r/TheReportOfTheWeek\n1101. r/TomAndJerryMemes\n1102. r/TMJ\n1103. r/starwarscomics\n1104. r/Hull\n1105. r/dyspraxia\n1106. r/InstLife\n1107. r/StoriesByGrapefruit\n1108. r/SpotifyPlaylists\n1109. r/CatsNamedToothless\n1110. r/ACRebellion\n1111. r/FuturamaWOTgame\n1112. r/Tenagra\n1113. r/gameofthrones\n1114. r/reddit.com\n1115. r/APStudents\n1116. r/USC\n1117. r/uofm\n1118. r/BelmontUniversity\n1119. r/nyu\n1120. r/Theatre\n1121. r/acting\n1122. r/StopGaming\n1123. r/ucla\n1124. r/musicals\n1125. r/UniversityOfMichigan\n1126. r/Northwestern\n1127. r/playwriting\n1128. r/singing\n1129. r/uchicago\n1130. r/scifi\n1131. r/Gundam\n1132. r/fuckthesepeople\n1133. r/StardustCrusaders\n1134. r/fireemblem\n1135. r/ShitPostCrusaders\n1136. r/misleadingthumbnails\n1137. r/StrangerThings\n1138. r/sbubby\n1139. r/DMAcademy\n1140. r/DarkMatter\n1141. r/rpg\n1142. r/ihavesex\n1143. r/chernobyl\n1144. r/projecteternity\n1145. r/startrek\n1146. r/MisreadSprites\n1147. r/Sekiro\n1148. r/whatsapp\n1149. r/SkyrimTogether\n1150. r/nosleep\n1151. r/southafrica\n1152. r/u_sarcasonomicon\n1153. r/NoSleepOOC\n1154. r/ComedicNosleep\n1155. r/tvtropes\n1156. r/nova\n1157. r/ancient_technologies\n1158. r/AlternateHistory\n1159. r/netsecstudents\n1160. r/Escritoire\n1161. r/security\n1162. r/FlavorsOfBleach\n1163. r/reddeadredemption\n1164. r/KSU\n1165. r/whowouldwin\n1166. r/mrbungle\n1167. r/gwent\n1168. r/GalaxyS8\n1169. r/asoiafcirclejerk\n1170. r/darksouls4\n1171. r/thalassophobia\n1172. r/OTMemes\n1173. r/bloodborne\n1174. r/writerchat\n1175. r/1Cat1Chair1YrApart\n1176. r/writingVOID\n1177. r/dogsong\n1178. r/readerchat\n1179. r/Megaten\n1180. r/kpophelp\n1181. r/tolkienfans\n1182. r/lotr\n1183. r/godot\n1184. r/WorldOfYs\n1185. r/Diablo\n1186. r/Metroid\n1187. r/atlantis\n1188. r/Daggerfall\n1189. r/zelda\n1190. r/Xenoblade_Chronicles\n1191. r/CamilleMains\n1192. r/gamemaker\n1193. r/Maya\n1194. r/ProPresenter\n1195. r/ZBrush\n1196. r/techtheatre\n1197. r/valve\n1198. r/tomorrow\n1199. r/australia\n1200. r/Geelong\n1201. r/WarhammerChampions\n1202. r/dosgaming\n1203. r/russian\n1204. r/Hematology\n1205. r/rstats\n1206. r/RStudio\n1207. r/ukpolitics\n1208. r/lancasteruni\n1209. r/electronicmusic\n1210. r/EDM\n1211. r/TruAnarchy\n1212. r/arabfunny\n1213. r/dataisugly\n1214. r/AnarchyChess\n1215. r/shittyaskscience\n1216. r/Anarchism\n1217. r/ShitRedditSays\n1218. r/outside\n1219. r/SelfAwarewolves\n1220. r/InternationalDev\n1221. r/math\n1222. r/trap\n1223. r/LegalAdviceUK\n1224. r/ChristianUniversalism\n1225. r/bestof\n1226. r/rtms\n1227. r/transgendercirclejerk\n1228. r/WormMemes\n1229. r/eroticauthors\n1230. r/firstworldproblems\n1231. r/YouShouldKnow\n1232. r/fffffffuuuuuuuuuuuu\n1233. r/Mommit\n1234. r/WritingHub\n1235. r/DarK\n1236. r/SimplePrompts\n1237. r/unintentionalASMR\n1238. r/typewriters\n1239. r/MOONMOON_OW\n1240. r/FocusRS\n1241. r/fireTV\n1242. r/MeatlessMealPrep\n1243. r/recipes\n1244. r/pittsburgh\n1245. r/vegetarian\n1246. r/1200isplenty\n1247. r/motorcycles\n1248. r/TuckedInPuppies\n1249. r/bingingwithbabish\n1250. r/circumcision\n1251. r/zizek\n1252. r/ifyoulikeblank\n1253. r/animecirclejerk\n1254. r/boltsoccer\n1255. r/iosgaming\n1256. r/TheArmory\n1257. r/TestingRange\n1258. r/destroyautomodskarma\n1259. r/Stjordal\n1260. r/tabletennis\n1261. r/PokemonPlaza\n1262. r/Nimiq\n1263. r/robotics\n1264. r/TheLabourPartyUK\n1265. r/writingdaily\n1266. r/violinist\n1267. r/simbot\n1268. r/Sitar\n1269. r/AppleWatchFitness\n1270. r/dubai\n1271. r/MySingingMonsters\n1272. r/biblereading\n1273. r/Dateline48Hours\n1274. r/CarAV\n1275. r/BuffHydra\n1276. r/hyptoheicla\n1277. r/Recruitment\n1278. r/IHopeYouDieSlowly\n1279. r/flappygolf\n1280. r/mechanicalpencils\n1281. r/BoundaryBreak\n1282. r/Nokia\n1283. r/feckingbirds\n1284. r/gramps\n1285. r/eliaszjm\n1286. r/CryptoWorth\n1287. r/Agario\n1288. r/WorldWar3Community\n1289. r/plebflair\n1290. r/Netflix_jp\n1291. r/GarlicMarket\n1292. r/Mydaily3\n1293. r/automodspamtest\n1294. r/Lexus\n1295. r/running\n1296. r/DraftEPL\n1297. r/youtrip\n1298. r/Frontend\n1299. r/DebateEvolution\n1300. r/businessanalysis\n1301. r/survivalheroes\n1302. r/PRAllStars\n1303. r/Cruise\n1304. r/ethdev\n1305. r/MrLove\n1306. r/CryptoCurrency\n1307. r/LesbianActually\n1308. r/georgeharrison\n1309. r/NavCoin\n1310. r/solvecare\n1311. r/IsTodayOppositeDay\n1312. r/LitecoinCashMarkets\n1313. r/MemriTVmemes\n1314. r/SkrillexDev\n1315. r/pesmobile\n1316. r/RMTK\n1317. r/DisneyPlus\n1318. r/disciplineplanned\n1319. r/AgeofMan\n1320. r/corporatesim\n1321. r/afkarena\n1322. r/TestSubReddit_\n1323. r/Sovreignty\n1324. r/Droplet_coin\n1325. r/datasets\n1326. r/PokeMoonSun\n1327. r/mogeko\n1328. r/pan\n1329. r/CODZombies\n1330. r/Vanced\n1331. r/collapse\n1332. r/yumenikki\n1333. r/Lightbulb\n1334. r/deadcells\n1335. r/HotlineMiami\n1336. r/CPUCS\n1337. r/scoobandshag\n1338. r/Skullgirls\n1339. r/TrueDeemo\n1340. r/katawashoujo\n1341. r/dontstarve\n1342. r/killingfloor\n1343. r/theydidthemath\n1344. r/swordfighting\n1345. r/Fighters\n1346. r/DDLC\n1347. r/KingdomHearts\n1348. r/FATErpg\n1349. r/morbidquestions\n1350. r/BatmanArkham\n1351. r/TheStoryExperiment\n1352. r/RepostHallOfFame\n1353. r/redditrequest\n1354. r/HiTopFilmsCirclejerk\n1355. r/pcmasterrace\n1356. r/DC_Cinematic\n1357. r/Beatmatch\n1358. r/DJs\n1359. r/ContemporaryArt\n1360. r/TheAdventureZone\n1361. r/whatcarshouldIbuy\n1362. r/HildaTheSeries\n1363. r/badhistory\n1364. r/adventuretime\n1365. r/classicalfencing\n1366. r/Fencing\n1367. r/Portland\n1368. r/TrumpNicknames\n1369. r/DnD\n1370. r/webfiction\n1371. r/webserials\n1372. r/massachusetts\n1373. r/CapeCod\n1374. r/freelanceWriters\n1375. r/travel\n1376. r/uofi\n1377. r/pagan\n1378. r/SuicideWatch\n1379. r/renfaire\n1380. r/TameImpala\n1381. r/Bastille\n1382. r/neuroscience\n1383. r/happycowgifs\n1384. r/the1975\n1385. r/lorde\n1386. r/GodofWar\n1387. r/wolfalice\n1388. r/DavidBowie\n1389. r/formula1\n1390. r/WriteWithMe\n1391. r/creepypasta\n1392. r/scarystories\n1393. r/batman\n1394. r/Business_Ideas\n1395. r/StoryWriting\n1396. r/FanFiction\n1397. r/camphalfblood\n1398. r/dcuonline\n1399. r/venting\n1400. r/Spiderman\n1401. r/transformers\n1402. r/ZooTycoon\n1403. r/rct\n1404. r/comicbooks\n1405. r/Xcom\n1406. r/dragonage\n1407. r/Knife_Swap\n1408. r/EDCexchange\n1409. r/thedivision\n1410. r/AskPhysics\n1411. r/ReadingFantasy\n1412. r/TheDivision_LFG\n1413. r/AnthemTheGame\n1414. r/fnki\n1415. r/PinkFloydCircleJerk\n1416. r/Muse\n1417. r/LetsTalkMusic\n1418. r/RWBY\n1419. r/beatlescirclejerk\n1420. r/RogerWaters\n1421. r/beatles\n1422. r/underratedsongs\n1423. r/u_SiggetSpagget\n1424. r/Slazo\n1425. r/shortscarystories\n1426. r/Infuriating\n1427. r/Songwriting\n1428. r/tf2memes\n1429. r/pyrocynical\n1430. r/UnexpectedMulaney\n1431. r/findasubreddit\n1432. r/DunderMifflin\n1433. r/lionking\n1434. r/iamveryrandom\n1435. r/extremelyinfuriating\n1436. r/aves\n1437. r/MonsterProm\n1438. r/piercing\n1439. r/deaf\n1440. r/GotG\n1441. r/drawing\n1442. r/flicks\n1443. r/makemychoice\n1444. r/DreamInterpretation\n1445. r/genesysrpg\n1446. r/JaneTheVirginCW\n1447. r/whatsthatbook\n1448. r/crazyexgirlfriend\n1449. r/NameThatSong\n1450. r/happy\n1451. r/HPSlashFic\n1452. r/HPfanfiction\n1453. r/ACPocketCamp\n1454. r/harrypotter\n1455. r/brooklynninenine\n1456. r/iZombie\n1457. r/6teenfans\n1458. r/oban\n1459. r/shield\n1460. r/TellTaleBatmanSeries\n1461. r/glasgow\n1462. r/BSL\n1463. r/PersonOfInterest\n1464. r/telltale\n1465. r/Scotland\n1466. r/ArtCrit\n1467. r/comics\n1468. r/OutOfTheLoop\n1469. r/shittyreactiongifs\n1470. r/GalaxyNote8\n1471. r/GCSE\n1472. r/bulgaria\n1473. r/theydidntdothemath\n1474. r/ShouldIbuythisgame\n1475. r/Steam\n1476. r/RealmDefenseTD\n1477. r/EmpireWarriorsTD\n1478. r/popheads\n1479. r/titanfolk\n1480. r/Journalism\n1481. r/bobdylan\n1482. r/snes\n1483. r/BernieSanders\n1484. r/unitedkingdom\n1485. r/martialarts\n1486. r/sex\n1487. r/mountandblade\n1488. r/BDSMAdvice\n1489. r/eating_disorders\n1490. r/autism\n1491. r/selfharm\n1492. r/trans\n1493. r/loseitnarwhals\n1494. r/ftm\n1495. r/Writing_exercises\n1496. r/confession\n1497. r/HardToSwallowPills\n1498. r/confessions\n1499. r/fiction\n1500. r/u_SentientScribble\n1501. r/Writeresearch\n1502. r/ancientgreece\n1503. r/ArmsandArmor\n1504. r/HistoryWhatIf\n1505. r/JapaneseHistory\n1506. r/ChineseHistory\n1507. r/mushroomkingdom\n1508. r/AskScienceDiscussion\n1509. r/PS4Deals\n1510. r/biglittlelies\n1511. r/GreatXboxDeals\n1512. r/cyberpunkgame\n1513. r/HomeNetworking\n1514. r/ancestors\n1515. r/yakuzagames\n1516. r/RebelGalaxy\n1517. r/cemu\n1518. r/DQBuilders\n1519. r/YAlit\n1520. r/RatchetAndClank\n1521. r/YAwriters\n1522. r/wacom\n1523. r/visualnovels\n1524. r/digitalnomad\n1525. r/solotravel\n1526. r/laptops\n1527. r/sleep\n1528. r/MassEffectAndromeda\n1529. r/TinyHouses\n1530. r/Seaofthieves\n1531. r/tattoos\n1532. r/nhaa\n1533. r/Dreamtheater\n1534. r/pathofexile\n1535. r/Wildfire\n1536. r/Firefighting\n1537. r/help\n1538. r/legal\n1539. r/zombies\n1540. r/Achievement_Hunter\n1541. r/audiobooks\n1542. r/VoiceActing\n1543. r/ACX\n1544. r/UnearthedArcana\n1545. r/DungeonWorld\n1546. r/DnDHomebrew\n1547. r/DnD5CommunityRanger\n1548. r/BehaviorAnalysis\n1549. r/starwarsspeculation\n1550. r/saltierthancrait\n1551. r/StarWarsLeaks\n1552. r/gurps\n1553. r/auxlangs\n1554. r/socialjustice101\n1555. r/AskARussian\n1556. r/FalseFriends\n1557. r/chvrches\n1558. r/Mapona\n1559. r/UniversalScript\n1560. r/StateofRiodeJaneiro\n1561. r/tatu\n1562. r/nudism\n1563. r/languagelearning\n1564. r/ForwardsfromCortez\n1565. r/bisexual\n1566. r/brasil\n1567. r/AskAnAmerican\n1568. r/geographynow\n1569. r/civilengineering\n1570. r/conlangs\n1571. r/mapmaking\n1572. r/AskEurope\n1573. r/genderfluid\n1574. r/neography\n1575. r/BoardwalkEmpire\n1576. r/PlasticSurgery\n1577. r/golf\n1578. r/breakingbad\n1579. r/CreditCards\n1580. r/DanLeBatardShow\n1581. r/comedy\n1582. r/USCivilWar\n1583. r/psychedelicrock\n1584. r/technology\n1585. r/musicindustry\n1586. r/mlb\n1587. r/madmen\n1588. r/LawSchool\n1589. r/thesopranos\n1590. r/WeAreTheMusicMakers\n1591. r/melbourne\n1592. r/KindVoice\n1593. r/podcasts\n1594. r/itookapicture\n1595. r/photocritique\n1596. r/matlab\n1597. r/Android\n1598. r/gaybros\n1599. r/askgaybros\n1600. r/TheLastAirbender\n1601. r/bicycling\n1602. r/Frisson\n1603. r/AskCulinary\n1604. r/AndroidQuestions\n1605. r/FittitBuddy\n1606. r/gainit\n1607. r/lolgrindr\n1608. r/bodyweightfitness\n1609. r/Malazan\n1610. r/gaymers\n1611. r/outlining\n1612. r/AskGameMasters\n1613. r/Standup\n1614. r/StandUpWorkshop\n1615. r/BurningWheel\n1616. r/osr\n1617. r/TheAffair\n1618. r/bladesinthedark\n1619. r/RPGdesign\n1620. r/bookclub\n1621. r/CrusaderKings\n1622. r/skyrim\n1623. r/DarkSouls2\n1624. r/Fallout\n1625. r/CPTSD\n1626. r/Kirby\n1627. r/falloutlore\n1628. r/Warmwetpussy\n1629. r/DarksoulsLore\n1630. r/Vocaloid\n1631. r/aspergers\n1632. r/Bakugan\n1633. r/rpghorrorstories\n1634. r/FinalFantasy\n1635. r/justbeginning\n1636. r/ExplainBothSides\n1637. r/ComedyNecrophilia\n1638. r/masseffect\n1639. r/nier\n1640. r/fictionalpsychology\n1641. r/yugiohFM\n1642. r/FalloutMods\n1643. r/shamelessplug\n1644. r/newreddits\n1645. r/YuGiOhMemes\n1646. r/Glitch_in_the_Matrix\n1647. r/OCD\n1648. r/thelastofus\n1649. r/supergirlTV\n1650. r/medical\n1651. r/USPS\n1652. r/Autobody\n1653. r/dogs\n1654. r/lookatmydog\n1655. r/TheSilphRoad\n1656. r/crafting\n1657. r/service_dogs\n1658. r/Plumbing\n1659. r/electricians\n1660. r/personalfinance\n1661. r/glasses\n1662. r/disability\n1663. r/StraightTalk\n1664. r/providence\n1665. r/Baking\n1666. r/pestcontrol\n1667. r/AskHR\n1668. r/PCSX2\n1669. r/MovieSuggestions\n1670. r/verizon\n1671. r/hoarding\n1672. r/jobs\n1673. r/frontierfios\n1674. r/interiordecorating\n1675. r/amateurradio\n1676. r/HomeImprovement\n1677. r/cars\n1678. r/Insurance\n1679. r/BlueStacks\n1680. r/resumes\n1681. r/Bankruptcy\n1682. r/homeless\n1683. r/euphoria\n1684. r/MovieDetails\n1685. r/spreadsheets\n1686. r/VisitingIceland\n1687. r/EliteDangerous\n1688. r/askTO\n1689. r/OnePiece\n1690. r/Polish\n1691. r/duolingo\n1692. r/sony\n1693. r/tech\n1694. r/playstation\n1695. r/AskWomenOver30\n1696. r/AskMechanics\n1697. r/alberta\n1698. r/hungary\n1699. r/Guildwars2\n1700. r/HTML\n1701. r/FrancaisCanadien\n1702. r/VideoEditing\n1703. r/apple\n1704. r/Vive\n1705. r/TowerofGod\n1706. r/uAlberta\n1707. r/WaitingForATrain\n1708. r/Edmonton\n1709. r/WoodenPotatoes\n1710. r/weightwatchers\n1711. r/Overwatch\n1712. r/VRGaming\n1713. r/ArtistLounge\n1714. r/skyrimvr\n1715. r/Blogging\n1716. r/AskPhotography\n1717. r/Sneakers\n1718. r/Entrepreneur\n1719. r/SideProject\n1720. r/IndieDev\n1721. r/Accordion\n1722. r/povertyfinance\n1723. r/Watchexchange\n1724. r/javascript\n1725. r/fintech\n1726. r/work\n1727. r/papermoney\n1728. r/streetwear\n1729. r/portugal\n1730. r/BostonBruins\n1731. r/bettafish\n1732. r/mustdashe\n1733. r/indiegames\n1734. r/stocks\n1735. r/NewportFolkFestival\n1736. r/Saxophonics\n1737. r/gamedesign\n1738. r/Blind\n1739. r/jewelry\n1740. r/LatvianJokes\n1741. r/KindleFreebies\n1742. r/reviewcircle\n1743. r/pens\n1744. r/design_critiques\n1745. r/vinyl\n1746. r/knives\n1747. r/redditdev\n1748. r/css\n1749. r/skiing\n1750. r/gamejolt\n1751. r/IndieGaming\n1752. r/ShinyPokemon\n1753. r/DataHoarder\n1754. r/SomeSayImADreamer\n1755. r/GuessTheMovie\n1756. r/BokuNoHeroAcademia\n1757. r/fatestaynight\n1758. r/DiscordRP\n1759. r/discordroleplay\n1760. r/dating_advice\n1761. r/dating\n1762. r/seduction\n1763. r/galaxynote10\n1764. r/patreon\n1765. r/13ReasonsWhy\n1766. r/Endgame\n1767. r/Watchmen\n1768. r/AskComicbooks\n1769. r/AskLGBT\n1770. r/theumbrellaacademy\n1771. r/RPI\n1772. r/Maplestory\n1773. r/SwitchHaxing\n1774. r/swordartonline\n1775. r/summonerschool\n1776. r/datealive\n1777. r/AzureLane\n1778. r/RenektonMains\n1779. r/fairytail\n1780. r/poshmark\n1781. r/SCP\n1782. r/boburnham\n1783. r/forhonor\n1784. r/pumparum\n1785. r/SummonSign\n1786. r/LovecraftianWriting\n1787. r/libraryofshadows\n1788. r/huntersbell\n1789. r/youngpeopleyoutube\n1790. r/touhou\n1791. r/ProjectMonika\n1792. r/solarpunk\n1793. r/raining\n1794. r/walmart\n1795. r/FindMeADistro\n1796. r/redheads\n1797. r/RedheadGifs\n1798. r/TalesFromRetail\n1799. r/retrobattlestations\n1800. r/heinlein\n1801. r/linuxquestions\n1802. r/Breath_of_the_Wild\n1803. r/kdenlive\n1804. r/xfce\n1805. r/3Dprinting\n1806. r/GIMP\n1807. r/Fedora\n1808. r/IndianFood\n1809. r/VLC\n1810. r/Telegram\n1811. r/linux4noobs\n1812. r/linuxmasterrace\n1813. r/Ubuntu\n1814. r/KitchenConfidential\n1815. r/linux\n1816. r/snapchat\n1817. r/LightNovels\n1818. r/2007scape\n1819. r/LearnJapanese\n1820. r/MobiusFF\n1821. r/paypal\n1822. r/mobilelegends\n1823. r/arenaofvalor\n1824. r/MobileLegendsGame\n1825. r/OnmyojiArena\n1826. r/vainglorygame\n1827. r/musicsuggestions\n1828. r/starbucks\n1829. r/Inktober\n1830. r/Warframe\n1831. r/warframeclanrecruit\n1832. r/dishonored\n1833. r/elderscrollslegends\n1834. r/Blizzard\n1835. r/Firewatch\n1836. r/Smite\n1837. r/Tribes\n1838. r/RecruitCS\n1839. r/Shen\n1840. r/furry_irl\n1841. r/socialskills\n1842. r/Beastars\n1843. r/depression_help\n1844. r/pdX1\n1845. r/Got7\n1846. r/TyrannyGame\n1847. r/PuzzleAndDragons\n1848. r/ADHD\n1849. r/mentalhealth\n1850. r/xbox360\n1851. r/entitledparents\n1852. r/u_MarchingKestrel001\n1853. r/Parenting\n1854. r/Paranormal\n1855. r/occult\n1856. r/DankMemesFromSite19\n1857. r/anime_irl\n1858. r/AceAttorney\n1859. r/GalaxyNote9\n1860. r/sciencefiction\n1861. r/mealtimevideos\n1862. r/Chiraqology\n1863. r/trippieredd\n1864. r/KendrickLamar\n1865. r/brockhampton\n1866. r/VietNam\n1867. r/MacMiller\n1868. r/KidCudi\n1869. r/OzzyOsbourne\n1870. r/RnBHeads\n1871. r/asaprocky\n1872. r/Jcole\n1873. r/rap\n1874. r/readyplayerone\n1875. r/vcu\n1876. r/chicago\n1877. r/liluzivert\n1878. r/Fidlar\n1879. r/rock\n1880. r/LSD\n1881. r/shrooms\n1882. r/Barber\n1883. r/rocksmith\n1884. r/makinghiphop\n1885. r/Green\n1886. r/tytonreddit\n1887. r/democrats\n1888. r/LibertarianSocialism\n1889. r/MNLeft\n1890. r/Grandchase\n1891. r/mushroomID\n1892. r/Permaculture\n1893. r/conspiracy\n1894. r/MushroomGrowers\n1895. r/treedibles\n1896. r/toolporn\n1897. r/ireland\n1898. r/Epilepsy\n1899. r/MMJ\n1900. r/worststory\n1901. r/canoecamping\n1902. r/Xiaomi\n1903. r/mac\n1904. r/macbookrepair\n1905. r/MechanicAdvice\n1906. r/Horticulture\n1907. r/DIY\n1908. r/Morocco\n1909. r/MotherEarth\n1910. r/PostCollapse\n1911. r/rawdenim\n1912. r/NoTillGrowery\n1913. r/fitbit\n1914. r/cannabiscultivation\n1915. r/data\n1916. r/humanure\n1917. r/IsItBullshit\n1918. r/VanLife\n1919. r/CampingGear\n1920. r/Doesthisexist\n1921. r/vandwellers\n1922. r/dragonballfighterz\n1923. r/Vagante\n1924. r/RivalsOfAether\n1925. r/CubeWorld\n1926. r/titanfall\n1927. r/Vaporwave_wallpapers\n1928. r/BattleRite\n1929. r/gamedetectives\n1930. r/hyperlightdrifter\n1931. r/creepy\n1932. r/OverwatchLFT\n1933. r/RandomActsofCards\n1934. r/headphones\n1935. r/russia\n1936. r/france\n1937. r/r4r\n1938. r/Denmark\n1939. r/PipeTobacco\n1940. r/Legoyoda\n1941. r/lifeisstrange\n1942. r/thepromisedneverland\n1943. r/catbellies\n1944. r/ChildrenFallingOver\n1945. r/RespectTheHyphen\n1946. r/deutschememes\n1947. r/titantiersuperpowers\n1948. r/shittynosleep\n1949. r/AAAAAAAAAAAAAAAAA\n1950. r/fivenightsatfreddys\n1951. r/crappyoffbrands\n1952. r/LodedDiper\n1953. r/testing4756\n1954. r/pettyrevenge\n1955. r/battlefront\n1956. r/RandomThoughts\n1957. r/Persona5\n1958. r/DevilMayCry\n1959. r/gay\n1960. r/InsanePeopleQuora\n1961. r/ARG\n1962. r/Deltarune\n1963. r/roommates\n1964. r/FindASub\n1965. r/vita\n1966. r/explainlikeIAmA\n1967. r/Megaman\n1968. r/XenobladeChronicles2\n1969. r/Acceleracers\n1970. r/askmusicians\n1971. r/ask\n1972. r/valkyria\n1973. r/recordingmusic\n1974. r/AskGamers\n1975. r/screenshots\n1976. r/creepyencounters\n1977. r/Hair\n1978. r/problems\n1979. r/airsoft\n1980. r/HappyWars\n1981. r/wartrade\n1982. r/Warframetrading\n1983. r/sweatcoin\n1984. r/centurylink\n1985. r/Terraria\n1986. r/ForFashion\n1987. r/ChineseLanguage\n1988. r/LanguageExchange\n1989. r/slav\n1990. r/slavs_squatting\n1991. r/ForHonorRomans\n1992. r/Norse\n1993. r/learnIcelandic\n1994. r/ForHonorSamurai\n1995. r/pantsinyourpants\n1996. r/Aphantasia\n1997. r/medievaldoctor\n1998. r/PenmanshipPorn\n1999. r/crochet\n2000. r/curlyhair",
        "comments": []
    },
    {
        "title": "[CBSSportsHQ] Since Bruce Arians is coaching in the Super Bowl, it's a perfect time to bring up this stat. Most Rushing TDs by a QB in a season at Virginia Tech Bruce Arians - 11 TDs Michael Vick - 9 TDs Yes... this stat is real 😳 https://t.co/Qo0E4iziLO",
        "url": "https://twitter.com/CBSSportsHQ/status/1355363786597797890?s=19",
        "score": 10095,
        "num_comments": 395,
        "text": "",
        "comments": [
            {
                "author": "cshark2222",
                "score": 3522,
                "text": "Currently at VT and I cannot tell you how much I’ve heard about Arians recently"
            },
            {
                "author": "SANTAAAA__I_know_him",
                "score": 1323,
                "text": "Didn’t even know he played college football until now."
            },
            {
                "author": "None",
                "score": 1478,
                "text": "I didn’t know where this was going and I have to say I did NOT expect that. Bruceyyy"
            },
            {
                "author": "alienware99",
                "score": 326,
                "text": "Michael Vick was the Bruce Arians of his generation"
            },
            {
                "author": "CPOx",
                "score": 260,
                "text": "VT grad here. \n\nBruce Arians ran a wishbone offense while at VT."
            }
        ]
    },
    {
        "title": "[GAME THREAD] Virginia Tech vs. #7 Miami | 7:30 | ESPN",
        "url": "https://www.reddit.com/r/MiamiHurricanes/comments/1fqzisv/game_thread_virginia_tech_vs_7_miami_730_espn/",
        "score": 56,
        "num_comments": 1825,
        "text": "Virginia Tech Hokies 2-2 (0-0) vs. #7 Miami Hurricanes 4-0 (0-0) \n\n\n\n* **Kickoff:** [7:30](https://www.espn.com/college-football/game/_/gameId/401634767/virginia-tech-miami)\n* **Location**/**Weather**:  Hard Rock Stadium / [82°](https://www.wunderground.com/hourly/us/fl/miami-gardens) \n* **Previews**: [Sebastion's Pub](https://sebastianspub.wordpress.com/2024/09/26/game-5-virginia-tech-preview/) | [SOTU Film Preview](https://www.stateoftheu.com/2024/9/25/24252541/miami-hurricanes-football-film-forecast-24-virginia-tech-hokies-at-miami-hurricanes-9-27-acc-ward) | [Sentinel Preview](https://www.sun-sentinel.com/2024/09/25/hurricanes-virginia-tech/)\n* **TV/ Stream**: [**ESPN**](https://www.espn.com/watch/player/_/id/6270fe98-3d11-4a52-9134-875c604d60b5)\n* **Radio**: Live now with Zagacki [560 WQAM](https://www.audacy.com/stations/wqam) | [Hurricanes APP](https://miamihurricanes.com/mobile-app/)\n* **Stats**: [Sports Reference](https://www.sports-reference.com/cfb/boxscores/2024-09-27-miami-fl.html) | [Gamecast](https://www.espn.com/college-football/game/_/gameId/401634767/virginia-tech-miami)\n* **Odds**: Line: MIA -17.5 | Over/Under: 53.5\n\n# Go Canes!",
        "comments": [
            {
                "author": "Skellz_Is_Sus",
                "score": 31,
                "text": "First time in my life, I’ve seen a ref give us a winning call"
            },
            {
                "author": "Harambe18",
                "score": 31,
                "text": "these refs should be fired.... you never call that play a TD in the first place."
            },
            {
                "author": "None",
                "score": 30,
                "text": "Let’s call it like it is. That should have never been ruled a catch in the first place. However, given the replay, I’d be pissed if I was VT. Glad it went our way"
            },
            {
                "author": "LastPhoton",
                "score": 26,
                "text": "From a hold that didnt exist taking away a TD to a pick. The ACC really fucking hates us"
            },
            {
                "author": "califorya22",
                "score": 27,
                "text": "14 point swing on the weakest holding call of my life. Thanks ACC refs"
            }
        ]
    },
    {
        "title": "[Game Thread] #3 Texas Tech @ #1 Virginia (9:20 PM ET)",
        "url": "https://www.reddit.com/r/CollegeBasketball/comments/bb1a7o/game_thread_3_texas_tech_1_virginia_920_pm_et/",
        "score": 1084,
        "num_comments": 21108,
        "text": "[Texas Tech](#f/texastech) **77** @ **85** [Virginia](#f/virginia) - **FINAL/OT**\n\n\n###NCAA Basketball\n [**^Click ^here ^to ^request ^a ^Game ^Thread**](https://www.reddit.com/r/CollegeBasketball/comments/5o5at9/introducing_ucbbbot_an_easier_way_of_making_game/)\n\n---\n [Texas Tech](#f/texastech) **#3 Texas Tech** (31-7) @ [Virginia](#f/virginia) **#1 Virginia** (35-3)\n\nTip-Off: 9:20 PM ET\n\nVenue: U.S. Bank Stadium, Minneapolis, MN\n\n-----------------------------------------------------------------\n\n**[Join us on Discord for more college basketball discussion!](https://discordapp.com/invite/74Bswry)** \n\n-----------------------------------------------------------------\n\n**Television:** \n[CBS](#l/cbs)\n\n\n**Streams:**\n\n\n-----------------------------------------------------------------\n\n**Thread Notes:**\n\n- I'm a bot! Don't be afraid to leave feedback!\n\n- Follow the game on [ESPN](http://www.espn.com/mens-college-basketball/game?gameId=401123374) for preview, play-by-play, more stats, and recap.\n\n- Discuss whatever you wish. You can trash talk, but keep it civil.\n\n- Turning comment sort to 'new' will help you see the newest posts.\n\n- Try [Chrome Refresh](https://chrome.google.com/extensions/detail/aifhnlnghddfdaccgbbpbhjfkmncekmn) or Firefox's [AutoReload](https://addons.mozilla.org/en-US/firefox/addon/auto-reload-tab/) to auto-refresh this tab.\n\n- You may also like [reddit stream](http://www.reddit-stream.com//r/CollegeBasketball/comments/bb1a7o/game_thread_3_texas_tech_1_virginia_920_pm_et/) to keep up with comments.\n\n- [Follow @redditCBB](https://twitter.com/redditCBB) on twitter for news, updates, and bad attempts at humor.\n\n- Show your team affiliation - get a team logo by clicking 'Select Flair' on the right.",
        "comments": [
            {
                "author": "blay12",
                "score": 348,
                "text": "\"something was thrown\"\n\nWe all saw that it was a tortilla."
            },
            {
                "author": "carswelk",
                "score": 169,
                "text": "God I’m only 30 and I’m complaining about how late this game is starting.... I have a dentist appointment in the morning... what’s wrong with like a 730 start time"
            },
            {
                "author": "Salmakki",
                "score": 132,
                "text": "Texas Tech has gone 7 minutes without a field goal\n\nThat is *checks notes* not great"
            },
            {
                "author": "SoapSudsAss",
                "score": 219,
                "text": "Katy Perry?  Where the fuck is Lil Nas X?"
            },
            {
                "author": "iamBlov",
                "score": 108,
                "text": "Can't believe Texas Tech is on a 3-0 run"
            }
        ]
    },
    {
        "title": "Ranking the Top 131 FBS Programs of the Last 40 Years: 19. Virginia Tech",
        "url": "https://www.reddit.com/r/CFB/comments/15jw0zr/ranking_the_top_131_fbs_programs_of_the_last_40/",
        "score": 606,
        "num_comments": 383,
        "text": "[Main hub thread with the full 131 rankings](https://www.reddit.com/r/CFB/comments/12nja3j/ranking_the_top_131_fbs_programs_of_the_last_40/)\n\nEnter Sandman. Time for the age test—if you expected to see Virginia Tech here, congratulations, you are over the age of 20. If not, you either need to have more birthdays or are a Virginia fan. If we just look at 1999-2011, Virginia Tech had 12 Top 25 finishes (6 Top 10) in 13 years, and is the #8 team in my rankings over that time period, including #1 in the ACC. Virginia Tech comes in as the 4th ranked ACC team over the last 40 years behind Clemson, Florida State, and Miami (FL), and for a good 20 years Blacksburg was one of the toughest places to play in the country.\n# Best Seasons and Highlights\n    1. 2000: 4. Virginia Tech: 11-1 (41.314)\n    2. 1999: 3. Virginia Tech: 11-1 (40.257)\n    3. 2005: 4. Virginia Tech: 11-2 (39.725)\n    4. 2007: 9. Virginia Tech: 11-3 (34.342)\n    5. 2009: 9. Virginia Tech: 10-3 (32.842)\n    6. 1995: 9. Virginia Tech: 10-2 (32.264)\n    7. 2010: 14. Virginia Tech: 11-3 (29.931)\n    8. 2006: 15. Virginia Tech: 10-3 (28.745)\n    9. 1996: 11. Virginia Tech: 10-2 (28.673)\n    10. 2004: 11. Virginia Tech: 10-3 (27.770)\n    11. 2011: 19. Virginia Tech: 11-3 (25.629)\n    12. 2008: 14. Virginia Tech: 10-4 (24.223)\n    13. 2002: 16. Virginia Tech: 10-4 (24.049)\n    14. 1998: 15. Virginia Tech: 9-3 (22.814)\n    15. 1993: 22. Virginia Tech: 9-3 (21.108)\n    16. 2016: 19. Virginia Tech: 10-4 (20.113)\n    17. 1986: 17. Virginia Tech: 9-2-1 (20.038)\n    18. 2017: 26. Virginia Tech: 9-4 (14.248)\n    19. 1983: 25. Virginia Tech: 9-2 (13.106)\n    20. 2001: 29. Virginia Tech: 8-4 (10.257)\n    21. 2013: 35. Virginia Tech: 8-5 (10.240)\n    22. 2003: 37. Virginia Tech: 8-5 (9.506)\n    23. 1994: 28. Virginia Tech: 8-4 (9.472)\n    24. 2019: 38. Virginia Tech: 8-5 (4.826)\n    25. 1989: 35. Virginia Tech: 6-4-1 (4.794)\n    26. 2014: 44. Virginia Tech: 7-6 (4.752)\n    27. 1990: 36. Virginia Tech: 6-5 (3.843)\n    28. 1984: 43. Virginia Tech: 8-4 (3.736)\n    29. 1997: 45. Virginia Tech: 7-5 (0.422)\n    30. 2012: 58. Virginia Tech: 7-6 (-3.516)\n    31. 2015: 59. Virginia Tech: 7-6 (-4.951)\n    32. 2020: 60. Virginia Tech: 5-6 (-5.172)\n    33. 1985: 45. Virginia Tech: 6-5 (-5.302)\n    34. 1991: 54. Virginia Tech: 5-6 (-11.077)\n    35. 2018: 74. Virginia Tech: 6-7 (-11.422)\n    36. 2021: 81. Virginia Tech: 6-7 (-15.534)\n    37. 1988: 84. Virginia Tech: 3-8 (-29.896)\n    38. 2022: 106. Virginia Tech: 3-8 (-30.12)\n    39. 1992: 88. Virginia Tech: 2-8-1 (-30.581)\n    40. 1987: 93. Virginia Tech: 2-9 (-38.490)\n    Overall Score: 33772 (19th)\n\n- 317-175-4 record\n- 7 conference titles\n- 13-17 bowl record\n- 7 consensus All-Americans\n- 123 NFL players drafted\n\nFrom 1995-2011, Virginia Tech was 168-51 (.767) while outside of that they’re just 149-124-4 (.545). Frank Beamer really had this program rolling for a while, they even appeared in the AP Top 10 in 10 out of 13 years from 1999-2011. By opting out of a bowl in 2020, Virginia Tech elected to give up the nation’s longest bowl streak at 27 straight years, from 1993-2019. The 7 consensus All-Americans are DE Bruce Smith (1984) who went on to be the all-time NFL sack king with 200 sacks, OL Jim Pyne (1993), DL Cornell Brown (1995) who was the Big East Defensive POTY, DE Corey Moore (1999) who was just 5’11 225 lbs but won the Nagurski and Lombardi Awards and is in the CFB Hall of Fame, RB Kevin Jones (2003) who was the #1 recruit in 2000 and is VT’s 2nd all-time leading rusher, C Jake Grove (2003) who won the Rimington Trophy, and DB Jimmy Williams (2005) who was a finalist for the Thorpe Award. It’s a crime that Michael Vick wasn’t a consensus All-American. Top NFL players include DE Bruce Smith, QB Michael Vick, S Kam Chancellor, OT Duane Brown, CB DeAngelo Hall, WR Antonio Freeman, CB Kyle Fuller, LB Tremaine Edmunds, QB Tyrod Taylor, OG Wyatt Teller, and OT Christian Darrisaw.\n\n\n# Top 5 Seasons\n\n**Worst Season: 1987 (2-9 overall, Independent)**\n\nIn 1987, a man named Frank Beamer stepped into the head coaching role at Virginia Tech, his first time being with the school since his playing days from 1966-68. The previous year, 1986, Virginia Tech had their best season in over 30 years, finishing 9-2-1 with a #20 final ranking. But NCAA investigation would lead to the firing of coach Bill Dooley, replacing him with Beamer. The first year was rough, going just 2-9. But in hindsight, they had a STACKED schedule of coaches. 7(!) opponents had CFB Hall of Fame head coaches in Clemson (Danny Ford), Virginia (George Welsh), Syracuse (Dick MacPherson), Tulane (Mack Brown), Kentucky (Jerry Claiborne), West Virginia (Don Nehlen), and Miami (FL) (Jimmy Johnson). Beamer went 0-7 against them, with a somewhat embarassing loss of 38-57 to Tulane. The two wins were over Navy (2-9 final record) and Cincinnati (4-7), thus Virginia Tech ended up as my 12th worst team of 1987 thanks to a lack of quality wins. NCAA sanctions were levied in 1988, cutting scholarships, and Beamer would go just 24-40-2 in his first 6 years before exploding from 1993-2011. Defensive coordinator Ron Zook ended up coaching Florida and Illinois in the 2000’s.\n\n**5. 2009 (10-3 overall, 6-2 ACC)**\n\n2009 Virginia Tech faced a BRUTAL schedule. #7 VT opened with the Chick-Fil-A Kickoff Game against #5 Alabama, blissfully unaware of what Nick Saban was about to turn Alabama into. It was actually a pretty good game, with Virginia Tech leading 17-16 heading into the 4th quarter before a 24-34 loss. After falling to #14, they’d beat #19 Nebraska 16-15 in a super exciting finish, and blew out #9 Miami (FL) 31-7. People thought Miami would win as the Canes appeared to be back, beating #18 Florida State and #14 Georgia Tech to start the year, but Virginia Tech completely shut them down to move into the top 6. After a 5-1 start, #4 VT was upset by eventual ACC champion Georgia Tech and North Carolina, but would win out, going 5-0 which included wins over Conference USA champion East Carolina (16-3), Russell Wilson’s NC State (38-10), and Tennessee in the Chick-fil-A Bowl (37-14) to finish 10-3.\n\nVirginia Tech was hoping for their 3rd straight ACC title, but a #10 finish was very good, scoring 31.8 PPG while allowing just 15.6 PPG, 9th best in the nation. Defensive coordinator Bud Foster was in his 15th season and was perhaps the best at his job in the country, having finished top 10 in PPG allowed for 6 straight years. Future NFL QB and Hokies’ 2nd all-time leading passer Tyrod Taylor threw for 2311 yards 13 TD 5 INT, also rushing for 5 TD. Freshman RB Ryan Williams took over for injured 1000 yard rusher Darren Evans, exploding for 1655 yards and 21 TD in a 1st Team All-ACC year. WR Jarrett Boykin had 835 yards and would eventually leave as the Hokies’ all-time leading receiver with 2884 yards. WR Danny Coale was a swiss army knife throughout his career, averaging 43.5 yards per punt on 13 punts in 2011, and had 614 receiving yards in 2009, eventually leaving as VT’s 2nd all-time leading receiver to Boykin with 2658 yards! NFL Hall of Very Good S Kam Chancellor was a 2nd Team All-ACC selection.\n\n**4. 2007 (11-3 overall, 7-1 ACC)**\n\nA year full of ups and downs. Very emotional, sometimes wacky, always unpredictable. The April 2007 Virginia Tech shooting rocked the Hokie community, leading to an emotionally charged opener against East Carolina. The Pirates graciously supported Tech by presenting a $100,000 check to Virginia Tech’s memorial fund, and were supportive throughout the leadup to the game. Virginia Tech thankfully won 17-7, starting off things right. But they’d look shellshocked the next week against #2 LSU, losing 7-48 with 9 of 28 passing for 78 yards and 1 INT from QBs Tyrod Taylor and Sean Glennon. It was Virginia Tech’s worst loss since Beamer’s first season in 1987 (hey, that was their worst year!). They regrouped, improving to 6-1 with a 3-0 record that included a 41-23 win over #22 Clemson. #8 Virginia Tech had #2 Boston College in their clutches, up 10-0 with just 2:30 left, but Matt Ryan pulled out some magic and threw a late 24 yard TD pass to win 14-10. Though, it was likely the two would rematch in the ACC Championship game as long as VT kept winning. When Virginia Tech was getting ready for pregame at Bobby Dodd Stadium the following week, a few of their jerseys went missing, and QBs Glennon and Taylor had to wear Georgia Tech practice jerseys with their names scribbled on the back in sharpie. VT had the last laugh in Jerseygate, winning 27-3, and won out (including a 33-21 win over #16 Virginia) to make the ACC title game at 10-2. #6 Virginia Tech rematched #12 Boston College, this time getting the better of Ryan, holding him to 0 TD and 2 INT in a 30-16 Hokie win. VT lost the Orange Bowl against #8 Kansas’ best team ever, 21-24.\n\nVirginia Tech finished 9th in the country in a wild 2007 season. The offense didn’t stand out, with the sharpie jersey brothers’ Sean Glennon throwing 12 TD 5 INT and Tyrod Taylor 5 TD 3 INT. RB Branden Ore was coming off a 1000 yard season and had 992 rushing yards, but averaged just 3.7 YPC. For all the offensive struggles, OT Duane Brown was a 1st round pick and 5x Pro Bowler, and 3 WRs were drafted in the 2008 NFL Draft (Eddie Royal, Josh Morgan, Justin Harper). The defense on the other hand, was one of the best in school history, ranking 3rd in the country with 16.1 PPG allowed. LB Xavier Adibi was a 1st Team All-American, and All-American CB Brandon Flowers led arguably the best secondary in the country along with 1st Team All-ACC CB Victor Harris, and future NFL All-Pro S Kam Chancellor.\n\n**3. 2005 (11-2 overall, 7-1 ACC)**\n\nAll 3 of Virginia Tech’s top 3 seasons were quarterbacked by a Vick. For those who aren’t aware, Michael Vick has a brother, Marcus, who started at QB for Virginia Tech in 2005. For a year that was dominated by #1 USC and #2 Texas hogging their spots the entire year, Virginia Tech was right there with them for some time, ranked #3 at midseason. An 8-0 start included games they probably shouldn’t have won (NC State 20-16), games they won by way too much (#15 Georgia Tech 51-7 on ESPN College GameDay), and games that were statement wins (#13 Boston College 30-10 right before facing #5 Miami). ESPN College GameDay showed up in Blacksburg for the 2nd time in the same year for #3 Virginia Tech vs #5 Miami (FL), with the Hokies looking to apply more pressure to the voters who had USC/Texas at #1/#2. Alas, Miami completely shut down Vick for a 27-7 win. By winning out and another Miami loss, Virginia Tech would make the ACC title game at 10-1, but lost in an upset to 8-4 Florida State for Bobby Bowden’s last ACC title. In the Gator Bowl against #15 Louisville, Marcus Vick stepped on Louisville’s Elvis Dumervil’s calf en route to a 35-24 comeback victory in the 4th quarter.\n\nTech finished #7 in the AP Poll, but I had them up at #4 because they had some really impressive wins like 51-7 over #15 Georgia Tech, 34-17 over #5 finisher West Virginia, 30-10 over #13 Boston College, 52-14 over 7-5 Virginia, and 35-24 over #15 Louisville. Vick was 1st Team All-ACC, throwing for 2393 yards with 17 TD 10 INT and 6 rushing TDs. If he didn’t stay out of trouble, he could’ve had a pretty good career. 2005 was up there with some of the best Virginia Tech defenses ever, giving up just 248 yards per game (1st nationally) and 12.9 PPG (2nd). 1st Team All-American DE Darryl Tapp had 10 sacks, and consensus All-American DB Jimmy Williams was a shutdown defensive back.\n\n2005 Virginia Tech is my 181st best team since 1983.\n\n**2. 1999 (11-1 overall, 7-0 Big East)**\n\nMichael Vick was an otherworldly talent. Not only was he maybe the fastest QB of all time, he’s up there among the strongest arms of all time. No underclassman had ever won a Heisman, but Vick as a freshman would get buzz all season long, ending up as a finalist. But it wasn’t just Vick, this team was loaded with Tech greats like Corey Moore and Ike Charlton. A #11 preseason ranking showed the optimism the media had in Virginia Tech, who was a budding power with a 53-19 record over the previous 6 seasons. A 3-0 start was expected, then an early season rivalry win over #24 Virginia, 31-7, bumped them up to #6 and a win over Rutgers moved them to #4. Virginia Tech hosted #16 Syracuse for ESPN College GameDay, with the Orange unaware of the unspeakable acts that were about to be wrought upon them. By the end of the 3rd quarter, Syracuse had just 3 first downs and 58 yards of offense. #4 Virginia Tech beat #16 Syracuse 62-0, with Tech’s defense alone outscoring Syracuse 21-0. Mind you, Syracuse was a very good program at the time, coming off 4 straight AP Top 25 finishes. It was the largest victory over a Top 25 team in NCAA history! Virginia Tech punched their ticket to their first ever National Championship Game with a 43-10 win over #19 Miami (FL) and 38-14 win over #22 Boston College. In the Sugar Bowl National Championship Game, #2 Virginia Tech was overwhelmed by #1 Florida State, but Vick did everything he could, fighting back from a 21 point deficit to take a 1 point lead into the 4th quarter before losing 29-46. He threw for 225 yards and ran for 97 despite having FSU rushers in his face all game.\n\nMost Virginia Tech fans would probably say this was the best team in school history. I have 1999 lower because of their strength of schedule (58th vs 29th in 2000). Vick threw for 2065 yards 13 TD 5 INT with 682 rushing yards and 9 TD, but played much better than his stats suggested, finishing 3rd in Heisman voting, winning Big East Offensive POTY, and earning 1st Team All-American honors. Consensus All-American DE Corey Moore had 55 tackles and 17 sacks, winning Big East Defensive POTY. Moore stood just 5’11 225 lbs, but was a 2x All-American, 2x DPOTY, won the Nagurski and Lombardi Awards, and his #56 was retired by Virginia Tech in 2010. CB Ike Charlton was a 1st Team All-American, and the CB opposite of him, Anthony Midget (he’s 5’11) led the team with 5 interceptions. K Shayne Graham won Big East Special Teams POTY by hitting 18 of 23 FGs, and went on to play 15 years in the NFL. Frank Beamer won basically every National Coach of the Year award imaginable.\n\n1999 Virginia Tech is my 172nd best team since 1983.\n\n**1. 2000 (11-1 overall, 6-1 Big East)**\n\nBetter than 1999? My model thinks so. Michael Vick returned for his sophomore season to run it back for another national title attempt. An 8-0 start was highlighted by 6 wins against teams that finished with winning records: 52-23 over Akron, 45-28 over East Carolina, 48-34 over Boston College, 48-20 over West Virginia, 22-14 over Syracuse, and 37-34 over Pittsburgh. Unfortunately, in the game against Pitt, Vick suffered a sprained ankle that put him out of the game and he wasn’t able to start for a few weeks afterwards. #2 Virginia Tech at #3 Miami (FL), hyped as potentially the game of the year, would be played by backup QB Dave Meyer. Meyer was serviceable, but VT fell behind early and Vick even came in at one point to try and lead a comeback, ultimately losing 21-41. Virginia Tech won the rest of their games, but despite their 10-1 record and quality loss to the #2 team in the country, were snubbed for a BCS bowl. They settled for #16 Clemson in the Gator Bowl, pwning them 41-20. Vick was the MVP in his final college game.\n\nJust like 2005, I feel that this was an underrated Virginia Tech team, as they finished #6 in the AP Poll but #4 in my rankings. Vick, dealing with injuries, only threw for 1234 yards 8 TD 6 INT with 8 rushing TDs. RB Lee Suggs picked up the slack, leading the country with 27 rushing TDs to go with 1207 yards, winning Big East Offensive POTY. PR Andre Davis was an All-American, returning 3 punts for TDs. Vick was drafted 1st overall in the 2001 NFL Draft, and 11 players total were drafted over the next 2 years.\n\n2000 Virginia Tech is my 152nd best team since 1983.\n# 5th Quarter\nWas 2000 actually the best team, or was it the 1999 National Championship Game team? Would a healthy Mike Vick in 2000 lead Virginia Tech to the national title? Which VT team do you think was snubbed for the top 5 VT seasons? Is Michael Vick a top 5 QB in college football history? Would Marcus Vick have actually surpassed Michael’s college career had he stayed out of trouble? Could he have led the 2006 team to a national title with that #1 defense? Did Danny Coale catch that pass against Michigan in the 2011 season Sugar Bowl? Would you have rather played Logan Thomas at TE instead of QB in college? Which team’s up next?!\n\n[If you appreciate the effort, please consider subscribing on substack!](https://open.substack.com/pub/x86sports/p/ranking-the-top-131-college-football-334)",
        "comments": [
            {
                "author": "None",
                "score": 433,
                "text": "[deleted]"
            },
            {
                "author": "Useenthebutcher",
                "score": 194,
                "text": "Man, that 2000 team was snubbed hard for a BCS bowl. 11-1 with the only loss to the #2 team and they got the fucking Gator Bowl. The Big East was an AQ conference back then, it’s not like they were the MAC. Another reminder that the BCS was just as stupid much of the time as the CFP is"
            },
            {
                "author": "None",
                "score": 309,
                "text": "[deleted]"
            },
            {
                "author": "Moltke-The-Elder",
                "score": 297,
                "text": "We had a good run boys. Not bad for a cow college in southwest Virginia.\n\nHuge thank you to /u/jimbobbypaul as well for taking the team to put together this content. Truly outstanding work and peak offseason material."
            },
            {
                "author": "LegitN00bM00ves",
                "score": 91,
                "text": "Back to back senior military college days ☝🏽\n\nNow we need Texas A&M vs Virginia tech for the senior military college bowl"
            }
        ]
    },
    {
        "title": "[Post Game Thread] #22 Virginia Tech defeats #9 Virginia 65-50",
        "url": "https://www.reddit.com/r/CollegeBasketball/comments/l90edq/post_game_thread_22_virginia_tech_defeats_9/",
        "score": 1454,
        "num_comments": 362,
        "text": "[Box Score](https://www.espn.com/mens-college-basketball/boxscore?gameId=401260251)",
        "comments": [
            {
                "author": "Tman450x",
                "score": 362,
                "text": "LOL. I did not expect that. Impressive win"
            },
            {
                "author": "Farlander2821",
                "score": 318,
                "text": "Don't let the fact we beat UVA distract you from the fact that were 4-0 against ranked teams"
            },
            {
                "author": "mistermachiano",
                "score": 647,
                "text": "Virginia Tech closed the game on a 21-3 run.\n\nFucking kill me."
            },
            {
                "author": "JodBasedow",
                "score": 322,
                "text": "Hoos couldn’t buy a basket with 100 shares of GME."
            },
            {
                "author": "OOrochi",
                "score": 98,
                "text": "Good lord, that last 10 minutes was absolutely terrible. GG Tech, y'all totally outplayed us"
            }
        ]
    },
    {
        "title": "[Game Thread] #10 Virginia Tech @ #7 Florida (12:15 PM ET)",
        "url": "https://www.reddit.com/r/CollegeBasketball/comments/m8jg3n/game_thread_10_virginia_tech_7_florida_1215_pm_et/",
        "score": 287,
        "num_comments": 5288,
        "text": "[Virginia Tech](#f/virginiatech) @ [Florida](#f/florida)\n\n\n###NCAA Basketball\n [**^Click ^here ^to ^request ^a ^Game ^Thread**](https://www.reddit.com/r/CollegeBasketball/comments/5o5at9/introducing_ucbbbot_an_easier_way_of_making_game/)\n\n---\n [Virginia Tech](#f/virginiatech) **#10 Virginia Tech** (15-6) @ [Florida](#f/florida) **#7 Florida** (14-9)\n\nTip-Off: 12:15 PM ET\n\nVenue: Hinkle Fieldhouse, Indianapolis, IN\n\n-----------------------------------------------------------------\n\n**Television:** \n[CBS](#l/cbs)\n\n\n**Streams:**\n[CBS](https://www.cbssports.com/college-basketball/cbk-live/)\n\n\n-----------------------------------------------------------------\n\nTeam | FG% | 3P% | FT% | REB | OR | AST | STL | BLK | TO | PF\n----|----|----|----|----|----|----|----|----|----|----|\n[Virginia Tech](#f/virginiatech) |  |  |  |  |  |  |  |  |  | \n[Florida](#f/florida) |  |  |  |  |  |  |  |  |  | \n\n-----------------------------------------------------------------\n\n**Thread Notes:**\n\n- I'm a bot! Don't be afraid to leave feedback!\n\n- Follow the game on [ESPN](http://www.espn.com/mens-college-basketball/game?gameId=401310906) for preview, play-by-play, more stats, and recap.\n\n- Discuss whatever you wish. You can trash talk, but keep it civil.\n\n- Try [Chrome Refresh](https://chrome.google.com/webstore/detail/easy-auto-refresh/aabcgdmkeabbnleenpncegpcngjpnjkc) or Firefox's [AutoReload](https://addons.mozilla.org/en-US/firefox/addon/auto-reload-tab/) to auto-refresh this tab.\n\n- You may also like [reddit stream](http://www.reddit-stream.com//r/CollegeBasketball/comments/m8jg3n/game_thread_10_virginia_tech_7_florida_1215_pm_et/) to keep up with comments.\n\n- Show your team affiliation - get a team logo by clicking 'Select Flair' on the right. \n\n-----------------------------------------------------------------\n\n###[](#l/twitter) [Follow Our Twitter](https://twitter.com/redditcbb)",
        "comments": [
            {
                "author": "None",
                "score": 72,
                "text": "Love starting with a 7/10 to break like 50% of brackets instantly"
            },
            {
                "author": "IdunnoLXG",
                "score": 44,
                "text": "Does anyone else realize how ridiculously weirdly built humans are compared to every other animal? We legit look like aliens bro."
            },
            {
                "author": "MoneyManeVick",
                "score": 44,
                "text": "Tournament about to start and ESPN spending their time talking about the NFL \n\n*insert clown emoji*"
            },
            {
                "author": "IamBoss",
                "score": 32,
                "text": "6 point game, 31 minutes left, and already 1000 “my bracket is doomed” comments.\n\nThis. Is. March."
            },
            {
                "author": "None",
                "score": 72,
                "text": "Just tested positive for the rona, which means two weeks paid vacation. AMA"
            }
        ]
    },
    {
        "title": "How The Gobble Got Hobbled: A Brief History of Virginia Tech Football BOD (Before Old Dominion)",
        "url": "https://www.reddit.com/r/CFB/comments/9jfvd5/how_the_gobble_got_hobbled_a_brief_history_of/",
        "score": 1170,
        "num_comments": 224,
        "text": "This story ends with Virginia Tech losing 49-35 to Old Dominion in what was supposed to be a recruiting showcase to the talented area around Hampton Roads. Everyone knows that. It was just this past weekend.\n\t\nVirginia Tech is a member of what I call college football’s “young” Tier 2. In the 90s and early aughts, quite a few teams surged upwards and have been good most of the time since. Virginia Tech clearly belongs here, as do Florida, Oregon, Wisconsin, Boise State, and some others. All of those programs have very interesting “rise” stories, in fact they probably have the best tales of how they built sustained success. But Virginia Tech is this week’s spotlight team for all the wrong reasons so I’m covering theirs.\n\t\nThe Hokies being what they are is mostly thanks to two men: Frank Beamer and Bud Foster. Beamer became the VT head coach in 1987, and he spent two recruiting cycles building the Hokies into a more consistent program while dealing with scholarship restrictions. He promoted Bud Foster to defensive coordinator in 1995, after VA Tech’s best two seasons since Beamer’s predecessor Bill Dooley had left in 1986. The Hokies have yet to have a losing record in that span.\n\t\nThis is the story of Virginia Tech football. Before Old Dominion happened.\n\t\n\n\n\t\nVirginia A&M opened in 1872, the year after Blacksburg was incorporated on the eastern slope of the Appalachians. Over the course of time, Virginia A&M grew fast and officially became Virginia Polytechnic Institute, or VPI, in 1944.\n\t\nVPI wasn’t very good at football for a long time. The Hokies’ first bowl was the 1947 Sun Bowl after the 1946 season. Not only was the Sun Bowl undoubtedly the least prestigious of the “old” bowl games, but Virginia Tech was a 3-3-3 SoCon team that got invited because nobody else wanted to play Cincinnati in El Paso on New Year’s Day. Virginia Tech lost.\n\t\nIt wouldn’t be until Bill Dooley was hired in 1978 that Virginia Tech would start to evolve into the lovable above-average team we know today. Dooley is partly responsible for the Hokies being based on turkeys, after taking inspiration from an old school cheer. He also brought success, with seven straight winning seasons throughout the 1980s, including a 9-2-1 Peach Bowl season in 1986 that was boosted to 10-1-1 after Temple forfeited their VT victory. \n\nUnfortunately, Dooley’s recruiting practices were attracting the NCAA’s finest, and Virginia Tech swiftly fired him. This actually led to a massive lawsuit over breach of contract, which was settled out of court.\n\nNow the engineering school in Southwestern Virginia needed another football coach. They decided on the head coach of Murray State and a former defender for the Hokies: Frank Beamer.\n\nFrank Beamer is seemingly the very spirit of the Appalachians and the Mid-South incarnate. Beamer’s great-uncle murdered five people in a courthouse shooting in a fit of rage at a trial. He grew up on a farm not far from that courthouse, and accidentally caused an explosion in a barn when he was 11, leading to scars. He graduated from high school in a town called Hillsville as a multi-sport star. He went to the school an hour north, Virginia Tech, to play football. After completing his collegiate career with some of VT’s best seasons ever, he went to nearby Radford for graduate school, gaining valuable experience as an assistant coach for Radford High.\n\nAfter a few more career moves and with his graduate school done, Beamer eventually ended up an assistant for The Citadel in Charleston. In 1979, he became defensive coordinator for Murray State, and after two years he had his first job as head honcho in Murray.\n\nBeamer did pretty well as the coach of the Racers, finishing his career there with a record of 42-23-2. In 1987, with his alma mater calling, he left for Blacksburg once again. Coming with him was a Murray State grad and low-level defensive assistant named Bud Foster.\n\nBeamer entered into a situation where he was faced with immediate sanctions. It took him over five years to fully overcome this situation, especially for a program that had historically been mediocre before Dooley’s arrival. Nevertheless, Beamer had entered his Hokie career just as the independent was beginning to die in favor of the conference. VT scored big when they were invited to the football version of the Big East with some of the remaining independents with any claim to football pedigree. The original Big East included Boston College, Syracuse, Pittsburgh, Temple, Rutgers, West Virginia, Virginia Tech, and Miami. Miami and Syracuse dominated at first, with good seasons from West Virginia and Boston College as well.\n\nIn 1993, the Big East became a full-fledged conference. In 1993, VT went 9-3 with their only losses on the road to ranked teams. In 25 seasons since, they haven’t missed a bowl.\n\n1995 was Virginia Tech’s real introduction to the greater college football world. They started the season 0-2, with losses to mediocre Boston College and Cincinnati teams at home. After that, they upset a fading Miami dynasty, and never looked back, finishing 10-2, including a Sugar Bowl win over Texas and a #10 ranking in the final AP Poll, the first time ever they’d reached the top ten.\n\nIt certainly helped that Bud Foster was now the defensive coordinator. A blue collar man from a blue collar town, Foster fit in perfectly with Appalachia’s spirit, and it showed. The team acquired an old lunch pail that had once belonged to a coal miner during the season, and after their domination on defense that season, “lunch pail” defense became synonymous with the blue collar approach of Foster and the tenacity of the Hokie defense.\n\nVT kept the solid seasons coming, but it wouldn’t be until 1999 that Virginia Tech would reach their next major milestone. And that came with the help of an 18-year old from Newport News. By the way, Newport News is just across the harbor from Norfolk, where Virginia Tech recently loss to 0-3 Old Dominion in front of dozens of ‘croots. Just a reminder in case you forgot.\n\nMichael Vick came to Virginia Tech, and instantly became one of the most electrifying players in college football history. Virginia Tech would top 30 points all but once in the regular season, thanks to Vick’s unique combination of improvisational running and deadly accuracy in the air.\n\nI just want to interject again here. I was born in 2000, and didn’t get introduced to football until I was 5 or so. Basically, I got like two years of the Michael Vick god mode experience in Blacksburg and Atlanta. Even then, I vividly remember what it was like to watch a team led by Vick. This was 1999. We think of the spread option and the birth of the true dual threat as taking place in the mid-to-late aughts, at least I do. I think of Chip Kelly and Rich Rodriguez.\n\nBut no. The first true dual-threat was coached by a blue collar man in that weird territory where the South and the Yinzers mix. And he was probably the best one ever. You can make a case for Lamar Jackson, and maybe a couple of others. But there’s a real argument that an 18-year old kid at Virginia Tech is the best dual threat ever, and it's been almost 20 years since he’s played in college.\n\nAnyway, 1999 Virginia Tech was a force, and people knew it fast. By the middle of the season, VT was #4, and Vick was setting the world on fire and was in the Heisman conversation as a FRESHMAN IN 1999. VA Tech’s biggest conference rival in the 90s was West Virginia, and WVU was the only team that could pretend to slow down the Hokies. Virginia Tech had to escape Morgantown on national TV 22-20, but after that it was basically a victory lap for VA Tech.\n\nOr a co-victory lap. See, Florida State had finished in the top five every single year since 1987. This is a streak that will likely never be broken unless Saban coaches another ten years without so much as a blemish. It is really one of my favorite stats in this stupid sport and it needs to be talked about more. From 1987-2000, Florida State was considered a top five team EVERY SINGLE YEAR. But anyway, this is a story about a team that has disappointed this year and who was involved in the Labor Day game. Wait…\n\nVT crushed the rest of the Big East, including the skeleton of what would become the ‘01 Miami Hurricanes. They went to BCS Championship 2: Electric Boogaloo to face the only other undefeated that year: FSU. It was the first year where everyone was like “Hey, this BCS thing is really great for the sport and ensures a fair champion.” That sentiment would last maybe three more years.\n\nAnyway, Bowden’s Florida State, the Saban’s Alabama of its time, was way more comfortable with playing in the national spotlight, and Vick finally looked like a freshman. The final score was 46-29, but it was actually one of the most exciting BCS Title Games, especially considering FSU had complete control for three out of four quarters.\n\nThe next season, VT was ranked 11th in the preseason, but before long, they’d shot back up the polls to #2 thanks to Vick being Vick. Alas, their Big East window had closed. Miami had been only OK for the last five seasons after dominating for a decade, and in 2000 The U was back. Miami beat VT in a 2 vs. 3 game in the Orange Bowl, and they had to settle for just going 11-1 again and destroying Clemson and Bobby Bowden’s son in the Gator Bowl.\n\nVirginia Tech was either good or great for the rest of that decade. Michael’s brother Marcus went to VT, but he had a lot of legal troubles and wasn’t the collegiate star his brother was, despite some pretty good games in 2003. Next was Sean Glennon as the VT quarterback. He oversaw a couple of great seasons in 2005 and 2007. \n\n2007 was another major year in this story. The tragic Virginia Tech shooting happened in April of that year, and nonetheless Sean Glennon and a freshman dual threat helped lead Virginia Tech to an ACC Title and a near-miss of the BCSCG. That freshman dual threat QB? Tyrod Taylor. By the way, Tyrod Taylor was recently Drew Bledsoe’d for Baker Mayfield, who led the Browns to their first victory in two years. That means Cleveland has a victory more recently than Virginia Tech does.\n\nTyrod Taylor led Virginia Tech to a few more great seasons in the later part of the 2000s. Beamer and the Hokies became known as a 10-3 team, and they did finish with between 2-4 losses every year from 2004 to 2011. After that sustained level of sticking around tenth in the polls, 2012 saw the first serious drop off for VT since Michael Vick left.\n\nBeamer finished his amazing Virginia Tech career with four straight years of either 7-6 or 8-5 records. Nevertheless, he kept their bowl streak going, and he will always be remembered as the architect and greatest coach of Virginia Tech. He’s now an assistant to the AD in Blacksburg.\n\nJustin Fuente from Memphis entered the fray, and most of this story is now within the realm that most people reading this know what’s happened. Blah blah ten wins again, blah blah promising seasons, blah blah Old Dominion 49-35. There is still one constant from the Beamer years for Virginia Tech though: Bud Foster and the lunch pail. Beamerball is still alive and well thanks to Foster, undoubtedly one of the best defensive coordinators of all time, even if he allowed 49 points to Old Dominion.\n\nAnd now we’re here. Virginia Tech is still 2-1. They have faced an almost unprecedented level of change in personnel, and yet still look like they could be a good team. That is all in spite of losing to Old Dominion. Truthfully, for me, I think Old Dominion 49-Virginia Tech 35 means much more to Old Dominion than it does for Virginia Tech. ODU had already established that they could succeed, since they’ve been an average CUSA team in their first years of existence. Now, they know they can compete with the big boys (And VT is THE big boy in Hampton Roads). \n\nThat doesn’t mean Virginia Tech will suddenly sink to the abyss. It’s not like Old Dominion is Thanos snapping VT into oblivion. Actually yes it is, because all of Thanos’ victims are coming back. We all know that, unless any of my readers are six. VT is still a big school that commands a lot of respect. Not only do they have an amazing athletic reputation, they have one of the best engineering programs in the world, and they’re a senior military college, meaning they keep a corps of cadets just like Texas A&M. With those three draws combined, plus the fact that Justin Fuente resurrected MEMPHIS (who’d been awful for 40 years), I really think VT will be fine and this game will go down as a dark moment before the return of the Gobbling Empire. A really funny (for everyone else) and a really dark (for VT) moment, but just a moment nonetheless.\n\nJust like how South Carolina lost in 2015 to the Citadel, a senior military college where Frank Beamer previously coached. Now the Cocks are back to being good sometimes. You actually forgot about that one, didn’t you, non-South Carolina resident reader?\n\nAnd since I know a lot of the people who read this are Virginia Tech people, and they’ve stuck through a few jabs and a lot of sad nostalgia I’d like to conclude with this:\n\n(breaths in)\n\n**VIRGINIA WAS A ONE SEED FAVORED BY 20 OVER 16 SEED UMBC, AND UMBC WON BY 20 POINTS, IN THE BIGGEST UPSET IN THAT SPORT’S HISTORY. ALSO, THE PREVIOUS RECORD HOLDER OF BIGGEST COLLEGE BASKETBALL UPSET WAS ALSO HELD BY VIRGINIA, WHO LOST TO CHAMINADE WITH RALPH SAMPSON. NOT ONLY THAT, BUT WEST VIRGINIA LOST TO 4-7 PITTSBURGH AT HOME IN 2007 WHEN A WIN WOULD HAVE SENT THEM TO THE NATIONAL TITLE. FURTHERMORE, VIRGINIA TECH IS THE MOST POPULAR TEAM ACROSS VIRGINIA, INTO DC AND ACROSS MUCH OF THE APPALACHIANS.**\n\nAnyway, Hokie Hokie Hokie Hi, Tech Tech VPI.\n\n*gobbles in respect*\n\n~~~~~~~~~~~~~~~~~~\n\n**Edit**: Wow you guys really liked this. Double gold? I'm beyond flattered.\n\nI try and write weekly about CFB history, or at least I'm starting to. I did the Southwest Conference and 2007 writeups from about a jillion years ago, and this is my fourth of this year. I'm hoping to go weekly in season and monthly offseason. So seeing this kinda reception for this brings a big ol' smile to my face.\n\nSeriously, thank you all. Glad you liked it.\n\n~~~~~~~~~~~~~~~~~~\n\n**Edit 2**: Top post on the sub rn????????????? I love you guys. *Insert your team's chant/song/slogan/whatever here*^^except ^^Arizona ^^State",
        "comments": [
            {
                "author": "redditjwh",
                "score": 237,
                "text": "A+ title."
            },
            {
                "author": "None",
                "score": 214,
                "text": ">BUT WEST VIRGINIA LOST TO 4-7 PITTSBURGH AT HOME IN 2007\n\nWhy the hell are you dragging us into this?"
            },
            {
                "author": "MeLlamoBenjamin",
                "score": 367,
                "text": "I came here for schadenfreude and got slapped with a dick. "
            },
            {
                "author": "Bigbysjackingfist",
                "score": 57,
                "text": "> He’s now an assistant to the AD in Blacksburg.  \n  \n*to the*"
            },
            {
                "author": "granville10",
                "score": 48,
                "text": "I went into this thinking, “This is gonna suck.” I didn’t want to read it but I poured some Wild Turkey and soldiered on. And then you actually made me feel a little better. It’s been a long week and I really just can’t wait for Saturday so we can either beat Duke or at least lose a game that won’t make us a punchline.\n\nMy only criticism with this BOD timeline is that Bryan Randall wasn’t mentioned in the Marcus Vick and Sean Glennon part. Bryan Randall was a great player for us who won some big games. \n\nI like Glennon, but he sucked. And fuck Marcus Vick. But Bryan Randall is one of our more underrated players of the last 20 years."
            }
        ]
    },
    {
        "title": "[Game Thread] #4 Virginia Tech @ #1 Duke (9:39 PM ET)",
        "url": "https://www.reddit.com/r/CollegeBasketball/comments/b750id/game_thread_4_virginia_tech_1_duke_939_pm_et/",
        "score": 271,
        "num_comments": 8298,
        "text": "[Virginia Tech](#f/virginiatech) **73** @ **75** [Duke](#f/duke) - **FINAL**\n\n\n###NCAA Basketball\n [**^Click ^here ^to ^request ^a ^Game ^Thread**](https://www.reddit.com/r/CollegeBasketball/comments/5o5at9/introducing_ucbbbot_an_easier_way_of_making_game/)\n\n---\n [Virginia Tech](#f/virginiatech) **#4 Virginia Tech** (26-9) @ [Duke](#f/duke) **#1 Duke** (32-5)\n\nTip-Off: 9:45 PM ET\n\nVenue: Capital One Arena, Washington, DC\n\n-----------------------------------------------------------------\n\n**[Join us on Discord for more college basketball discussion!](https://discordapp.com/invite/74Bswry)** \n\n-----------------------------------------------------------------\n\n**Television:** \n[CBS](#l/cbs)\n\n\n**Streams:**\n\n\n-----------------------------------------------------------------\n\n**Thread Notes:**\n\n- I'm a bot! Don't be afraid to leave feedback!\n\n- Follow the game on [ESPN](http://www.espn.com/mens-college-basketball/game?gameId=401123388) for preview, play-by-play, more stats, and recap.\n\n- Discuss whatever you wish. You can trash talk, but keep it civil.\n\n- Turning comment sort to 'new' will help you see the newest posts.\n\n- Try [Chrome Refresh](https://chrome.google.com/extensions/detail/aifhnlnghddfdaccgbbpbhjfkmncekmn) or Firefox's [AutoReload](https://addons.mozilla.org/en-US/firefox/addon/auto-reload-tab/) to auto-refresh this tab.\n\n- You may also like [reddit stream](http://www.reddit-stream.com//r/CollegeBasketball/comments/b750id/game_thread_4_virginia_tech_1_duke_939_pm_et/) to keep up with comments.\n\n- [Follow @redditCBB](https://twitter.com/redditCBB) on twitter for news, updates, and bad attempts at humor.\n\n- Show your team affiliation - get a team logo by clicking 'Select Flair' on the right.",
        "comments": [
            {
                "author": "poptophazard",
                "score": 45,
                "text": "Sure Zion is good, but let's talk about the fact that Buzz is staying dry AND his vest is still on."
            },
            {
                "author": "Evil_Yoda",
                "score": 32,
                "text": "Zion blocks, hits the taunt button by accident, then contests at the free throw line and AGAIN at the three point shot. The fuck is this man? "
            },
            {
                "author": "Ticklebump",
                "score": 31,
                "text": "JUST A REMINDER THAT THIS EXISTS!\n\nhttps://twitter.com/cjzero/status/1106305817807069185"
            },
            {
                "author": "pauljordanvan",
                "score": 28,
                "text": "Buzz is fucking great. Breaking down basketball and not giving bs answers to questions. "
            },
            {
                "author": "patderp",
                "score": 52,
                "text": "Buzz actually just made a long-winded joke to the television audience of the most important game of his career. You can’t make this shit up bahaha"
            }
        ]
    },
    {
        "title": "[Game Thread] #13 Texas Tech @ West Virginia (02:00 PM ET)",
        "url": "https://www.reddit.com/r/CollegeBasketball/comments/sld0ez/game_thread_13_texas_tech_west_virginia_0200_pm_et/",
        "score": 43,
        "num_comments": 1269,
        "text": "[Texas Tech](#f/texastech) **60** @ **53** [West Virginia](#f/westvirginia) - **0:17 - 2ND HALF**\n\n\n###NCAA Basketball\n [**^Index ^Thread ^for ^February ^05, ^2022**](https://www.reddit.com/r/CollegeBasketball/comments/sl91fn/game_thread_index_february_05_2022/)\n\n---\n [Texas Tech](#f/texastech) **#13 Texas Tech** (17-5) @ [West Virginia](#f/westvirginia) **West Virginia** (13-8)\n\nTip-Off: 02:00 PM ET\n\nVenue: WVU Coliseum, Morgantown, WV\n\nSpread: TTU -5.5 | O/U: 131.5\n\n-----------------------------------------------------------------\n\n**Television:** \n[ESPN](#l/espn)\n\n\n**Streams:**\n[WatchESPN](https://www.espn.com/watch/)\n\n\n-----------------------------------------------------------------\n**Recent Plays:**\n\n\n\nTime | [Texas Tech](#f/texastech) | [West Virginia](#f/westvirginia) | Play\n----|----|----|----|\n0:17 | 60 | 53 | Texas Tech Defensive Rebound.\n0:17 | 60 | 53 | Jalen Bridges missed Three Point Jumper.\n0:31 | 60 | 53 | Texas Tech  Timeout\n0:31 | 60 | 53 | Davion Warren made Free Throw.\n0:31 | 59 | 53 | Texas Tech Deadball Team Rebound.\n\n\nTeam | FG% | 3P% | FT% | REB | OR | AST | STL | BLK | TO | PF\n----|----|----|----|----|----|----|----|----|----|----|\n[Texas Tech](#f/texastech) | 37.3 | 19.0 | 85.7 | 46 | 13 | 8 | 7 | 7 | 12 | 17\n[West Virginia](#f/westvirginia) | 24.2 | 25.0 | 81.0 | 41 | 16 | 6 | 10 | 7 | 9 | 13\n\n-----------------------------------------------------------------\n\n**Thread Notes:**\n\n- I'm a bot! Don't be afraid to leave feedback!\n\n- Follow the game on [ESPN](http://www.espn.com/mens-college-basketball/game?gameId=401368401) for preview, play-by-play, more stats, and recap.\n\n- Discuss whatever you wish. You can trash talk, but keep it civil.\n\n- Try [reddit stream](http://www.reddit-stream.com/r/CollegeBasketball/comments/sld0ez/game_thread_13_texas_tech_west_virginia_0200_pm_et/) to keep up with comments.\n\n- Show your team affiliation - get a team logo by clicking 'Select Flair' on the right. \n\n-----------------------------------------------------------------\n\n###[](#l/twitter) [Follow Our Twitter](https://twitter.com/redditcbb)\n\n^Last ^Updated: ^2022-02-05 ^16:10:26 ^EST",
        "comments": [
            {
                "author": "majesticexpress",
                "score": 25,
                "text": "“These dudes have been banging each other all game long” great announcing lmao"
            },
            {
                "author": "RedRaiderrFaithful",
                "score": 18,
                "text": "Not a big fan of the shit talking from Gabe and the fat WVU fan in the front row while our player is obviously hurt."
            },
            {
                "author": "hard2think2347",
                "score": 17,
                "text": "Man these WVU TTU game threads get toxic lmao I love it"
            },
            {
                "author": "impulsethetruth",
                "score": 17,
                "text": "lmao thats not an offensive foul. this is going to be a long day if they keep getting calls like that"
            },
            {
                "author": "Girlscoutslumb",
                "score": 15,
                "text": "Tech playing pissed-off mode now.."
            }
        ]
    },
    {
        "title": "[Game Thread] #9 Memphis @ Virginia Tech (09:30 PM ET)",
        "url": "https://www.reddit.com/r/CollegeBasketball/comments/r1kk6r/game_thread_9_memphis_virginia_tech_0930_pm_et/",
        "score": 79,
        "num_comments": 1059,
        "text": "[Memphis](#f/memphis) **69** @ **61** [Virginia Tech](#f/virginiatech) - **FINAL**\n\n\n###NCAA Basketball\n [**^Index ^Thread ^for ^November ^24, ^2021**](https://www.reddit.com/r/CollegeBasketball/comments/qq6f02/game_thread_index_november_09_2021/)\n\n---\n [Memphis](#f/memphis) **#13 Memphis** (5-0) @ [Virginia Tech](#f/virginiatech) **Virginia Tech** (5-1)\n\nTip-Off: 09:30 PM ET\n\nVenue: Barclays Center, Brooklyn, NY\n\n-----------------------------------------------------------------\n\n**Television:** \n[ESPNews](#l/espnews)\n\n\n**Streams:**\n[WatchESPN](https://www.espn.com/watch/)\n\n\n-----------------------------------------------------------------\n**Recent Plays:**\n\n\n\nTime | [Memphis](#f/memphis) | [Virginia Tech](#f/virginiatech) | Play\n----|----|----|----|\n0:00 | 69 | 61 | End of Game\n0:01 | 69 | 61 | Nahiem Alleyne made Free Throw.\n0:01 | 69 | 60 | Nahiem Alleyne made Free Throw.\n0:01 | 69 | 59 | Nahiem Alleyne made Free Throw.\n0:01 | 69 | 58 | Foul on Emoni Bates.\n\n\nTeam | FG% | 3P% | FT% | REB | OR | AST | STL | BLK | TO | PF\n----|----|----|----|----|----|----|----|----|----|----|\n[Memphis](#f/memphis) | 39.3 | 26.3 | 80.0 | 45 | 15 | 10 | 8 | 4 | 14 | 21\n[Virginia Tech](#f/virginiatech) | 33.9 | 33.3 | 72.7 | 33 | 9 | 10 | 8 | 0 | 13 | 20\n\n-----------------------------------------------------------------\n\n**Thread Notes:**\n\n- I'm a bot! Don't be afraid to leave feedback!\n\n- Follow the game on [ESPN](http://www.espn.com/mens-college-basketball/game?gameId=401370022) for preview, play-by-play, more stats, and recap.\n\n- Discuss whatever you wish. You can trash talk, but keep it civil.\n\n- Try [reddit stream](http://www.reddit-stream.com/r/CollegeBasketball/comments/r1kk6r/game_thread_9_memphis_virginia_tech_0930_pm_et/) to keep up with comments.\n\n- Show your team affiliation - get a team logo by clicking 'Select Flair' on the right. \n\n-----------------------------------------------------------------\n\n###[](#l/twitter) [Follow Our Twitter](https://twitter.com/redditcbb)",
        "comments": [
            {
                "author": "Farlander2821",
                "score": 26,
                "text": "At this point, just tackle whoever has the ball, only like 50% chance anything gets called"
            },
            {
                "author": "oryp35",
                "score": 24,
                "text": "\"got lucky\"\n\nF these announcers"
            },
            {
                "author": "None",
                "score": 23,
                "text": "“Storm Murphy owed the recruiters stars” fuck these announcers. Every chance they get to take a side they choose Memphis. Acting like they’re gods who can do no wrong and are unbeatable. This game was almost even spread\n\n“These two freshman are really turning it on” *2points each*"
            },
            {
                "author": "RobertGriffin3",
                "score": 22,
                "text": "Perhaps I'm just biased, but are the announcers really moist for Memphis?"
            },
            {
                "author": "ExtremelySexyMan",
                "score": 20,
                "text": "VT fans 🤝 Memphis fans\n\n        Refs bad"
            }
        ]
    },
    {
        "title": "Liviu Librescu was a professor at Virginia Tech and an expert in engineering. In 2007, he blocked his classroom door to protect his students from danger, allowing 22 of them to escape. He lost his life but saved many others through his bravery.",
        "url": "https://www.reddit.com/gallery/1igvnc9",
        "score": 16145,
        "num_comments": 68,
        "text": "",
        "comments": [
            {
                "author": "None",
                "score": 618,
                "text": "[removed]"
            },
            {
                "author": "Admirable_Flight_257",
                "score": 2150,
                "text": "***Read more:*** On April 16, 2007, Virginia Tech professor and Holocaust survivor Liviu Librescu was conducting a solid mechanics class in Norris Hall when the Virginia Tech shooting began. When Librescu heard shots near his classroom, he realized he had only one mission: to save his students. The classroom door, which was not lockable from inside, was his protection. With no other option, Librescu stood in front of the door, and 22 of his students escaped through a window.\n\nLibrescu was 76 years old and in poor health, but he was strong enough to save his students. His standing position reflected his strength and determination. Librescu was born in 1930 in Romania and survived the Holocaust, including internment in a ghetto. After the war, Librescu began a career in aerospace engineering, first in Israel and later transferring to the U.S. in the 1980s, where he taught at Virginia Tech for over twenty years.\n\nWhen the shooting took place, Librescu's heroic action saved lives. After he barricaded the door, the shooter, Seung-Hui Cho, attempted to break it open. Most of Librescu's students had already escaped through the window by then, but a few were injured by the fall. Cho killed Librescu and one student before taking his own life. Librescu's heroic action saved the escaping students, and his bravery was not forgotten by the Virginia Tech community and others.\n\nLibrescu was posthumously decorated with Romania's highest civilian award when he died heroically. His actions initiated a national discussion about school safety, particularly whether or not classroom doors can be closed and locked from within. Librescu's courage continues to motivate others, demonstrating such traits as selflessness, courage, and concern for people's lives.\n\nSRC: [1](https://www.tabletmag.com/sections/news/articles/remembering-liviu-librescu-holocaust-survivor-virginia-tech-professor), [2](https://www.nytimes.com/2007/04/19/us/19professor.html)"
            },
            {
                "author": "IBFibbins",
                "score": 1266,
                "text": "Liviu was an asset to the field of [aeronautical engineering ](https://www.weremember.vt.edu/biographies/librescu.html).\n He authored 4 monographs; 21 chapters in books; 288 articles appeared in Peer-Reviewed Journals; 250 papers included in the proceedings and 190 lectures at national and international conferences and congresses; 40 invited lectures to various Universities of the USA and in more than 10 foreign countries."
            },
            {
                "author": "Metalhed69",
                "score": 326,
                "text": "He was my Dynamics professor (in the same room where he gave his life).  I was going thru a really hard time then. I was married and trying to navigate engineering school and start a family at the same time.  I almost dropped out but he gave me a pep talk and I stuck with it.  He was a great teacher and really cared about his students.  He’s a hero."
            },
            {
                "author": "HectorJoseZapata",
                "score": 235,
                "text": "May his soul eternally rest in peace, brave souldier."
            }
        ]
    },
    {
        "title": "TIL a Romanian-born Israeli and American scientist, engineer, professor, teacher, and a Holocaust survivor, Liviu Librescu, held the door of his classroom during the Virginia Tech shootings sacrificing his life while the gunman continuously shot through the door saving 22 of his 23 students.",
        "url": "https://en.wikipedia.org/wiki/Liviu_Librescu",
        "score": 72398,
        "num_comments": 2476,
        "text": "",
        "comments": [
            {
                "author": "Ut_Prosim",
                "score": 639,
                "text": "I had Dr. Librescu for sophomore Dynamics a few years before this. He was one of the coolest professors I ever had. Years later he would stop you in the hall and ask you about life in general - would remember obscure details about your plans too. One of the few who really cared. \n\nSounds a bit cliche, but when the Department told us that he and another prof were missing, I knew that he had died doing something heroic. It took us a few days to get the details... but I knew it. \n\nI was far closer to him than any of the others, his death affected me by far the most, but it isn't fair to leave out the other heroes.\n________\n[Dr. Kevin Granata](https://en.wikipedia.org/wiki/Kevin_Granata) was just as heroic. He had a third floor office right above the shooting, and when he heard the gunshots, he ran towards them. He had two adorable kids, a lovely wife, a great career - if he had cowered in his office, he would have been fine. Everyone else did. Cho never set foot on the 3rd floor. Nobody would have accused Granata of being a coward for hiding. \n\nInstead he hid kids in his office, then ran to the second floor. When he saw bloodied bodies, he tried to help. He could have probably returned to the third floor, or made a run for it, but again, he chose to stay and help. He pulled a few injured folks to the stairwell before Cho saw him and shot him in the back. \n\nIf he had been just a little less of a hero he'd be here today, maybe a little guilty for not helping, but still here... guess cowardice wasn't in his nature. \n_________\n\nPeople ask why nobody charged Cho. If you were going to die anyway, at least go out fighting, right? Well most people freeze up. But at least one guy died on the attack. \n\nAir Force Cadet [Matthew J. La Porte](https://www.washingtonpost.com/world/national-security/heroism-of-air-force-cadet-in-va-tech-massacre-is-officially-recognized/2015/04/10/24414bf4-df7b-11e4-a1b8-2ed88bc190d2_story.html). As soon as Cho broke in, La Porte charged straight at him armed with a desk. It took seven rounds to stop him. \n\nIf I recall correctly, VT has the most Medal of Honor recipients of any university besides Army and Navy. We are extremely proud of the heroism of our cadet grads. It seems La Porte was made of the same stuff. \n________\n\nI am sure there were others with equally heroic stories, but these are the two I know of."
            },
            {
                "author": "FBI_KILLED_ODB",
                "score": 5050,
                "text": ">He was struck by five bullets, with a shot to the head proving to be fatal\n\nDamn, what a hero."
            },
            {
                "author": "J4CKR4BB1TSL1MS",
                "score": 9003,
                "text": "In case anyone is wondering how come the students didn't die after his death, students were able to flee through the window while he was holding the door. "
            },
            {
                "author": "YokoStudios",
                "score": 1579,
                "text": "That's heartbreaking! What a brave man"
            },
            {
                "author": "malvoliosf",
                "score": 3800,
                "text": "I don't know anything about Librescu, but many survivors are tortured by feelings of guilt: \"Why did I survive while so many died?\"\n\nIf this was the case with the professor, I like to believe his last thoughts were, \"Oh, that's why.\""
            }
        ]
    },
    {
        "title": "American Chemical Society AMA: Hi! I am Amanda Morris, an Assistant Professor of Energy Chemistry at Virginia Tech. Ask me anything about how to make solar energy competitive!",
        "url": "https://www.reddit.com/r/science/comments/5aip84/american_chemical_society_ama_hi_i_am_amanda/",
        "score": 4096,
        "num_comments": 559,
        "text": "Hi Reddit! My name is Amanda Morris and I am a Professor of Chemistry at Virginia Tech. I serve as an ACS Expert in the field of sustainable energy (https://www.acs.org/content/acs/en/pressroom/experts/amanda-morris.html).   This is my second AMA on this topic – you can see my biography and that session’s discussion via https://redd.it/3hfja5\n\n\nSome of the questions people had last year concerned:\n\n\nhow does artificial photosynthesis work; \nhow do the various semiconductor materials used in solar energy work;\nhow does the electrical grid design affect solar energy potentials; \nhow does energy storage technology play a role with solar uptake?\n\n\nI’m happy to answer more about these topics and any others that come to mind. Ask me anything about solar energy!\n\n\nI will return at 11 am ET (8am PT, 3pm UTC) to answer your questions, ask me anything!\n\n(10:50 EST) Hey y'all! I am signed on and replying! I am pumped to see so many comments already!\n\n(1:00 EST) Great time answering your questions! The biggest themes were when is solar cost effective for me, solar cell recycling and life cycle analysis, and Tesla's solar relevant technologies. There are calculators to consider the first point - http://www.solar-estimate.org/ is just one example. First Solar is now recycling solar cell modules for large installations - great news! And, Tesla continues to push the envelope, but the cost effectiveness of such technoogies isn't proven yet.\n\nThanks all! Sorry, I didn't get to most of your questions! Until next time!\n\n-ACS edited adding UTC and fixing punctuation",
        "comments": [
            {
                "author": "Milspec1974",
                "score": 110,
                "text": "Cursory reading indicates that current solar cells operate at 15 to 22 percent efficiency, and degrade up to 35 percent over their expected lifetime, meaning that they will eventually have to be replaced.\n\nDisregarding the initial upfront investment, and arguable financial break-even analysis, I'd like to ask about the life-cycle of solar cells.  What happens to cells that have degraded to the point of uselessness?  Can cells be rejuvenated or refurbished, or can they be recycled in any useful fashion?  If not, what are the financial and environmental impacts to safely disposing of them?\n\nThanks!"
            },
            {
                "author": "nate",
                "score": 158,
                "text": "I've been holding off on buying a solar system for the house because of a fairly high confidence that solar technology will become significantly more efficient and cost effective.  Do you believe we have reached diminishing returns on solar panels yet, or are there still near to medium time span technologies working their way to market?"
            },
            {
                "author": "Likalarapuz",
                "score": 34,
                "text": "Hi, hope this still makes it. I have recently turned my entire office building into a solar farm, I run almost 100% on solar during the \"power hours\" but I don't store. The reason being is because the price of solar panels has gone down and output up gradually each year.... but storage... storage is another thing, they are expensive, somewhat cost prohibited (my saving will never pay for them over their life) and just a bad all around.\n\nWhat is being done in this field, I see solar as what all the cool kids are doing now a days, but storage isn't keeping up. Thoughts?"
            },
            {
                "author": "khendron",
                "score": 27,
                "text": "How quickly do the returns on solar generated electricity reduce as you move north, and have to start dealing with conditions such as deep snow and weaker winter sun?"
            },
            {
                "author": "Eman848",
                "score": 81,
                "text": "Hey I attend Virginia Tech as well, and was wondering how I could get involved with any potential research that you are doing involving solar energy or renewable energy in general.  I am currently studying environmental science and chemistry here at virginia tech, so if you know of the best route to take to get myself involved with your research please let me know.  Go hokies! "
            }
        ]
    },
    {
        "title": "TIL of Liviu Librescu, a Romanian-born internationally renowned professor of aerospace engineering at Virginia Tech. He survived the holocaust. At age 76 he held the door of his classroom shut while the gunman attempted to enter it. Although shot 5 times, only 1 of his 23 students died that day.",
        "url": "http://usatoday30.usatoday.com/news/nation/2007-04-17-vt-victims-librescu_N.htm",
        "score": 7758,
        "num_comments": 289,
        "text": "",
        "comments": [
            {
                "author": "infinite_infinities",
                "score": 559,
                "text": "This isn't the first TIL about this man, I remember once reading the comments on a similar post and it was from a former student of his. They used go to his office hours for help and I think they said something about how excited he'd get when they figured out a problem together. What a great man. I love it when people post about him, more people should hear his story."
            },
            {
                "author": "utspg1980",
                "score": 157,
                "text": "My professor in college was a graduate student under Librescu at VT.\n\nThe day after the shootings, my prof told us in class about the guy. He said he'd heard that Librescu was blocking the door so the students could escape, and said he absolutely believed it because that was the kind of man he was. My prof almost broke down crying in class. My prof was probably 50 years old at the time, so it had been awhile since he was in school himself, but obviously he still felt connected to the guy."
            },
            {
                "author": "mega002",
                "score": 711,
                "text": "Some more [details](http://en.wikipedia.org/wiki/Liviu_Librescu) about his remarkable life and death:\n\nDeath:\n\n* At age 76, Librescu was among the 32 people who were murdered in the Virginia Tech massacre. On April 16, 2007, Seung-Hui Cho entered Norris Hall Engineering Building and opened fire on classrooms. Librescu, who taught a solid mechanics class in Room 204 in the Norris Hall during April 2007, held the door of his classroom shut while Cho attempted to enter it.\n\n* Although he was shot through the door, Librescu managed to prevent the gunman from entering the classroom until most of his students had escaped through the windows. He was struck by five bullets, with a shot to the head proving to be fatal. Of the 23 registered students in his class, one, Minal Panchal, died.\n\n* Caroline Merrey, a senior, said she and about 20 other students scrambled through the windows as Librescu shouted for them to hurry. Merrey said, \"I don’t think I would be here if it wasn't for [Librescu].\n\nHis life:\n\n* Liviu Librescu was born in 1930 to a Jewish family in the city of Ploiești, Romania. After Romania allied with Nazi Germany in World War II, his family was deported to a labor camp in Transnistria, and later, along with thousands of other Jews, was deported to a ghetto in the Romanian city of Focșani.\n\n* After surviving the Holocaust, Librescu was repatriated to Communist Romania. From 1953 to 1975, he worked as a researcher at the Bucharest Institute of Applied Mechanics, and later at the Institute of Fluid Mechanics and the Institute of Fluid Mechanics and Aerospace Constructions of the Academy of Science of Romania. His career stalled in the 1970s because he refused to swear allegiance to the Romanian Communist Party and was forced out of academia for his sympathies towards Israel. When Librescu requested permission to emigrate to Israel, the Academy of Science of Romania fired him. In 1976, a smuggled research manuscript that he had published in the Netherlands drew him international attention in the growing field of material dynamics.\n\n* After years of government refusal, Israeli Prime Minister Menachem Begin personally intervened to get the Librescu family an emigration permit by directly asking Romanian President Nicolae Ceaușescu to let them go. They moved to Israel in 1978.\n\n*  In 1985, he left on sabbatical for the United States, where he served as Professor at Virginia Tech in its Department of Engineering Science and Mechanics, where he remained until his death.\n\n He served as a member on the editorial board of seven scientific journals and was invited as a guest editor of special issues of five other journals. Most recently, he was co-chair of the International Organizing Committee of the 7th International Congress on Thermal Stress, Taipei, Taiwan, June 4–7, 2007, for which he had been scheduled to give the keynote lecture. According to his wife, no Virginia Tech professor has ever published more articles than Librescu."
            },
            {
                "author": "None",
                "score": 52,
                "text": "[deleted]"
            },
            {
                "author": "PilotTim",
                "score": 131,
                "text": "I remember his widow said that she believed he survived the Holocaust just for this moment so he could save those kids."
            }
        ]
    },
    {
        "title": "Science AMA Series: We are professors in the Virginia Tech Macromolecules and Interface Institute working together to develop new materials for 3D Printing, AUA!",
        "url": "https://www.reddit.com/r/science/comments/2t6237/science_ama_series_we_are_professors_in_the/",
        "score": 3331,
        "num_comments": 513,
        "text": "Although Additive Manufacturing (3D Printing) technologies have been commercialized for over 30 years, the list of materials that are able to be processed remains relatively small.  A goal of our research is to expand the materials portfolio of Additive Manufacturing technologies and to gain a better understanding of how the layer-based processing affects the material properties of the printed part.\n\n\nTo accomplish this goal we work collaboratively at the intersection of\nScience and Engineering. \n\n\nDr. Tim Long is a Professor in the Department of Chemistry at Virginia Tech and is also the Director of the [Macromolecules & Interfaces Institute](http://www.mii.vt.edu/) (MII). His [research group](http://www.tlong.chem.vt.edu/) is focused on the design of novel polymer structures and their correlation with physical properties and processing. Prior to joining the faculty at VT (1999) he was employed at Eastman Chemical Company and Kodak. \n\nDr. Chris Williams is an Associate Professor in the Departments of Mechanical Engineering and Engineering Education at Virginia Tech, and is the Associate Director of the MII.  His [DREAMS Lab](http://www.me.vt.edu/dreams/) has a [diverse array of AM technologies](http://www.me.vt.edu/dreams/facility/) that enable processing of polymers, ceramics, metals, and nanocomposites.\n\n\nBy combining our expertise, we are 3D printing many new materials that have never been printed before. For example, we recently [3D Printed objects from a conductive polymer made using an ionic liquid](http://cen.acs.org/articles/92/web/2014/11/Printing-3-D-Conductive-Materials.html).  This material could be used to make ion-conducting membranes for batteries, fuel cells, tissue scaffolds, or electromechanical actuators. The advanced manufacturing of the future will not use materials of the past. We are excited about a future where products are realized by the simultaneous design of molecules, product geometry, and the manufacturing process.\n\n\nWe'll be back later at 2pm ET to answer your questions about the rapid advancements in the materials and technologies of 3D Printing (Additive Manufacturing). Join our presentation followed by a discussion tomorrow during a live webinar at 2pm ET with the American Chemical Society. Registration is free, [here](http://www.acs.org/content/acs/en/events/upcoming-acs-webinars/3d-printing.html).\n\nEDIT(1:45 PM ET):  We are excited to be here today and we look forward to answering questions!  We will be here until 3:00 PM ET.\n\nEDIT (3:10 PM ET):  Thanks for spending time with us today, it was a lot of fun!  We are sorry that we could not get to all the questions!  Please consider joining us tomorrow for our webinar sponsored by the American Chemical Society (2:00 PM ET), visit the ACS web site for registration information.  As always, Virginia Tech is always looking for motivated students who want to work in emerging research fields. For example, the Macromolecules and Interfaces Institute (MII) is an interdisciplinary graduate education program that addresses the intersection of polymeric materials and advanced manufacturing, see www.mii.vt.edu for more information.  \n",
        "comments": [
            {
                "author": "giantnegro",
                "score": 77,
                "text": "Got anything that will meet NASA outgassing requirements for spaceflight and can handle -40 to +60C without permanently deforming or significantly expanding? I build space weather instruments and I'd love print some hyperbolic quadrupoles that don't outgass so much I can get below 10-7 Torr without a turbo the size of a jet engine? And why do they always outgass water?? "
            },
            {
                "author": "lafielle",
                "score": 42,
                "text": "What research is being done to reduce the cost of 3d printing materials (rather than merely making them do new, more advanced things)?"
            },
            {
                "author": "None",
                "score": 153,
                "text": "Hello fellow hokie! \n\nRough estimate, how many years away from downloading and printing hobby grade electronic schematics are we? "
            },
            {
                "author": "Tylerjb4",
                "score": 29,
                "text": "Virginia tech senior chemical engineer here. Is your research team looking to expand at all? "
            },
            {
                "author": "nallen",
                "score": 44,
                "text": "Science AMAs are posted early to give readers a chance to ask questions vote on the questions of others before the AMA starts. \n\nThe Prof. Long and Prof. Williams are guests of /r/science and have volunteered to answer questions, please treat them with due respect. Comment rules will be strictly enforced, and uncivil or rude behavior will result in a loss of privileges in /r/science.\n\nIf you have scientific expertise, please verify this with our moderators by getting your account flaired with the appropriate title.  Instructions for obtaining flair are here: [reddit Science Flair Instructions](http://www.reddit.com/r/science/wiki/flair) (Flair is automatically synced with /r/EverythingScience as well.)"
            }
        ]
    },
    {
        "title": "American Chemical Society AMA: Hi Reddit! My name is Randall Murch, a professor in Public and International Affairs at Virginia Tech. Previously I worked in the FBI forensics Laboratory. Ask me anything about applying forensic science to investigations of bioweapons and other WMD acts of terrorism.",
        "url": "https://www.reddit.com/r/science/comments/5i3e9l/american_chemical_society_ama_hi_reddit_my_name/",
        "score": 3582,
        "num_comments": 233,
        "text": "[ACS AMA](http://imgur.com/hoKm4RT)\r\n\r\nHi Reddit! I am Randall Murch, a Research Lead for Office of the Vice President, National Capital Region, and Professor of Practice, School of Public and International Affairs (http://www.spia.vt.edu/), at Virginia Tech (Virginia Polytechnic Institute and State University). I am based in Arlington, VA, not on our main campus in Blacksburg, VA.\r\n\r\nI am in my second career at Virginia Tech. For my first career, I was a Special Agent and Senior Executive, Federal Bureau of Investigation, U.S. Department of Justice for nearly 23 years. I had field investigative assignments in Indianapolis, IN, Los Angeles, CA early on (primarily national security investigations) and then mid-career in New York, NY (technical operations). I also served in the FBI (Forensic) Laboratory for 10 years as: a forensic biologist (crime scenes, method development and validation, casework lab analysis, reporting, courtroom testimony, providing training), research scientist (human DNA analysis), department head (biological, chemical, materials, physical sciences, firearms and explosive devices) and deputy director for science in the FBI (Forensic) Laboratory. For ca. 8.5 years, I was assigned to various positions in the Technical Investigative Program: as a technical operations planning officer (FBI Headquarters), engineering technology development unit chief (Quantico, VA), technical operations squad supervisor (New York) and deputy division director (Quantico, VA). I led the forensic and technical support to many major terrorism investigations and special events while in the FBI. \r\n\r\nI retired from the FBI in November 2002 and then worked for a Government “think tank” for two years. I have been at Virginia Tech since December 2004. I have extensive knowledge and with the development and operational use of science and technology as it relates to law enforcement, and national, homeland and global security, including at the interfaces of science and technology, operations, policy and law, as well as strategic program development and implementation. I have spent much of the last 20 years focusing on major events, terrorism, and Weapons of Mass Destruction (WMD) terrorism and proliferation. While in the FBI I led the creation of the first—ever WMD forensic investigative program, which originated in the FBI Laboratory in 1996 and now encompasses a number of Federal agencies, national laboratories, universities and companies and collaborates with foreign governments worldwide and has many aspects to it. While in the Government and since from the university, I have worked with many Federal agencies with a variety of missions, foreign governments, and international agencies. I have served on a number of advisory boards and committees, including at the U.S. National Academies (study committees and reports on: establishing homeland security science and technology; advancing life science and technology and impacts on national and global biosecurity; nuclear forensics; improving the U.S. forensic science system; and, defense programs related to chemical and biological defense).\r\n\r\nCurrently my research and program development interests include: biosecurity and counter-bioterrorism; chemical and biological defense (including biosurveillance); advancing forensics and attribution technology, operational capabilities and policy relating to WMD (mainly bio); advancing general forensic science and policy; and understanding and developing solutions at the intersection of biosecurity and cybersecurity.\r\nI have a B.S. degree from the University of Puget Sound, Tacoma WA, a M.S. degree in Botanical Sciences from the University of Hawai’i at Manoa, and a PhD degree in Plant Pathology from the University of Illinois, Urbana – Champaign.\r\n\r\nYou can ask me anything about the technical investigative aspects of catastrophic and WMD terrorism (and how agencies work together for preparedness and response), forensics and attribution of biological weapons/bioterrorism/biological weapons proliferation (I know something about chemical, radiological and nuclear weapons/terrorism too), biodefense, biosecurity, how forensic science relates to investigations, prosecutions and exonerations, forensic science policy, and the current state of forensic science (and where improvements are needed). \r\n\r\n**I will be back at 11am EST to answer your questions! AMA!**",
        "comments": [
            {
                "author": "AmerChemSocietyAMA",
                "score": 53,
                "text": "This is Randall Murch. I'm here now to answer your questions"
            },
            {
                "author": "None",
                "score": 94,
                "text": "[deleted]"
            },
            {
                "author": "jam198",
                "score": 62,
                "text": "As a student currently studying forensics, I have recognized and learned a lot about the current flaws in forensics. What would say is currently the weakest study that needs more research to be done in order to validate it for forensic/scientific use? (I.e. Fingerprint analysis, blood spatter analysis, etc.)"
            },
            {
                "author": "WolfDoc",
                "score": 39,
                "text": "Dear Dr. Murch\n\nWhat is your opinion on the current level of security against bioterror attacks in the US and NATO countries? \n\nDo you feel the efforts are overblown compared to the risk and actual threat, that they are underestimating the threat and potential consequences and countermeasures should be stepped up, or otherwise room for improvement?\n\nI am a researcher working on the epidemiology of *Bacillus anthracis*, *Yersinia pestis* and *Francisella tularensis*."
            },
            {
                "author": "SirT6",
                "score": 39,
                "text": "Hi Randall, and thank you for doing this AMA.\n\nI remember several years ago there was some debate in the scientific community about publishing research on generating increasingly pathogenic flu strains ([for example](http://www.nature.com/news/the-risks-and-benefits-of-publishing-mutant-flu-studies-1.10138)).\n\nHow do you feel about publishing research that has potential to be misappropriated by would-be terrorists? What are the technological limitations preventing would-be terrorists from implementing bio-terrorism on a larger scale? What have you found are the most effective policing measures for preempting these types of attacks (and do policies differ between domestic and international terrorists)? Thanks!"
            }
        ]
    },
    {
        "title": "A Close Call at Virginia Tech",
        "url": "https://www.reddit.com/r/LetsNotMeet/comments/937snn/a_close_call_at_virginia_tech/",
        "score": 1237,
        "num_comments": 78,
        "text": "I’ve had a lot of bad luck in my life when it comes to violent encounters with the wrong sort of people, though unfortunately this wasn’t the first incident, and far from the last. Graduating from a relatively prestigious (still public, sorta…) high school with an emphasis in engineering, I decided without much thought to pursue a degree in engineering in college. In the end, I gained admission to Virginia Tech and headed off to southwest Virginia in August of 2006. Long story short, it was a big and somewhat difficult adjustment and it wasn’t going quite as well as I would have liked.\n\nAs an interesting aside, on the very first day of classes, in fact in my very first college class ever, one of the school staff stuck their heads in the door and told us that classes were cancelled for the day and that we should head back to our dorms and stay there because there may have been a shooter on campus…WAIT WHAT??!? It turns out that there had been an inmate at the local hospital in town and he had killed a security guard in order to escape and the authorities believed he MIGHT head to campus to blend in with the thousands of students. I remember he was caught but I don’t think he was on the campus…I honestly can’t remember that part, but it was kind of a weird way to start college. No huge deal though, right? Well, more like a VERY small dress rehearsal for what was to come later.\n\nAnyway, fast-forward to eight months later, mid-April. I woke up Monday in my dorm room in Cochrane Hall at about 7:30 if memory serves. Looking out my window to the northeast, I could see across the courtyard to West Ambler-Johnston, and down in the courtyard below was an ambulance. \n\nNow you have to understand; Virginia Tech is a huge school. When I went there in 2006-2007, there was something like 26,000 students in attendance. Because the school is located in a rural area, they provided basic medical services and EMS on campus. With this many kids running around, getting drunk, forgetting to take meds, taking TOO MANY meds, having epilepsy, diabetic attacks, etc., it wasn’t super uncommon to see an ambulance on campus, so I didn’t think much of it. I did check my campus email to make sure everything was okay, and in the absence of any warnings about anything, I pulled some clothes and shoes on and shuffled over to D2 (a huge buffet-style dining hall; loved their apple fritters and $1.70 breakfasts) to get some chow before my French class at 9:00.\n\nHaving accomplished this, I proceeded across campus to Holden Hall, which is basically the east wing of a bigger building. The west wing of the building is called Norris Hall. French class started and I think we were talking about Sarkozy and the upcoming French elections, when we started hearing the weird sounds of the PA system outside. The week before had included some minor disruptions to our schedule in the form of prank bomb scares, and we figured some idiot was at it again. No big deal. Boy, were we wrong.\n\nAbout five minutes later, we see some cop cars pull up outside, and about a minute after that, we see MORE cop cars pull up along with a big van, and out of the van come several men dressed in full black body armor with what look like M16s. So…maybe not a bomb scare anymore. At this point, our instructor was having some trouble keeping us focused on our lesson anymore and sort of allowed us to watch what was going on, and someone said we should turn on the TV and see if there was any information on the news. The information wasn’t totally clear from the TV, but it seemed that someone had shot eight people on campus…and I remember us talking and saying that there was no way that it was that many people…\n\nAt this point I decided I should call my mother. I whipped out my phone, not caring that we were still in class, and dialed her up at work. Thankfully, she answered.\n\n“Hey Mom. Are you watching the news right now?”\n\n“No. I’m at work.”\n\n“I know. You should probably turn it on, but I wanted to let you know I’m okay before the phones stop working.” (I recalled from after 9/11 that EVERYONE and their mother was trying to call loved ones that day, so the cell grid was basically overloaded and most calls wouldn’t go through, and I assumed the same thing was about to happen here, even if nothing had actually happened. The grid DID go down later.)\n\nI said goodbye and also called my friend Ally to make sure she was okay, especially since she lived in the same building that I’d seen the ambulance at earlier. She was fine, and I went back to watching the news. It came to light at this point that there had apparently been more than one shooting incident at the school (at Ally’s building, West AJ), and now at Norris Hall, which we’d already figured out on our own. \n\nLooking out the window at the ever-growing sea of cop cars below us on Drillfield Drive and on the field itself, we suddenly hear, outside the windows from the other end of the building:\n\nCRACK\n\nCRACKCRACK\n\nWe all looked at each other and suddenly this was way more serious. This was real. People were being shot inside our building.\n\nAt this point, we decide that maybe we should be a little more proactive about our safety. We turn the lights off, turn the TV off, and start rearranging the furniture in the room to block the door, though admittedly the makeshift barricade probably wouldn’t have stopped a really determined person from getting inside since the door had frosted glass on its upper half instead of being solid. We figure that this is better than nothing though, and sit down on the floor near the front of the room, talking to each other in hushed tones.\n\nAfter about fifteen minutes, we hear footsteps outside the room.\n\nEveryone freezes and no one makes a sound. I remember looking up from the floor towards the door wondering if this was it. \n\n*Is this how I die?*\n\nA few seconds later, we hear a tap on the door and a deep voice:\n\n“This is Deputy So-And-So of the Thus-And-Such Sheriff’s Department. Stay where you are, leave your lights off and stay quiet. We’ll be back for you as soon as we can.” (This was NOT a member of either the campus police or the Blacksburg police, but from looking out the window we already knew that there were cops there from everywhere within driving distance.)\n\nWe all look around at each other in solemn silence. We’d all just been thinking the same thing before the deputy had spoken. Thankfully he hadn’t asked us to open the door, because I don’t think anyone would have even gotten up from where they were sitting.\n\n***************\n\nWe stayed down and quiet for a couple more hours. I can’t really remember what it was we talked about while I was there since we were all so keyed up. It’s been a long time waiting and then we hear footsteps again outside the door.\n\nThis time, we saw evidence of who the man was before he spoke: a gold badge pressed up against the frosted glass assured us that what we heard was legitimate.\n\n“This is Deputy So-And-So again. It’s time to go.”\n\nWe all quietly got up and grabbed our backpacks. A couple of guys in the class, myself included, started pulling the tables away from the door as quickly and quietly as we could, and then we cracked the door. I think on some level, all of us expected that this was a trick, but when we opened the door, standing a few feet away was a sheriff’s deputy in uniform with his sidearm drawn and held at his side. He held his finger up to his lips, indicating we should be quiet, and he dropped his voice to a whisper.\n\n“You’re going to walk downstairs as quietly as you can. There are two more cops by the door outside; they know you’re coming. Just walk straight outside and don’t stop.” He nodded at us and we started making our way downstairs. He got on his radio and signaled, “Students coming out.” When we got to the midway landing we could see the front door cracked and a cop peering in. Walking up to the door, he opened it wider to let us pass, and as he did, he looked straight at us and said quietly, but VERY seriously after signaling on his radio:\n\n“RUN.”\n\nWalking out that door into the morning light, I was greeted by a sight I will never forget. I have never seen so many cop cars in one place in my entire life, and honestly I hope I never have cause to again. There were easily two or three hundred Crown Vics and a smattering of additional vans, trucks, and command center vehicles crowding every inch of space starting about a hundred feet from that door. In front of those vehicles stood a phalanx of at least forty officers armed with M16s and even a couple of MP5s, directly in our path. As soon as we were outside, the several cops to the left and right of this formation waved at us in an unmistakable gesture of *move your ass!* We ran off to the left of the cops with the big guns, over Drillfield Drive, and onto the Drillfield itself, and didn’t stop until we were almost to the other side.\n\n***************\n\nI read the news online after I got to my dorm. MSNBC had something at the bottom of an article that said something like “If you have any information about this, please contact us at [generic corporate email address]. Thinking little of it, I emailed them with my contact info, and within ten minutes, my phone absolutely blew up. I was beset with interview requests and questions from at least twenty different people, and actually arranged to meet their news crew down at the Inn (the on-campus hotel) that evening.\n\nI ended up doing two national interviews, one on Scarborough Country, and another with Geraldo Rivera (who was kind of self-absorbed but was cool enough to order us pizza and sit with us while we ate before the interview), the second with my two friends who had agreed to accompany me down to the circus that the Inn had become. I did a few more for some local radio stations and some print news before deciding that I’d had quite enough for the day and went to my dorm to get some sleep.\n\nI hadn’t really been sold on the whole college experience up until that point, but strangely enough, if anything, the whole experience seemed to bring me and my friends closer together for that last month at school. Luckily for me, no one I knew was hurt beyond a friend of a friend breaking his leg badly from jumping out the window from Professor Liviu Librescu’s classroom (check this guy out; an engineering professor who survived the Holocaust and as his final act held the door of his classroom shut to give his students time to escape; he died at the scene, but was really a hero), and one guy I didn’t know from my art history class was killed.\n\nThe rest of the tragedy is part of the public record. I’m sad to say that I left Virginia Tech after that year (for completely unrelated reasons) and always missed it, but I still talk to my friends from that first year, and I miss both the place and their company. Virginia Tech seems to have had a horrible patch of bad luck starting in 2006 and lasting for a few years, also including a really gruesome beheading in a dining hall, an accidental death and a suicide (both guys went out of upper-storey windows), a close call with carbon monoxide poisoning for the entire cheerleading team at the Inn, all in the year following the big shooting. They also had a couple who were attending the school abducted and murdered a few years ago, but IIRC, it happed farther north in the state (I think near Charlottesville). Luckily, I never experienced any of that. I think I’d fulfilled my quota of random bad luck, at least for a while. \n\nCho Seung-Hui, I’m really glad we never met, and also that we never will.\n\nEDIT: There is actually a picture of us in our classroom on the Wikipedia article about the shooting. You can just barely see me in my tan beanie with the orange stripe directly to the right of our teacher (woman in the pink shirt) and above the guy with the black and white striped shirt.\n\nEDIT: It has come to my attention that it may be in bad form to post images that aren't from Imgur, so here's a different link to the same image. You can still see the original on Wikipedia.\n\n\nPhoto: https://imgur.com/gXRNpAm",
        "comments": [
            {
                "author": "jackiee93",
                "score": 121,
                "text": "Holy fuck. It’s crazy to read this from someone’s perspective who was actually there. I was in 9th grade when this happened and remember seeing the media outside of my school trying to talk to students (I went to the same high school as the shooter)."
            },
            {
                "author": "Owls1978",
                "score": 124,
                "text": "This must have been extremely tough to recount. I think you should consider crossposting in r/truecrime.\n\nHaving grown up in Staunton most of my classmates attended either UVA or Tech. I was part of a smaller percentage that opted for more distance from home (ODU). \n\nBoth Charlottesville and Blacksburg had such a sense of safety and security. I visited my friends regularly at both schools. It always amazed me that they were wary to visit mine...due to perceived danger.\n\nMy class graduated from high school more than a decade prior to the shootings, but I almost felt that a little bit of my remaining innocence shattered that day, too. I was living in Kansas City, and I began reaching out to friends that might still have been in grad school.\n\nWe live in Roanoke now. Most of our neighbors and their children have all attended Tech (again, all prior). \n\nIn a world desensitized by daily mass shootings emblazoned on our morning news, your account gives an insight that younger generations should understand. This was not an everyday occurrence. This chipped away at our very core of daily life. \n\nI will definitely read about the professor that sacrificed himself for his students. What an imaging human being. Thank you for sharing your story.💜"
            },
            {
                "author": "HalfManHalfPear",
                "score": 66,
                "text": "I'm sorry this happened to you. You have a knack for storytelling though. I was absolutely captivated "
            },
            {
                "author": "Anniecski",
                "score": 87,
                "text": "Thank you for writing this.\n\nWhen I was in high school, there was a boy in my neighborhood that I got to know. We'd share rides to basketball games and that sort of thing. He was always very sweet, and I thought he looked a little like Christopher Reeves. \n\nAfter high school, we lost touch. It turns out, he went away to school, received multiple degrees, and spent some time in the military.\n\nWhen the shooting started at Virginia Tech, he locked some students in his office there -- he was a professor -- and ran toward the noise, hoping he could help stop the shooter. He was murdered in the hallway. \n\nEvery time there is another mass shooting, we dishonor the victims of all the shootings that happened before, because we have still not learned our lesson."
            },
            {
                "author": "eggpal33",
                "score": 27,
                "text": "I’ll be attending Tech in the fall, living in West AJ. Reading this and recognizing the names of the buildings and the references to D2 and all made this absolutely terrifying, I can’t even imagine what it would have been like. I’m glad you and your friends were okay"
            }
        ]
    },
    {
        "title": "I'm Max Karson, I was (quite publicly) arrested in college for comments about the Virginia Tech shooting",
        "url": "https://www.reddit.com/r/IAmA/comments/abli1b/im_max_karson_i_was_quite_publicly_arrested_in/",
        "score": 0,
        "num_comments": 2164,
        "text": "Edit 2: To respond to the most common questions--I'm fairly left-leaning politically (you can be a liberal and also provocative), I have never deleted posts for the purpose of hiding my views (they're all over my channel and the internet in general), and the idea that I'm a psychopath, while seductive, is not true. I just say what's on my mind and that freaks people out.\n\nEdit: Watch the [video](https://youtu.be/4hNrVvqYHtE) I made (containing excerpts from all of my classmates' and professor's interviews with police, and my interview with police the day I was arrested) if you're interested in hearing what actually happened. None of the news stories are accurate because I was advised by lawyers to keep silent. If you look at the top comments, you will see why.\n\nThis is the first time I have spoken publicly about the whole affair. I posted a [video](https://youtu.be/4hNrVvqYHtE) about it today, but here's the TL;DW:\n\nIn a women's studies class, the day after the shooting, our professor asked us to discuss and try to understand the Virginia Tech shooting.\n\nAfter hearing the usual \"thoughts and prayers\" from my classmates, I suggested we'd be better served by empathizing with the shooter, his anger and isolation, and use that as a framework for coming up with changes we can make to our education system that might actually help prevent shootings in the future.\n\nI said that we've all had violent thoughts, and if we pretend we haven't, we're lying. We live in a violent society (the U.S.) and humans are violent animals. Instead of pretending that isn't the case, we should figure out why that violence is being directed toward institutions like schools, especially huge crappy schools that dehumanize their students.\n\nRather than engage me in an intellectual way, the teacher announced that I had raised the specter of the possibility that I was going to murder all my classmates on Thursday. I said this was not going to happen...\n\nBut because of my history of writing politically incorrect things, the chair of the women's studies department (not present in the class) called the police and told them that I'd threatened to kill everyone.\n\nI spent the night in jail and was barred from campus for 10 weeks, only to be let back in after a psychological evaluation. AMA.\n\nProof:\n\n[https://imgur.com/a/JlU1B9D](https://imgur.com/a/JlU1B9D)\n\n[https://www.denverpost.com/2007/04/18/cu-student-arrested-for-comments/](https://www.denverpost.com/2007/04/18/cu-student-arrested-for-comments/)",
        "comments": [
            {
                "author": "sheepsleepdeep",
                "score": 742,
                "text": "Dude you wrote a suicide note in your campus newsletter. How the hell did you not expect people to think you were dangerous when you make comments like that after publishing a newsletter like that?"
            },
            {
                "author": "Go_To_Bethel_And_Sin",
                "score": 1710,
                "text": ">During a discussion of the shooting in a gender and race class, Max Karson made comments sympathetic to the VT shooter, saying “if anyone in here says that they’ve never been so angry that you wanted to kill 32 people, you’re lying,” and that he was “angry about all kinds of things, from fluorescent light bulbs to the unpainted walls, and it made him angry enough to kill people.” Karson was also reportedly asked: “Would you kill all of us?” His response: “No. Not all of you.”\n\n\n[source](http://www.quizlaw.com/blog/max_karson.php)\n\n\nWhy did you exclude so much of this context from your OP?\n\n\nedit: [more reliable source](https://www.google.com/amp/s/www.denverpost.com/2007/04/18/cu-student-arrested-for-comments/amp/)"
            },
            {
                "author": "AdamWestsBomb",
                "score": 848,
                "text": "Why did you not have the social cognitive skills to recognize that maybe talking about empathizing with a guy who just murdered 32 people YESTERDAY is inconsiderate at best and disrespectful at worst?\n\nWhy are you deciding to bring this up almost 12 years later?\n\n~~Is this you attempting to gain subscribers to your youtube channel?~~\n\nNever mind. That's exactly what this is. You spam your videos to multiple subreddits but they haven't really taken off, so you're hoping to use the provocative nature of your post to promote your channel.\n\n&#x200B;"
            },
            {
                "author": "Lord_Raiden",
                "score": 666,
                "text": "Can you expound upon \"my history of writing politically incorrect things\"?"
            },
            {
                "author": "sheepsleepdeep",
                "score": 294,
                "text": "Did you really say things like bright fluorescent lights and unpainted walls made you angry enough to kill people? Because I would have called the cops on you too dude."
            }
        ]
    },
    {
        "title": "I just watched a debate between Mormon apologist Kyle Adams and a Virginia Tech professor. The topic was Noah’s Ark and afterwards I went down a rabbit hole. Someone in his ward might want to tell him to stop.",
        "url": "https://www.reddit.com/r/exmormon/comments/1cl0900/i_just_watched_a_debate_between_mormon_apologist/",
        "score": 233,
        "num_comments": 42,
        "text": "The professor seemed shocked by the depth of Kyle’s stupidity. I learned during the debate that Kyle is from St. George, a flat earther, and a moon landing denier. I then watched him debate atheists on Mormonism. This was not wise. He is not smart and his advocacy for his faith is both embarrassing and cringeworthy.\n\nAnd then I learned he has something called the Flat Earth Institute of Science. Scimandan has several videos dunking on him.\n\nI am shocked that no one in his ward or stake has taken him aside and asked him to stop. \n\nMy favorite quote from the Noah’s Ark debate responding to a point that Chinese history predates the flood: \n\n“There were no Chinese back in the days of the flood.”",
        "comments": [
            {
                "author": "anonymousredditor586",
                "score": 149,
                "text": "How do you disprove written history?\n\nTHE PEOPLE WHO WROTE IT DIDN’T EXIST ACTUALLY.\n\nBrilliant. 🤣"
            },
            {
                "author": "Ok-End-88",
                "score": 65,
                "text": "Kyle sounds like he’s already enrolled in the QAnon school of Idiocracy. 🤣"
            },
            {
                "author": "BeachHeadPolygamy",
                "score": 34,
                "text": "The church doesn’t care what you do or say as long as you don’t drag the church’s name with you. You can molest as many kids as you want or tell kooky moon landing stories, just never criticize “the brethren” or damage “the good name of the church.”"
            },
            {
                "author": "GayMormonDad",
                "score": 19,
                "text": "I forget, does the book of Mormon reference Noah and his ark?  \n\nIf so, what more truth do you need? /S"
            },
            {
                "author": "None",
                "score": 9,
                "text": "Hey flat earthers make the best apologists because if man never really walked on the moon then JS was probably right about moon Quakers, lol"
            }
        ]
    },
    {
        "title": "Former Communications Professor at Virginia Tech Sentenced to Prison Time for Possession of Child Pornography",
        "url": "https://www.justice.gov/usao-wdva/pr/former-communications-professor-virginia-tech-sentenced-prison-time-possession-child",
        "score": 121,
        "num_comments": 17,
        "text": "",
        "comments": [
            {
                "author": "thedailypeanutbrain",
                "score": 45,
                "text": "absolutely horrifying. I heard that he was a hunting instructor for tweens and teens as well? I hope those kids who came in contact with him are unharmed and safe."
            },
            {
                "author": "starfireflare",
                "score": 63,
                "text": "Absolutely disgusting- I always had a weird feeling about him I couldn’t put my finger on. I took his class in the last year in 2023-2024. I cannot believe he taught after everything was seized in 2021, but I guess he had to pay his attorney fees somehow. Meanwhile, VT hasn’t said anything about it."
            },
            {
                "author": "XxSteelPhoenixX",
                "score": 6,
                "text": "Yo, he came in to talk to my graduate class as an invited speaker. I think he was talking about all the software and stuff they used and talked about his COVID project. It seemed like he could be capable of something like this, but this is wild."
            },
            {
                "author": "None",
                "score": 9,
                "text": "Damn. I had this guy."
            },
            {
                "author": "Trevs",
                "score": 2,
                "text": "Yeah he was an odd guy I had a class with him his first year at Tech. Fucking ew."
            }
        ]
    }
]